{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/abstract-photography-1#blogposting",
  "headline": "Abstract Photography - Visual Reference | Professional Guide",
  "alternativeHeadline": "Abstract Photography - Visual Reference | Professional Guide | Alan Ranger Photography",
  "description": "Abstract photography is the art of showing a subject independent of the visual references in the world. Sign up for abstract photo classes | Photography Blog.",
  "url": "https://www.alanranger.com/blog-on-photography/abstract-photography-1",
  "datePublished": "2015-04-30T00:00:00.000Z",
  "dateModified": "2015-04-30T00:00:00.000Z",
  "dateCreated": "2015-04-30T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "ABSTRACT PHOTOGRAPHY - VISUAL REFERENCE | PROFESSIONAL GUIDEABSTRACT PHOTOGRAPHY IS THE ART OF SHOWING A SUBJECT INDEPENDENT OF THE VISUAL REFERENCES IN THE WORLD.Abstract images appeal more to the emotional rather than logical receptors within us. From birth and through infancy we are stimulated to respond to the visual stimulation of colour, shape and form.Abstract images have a wide interpretation through the subjective nature of the content, the use of composition to communicate the photographer’s vision is often informative and intriguing - it connects us on an emotional level in a way that other photographs don't.IT’S ANOTHER WORLD ALL TOGETHER…You only need to look at the abstract photography I’ve done in the past to see that it’s a completely different area of photography all together. Anything can be a subject in abstract photography as you can really experiment with your shots. No matter if your subject is natural or man-made, you can always enjoy discovering their textures, patterns and intricate details.You don’t even need to step outside your front door to see what it can offer you. The possibilities of abstract photography are all around us; in our homes, gardens, even hidden in the objects that are used to decorate them. This is why this form of photography is so accessible to people regardless of age or skill; a form of photography that has no boundaries.View fullsizewater abstractTHAT ANYONE CAN EXPERIENCE…Abstract photography is homes, gardens, even hidden in the objects that are used to decorate them. This is why this form of photography is so accessible to people regardless of age or skill; a form of photography that has no boundaries.View fullsizewater abstractTHAT ANYONE CAN EXPERIENCE…Abstract photography is so diverse and obtainable, that with the right know-how, anyone can succeed in creating wonderful shots, giving us a unique view into the unknown. One of the many wonders of abstract photography is that you can take one subject and transform it into something original, something that will captivate the minds of all those who look upon it, evoking their emotions.What most photographers tend to focus on is the colours, shapes and angles of a shot; which is true in any form of photography. However with abstract photography the end reaction is far more emotional and more deeply felt than regular photographs. By utilising these three features, you have the potential to truly discover the beauty of this art. An art I can help you perfect…AND YOU CAN STEP INTO IT TODAY.You can learn the secrets about what makes abstract images work well by joining my abstract photography course starting this March. I can guide you through the world of abstract photography so you can experience the wonders of this marvellous venture.View fullsizeoil and water abstractnews Alan Ranger 0 Tumblr 0 Likes",
  "wordCount": 460,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/abstract-photography-1#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/abstract-photography-1#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}