{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/advanced-editing-with-nik-collection#blogposting",
  "headline": "Tip of the day - Advanced Photo Editing with NIK Collection",
  "alternativeHeadline": "Tip of the day - Advanced Photo Editing with NIK Collection | Alan Ranger Photography",
  "description": "Tip of the day - Advanced Editing – Using NIK Collection. Learn Photography - Editing Software – Advanced Editing with NIK - Color Efex Pro 4 - Using Filters.",
  "url": "https://www.alanranger.com/blog-on-photography/advanced-editing-with-nik-collection",
  "datePublished": "2020-07-16T00:00:00.000Z",
  "dateModified": "2020-07-16T00:00:00.000Z",
  "dateCreated": "2020-07-16T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "TIP OF THE DAY - ADVANCED PHOTO EDITING WITH NIK COLLECTIONADVANCED PHOTO EDITING WITH NIK COLLECTIONI intend to post a new photography tip each morning to my client base on the mailing list. Sign up here if you want to receive these by email Hopefully, with more downtime you will be able to read and learn photography basics or refresh your understanding. I’ll aim to make them limited to a sixty second read.----------------------------------------EDITING SOFTWARE – ADVANCED EDITING WITH NIK COLLECTIONCOLOR EFEX PRO 4 - USING FILTERSIn the previous Tip of the Day posts on Editing, I shared what software I use and how the DXO Nik Collection has been a goto plug-in for Lightroom and Photoshop in my workflow. I’ve been a user and educator of NIK since year dot and still find it meets all my needs eight-ten years on. There are frustrating elements with it, some have been fixed by DXO since they rescued it from Google a couple of years ago but the list of developments and new features seems to never get any traction and progress despite an active user forum . I am sure they have a roadmap but I’ve never seen it (its certainly not a motorway) and I know plenty of you who haven’t upgraded to the paid latest version because of the lack of new features and improvements. Hopefully, DXO is listening (Kathryn). That said, it is the best option on the market for those who are not photoshop guru’s and want an effectiv s certainly not a motorway) and I know plenty of you who haven’t upgraded to the paid latest version because of the lack of new features and improvements. Hopefully, DXO is listening (Kathryn). That said, it is the best option on the market for those who are not photoshop guru’s and want an effective and quick way to add professional touches to their images.The first thing that a new user has to learn is that Color Efex, Silver Efex, Viveza and so on all work slightly differently and use different terms for the same thing in different modules. (A hang-over from the original NIK legacy product) So a preset in Silver Efex is called a Recipe in Color Efex. Color Efex has a list of filters and Silver Efex doesn’t. None of these are show-stoppers but you take a little longer to get used to the differences.Color Efex Pro 4 is probably the best of the bunch and Silver Efex for B&W conversion from a colour RAW image. Today, I will focus my tips on Filters and their use and creating Recipes for future use. I published a list of filter definitions yesterday so take some time to get to know them and mark them as a favourite (click the star next to the filter in the list to turn it yellow) That will reduce the amount of scrolling required.----------------------------------------A FEW BASICS FIRST - FILTERSFilters * When you open your image in Color Efex it will load up the last filter used. If you don’t want that filter then select an alternative one from the list from the left panel. * If you want to add an additional filter on top of the existing filter, click on the + Add Filter. You can rearrange the order of the filters by dragging and dropping them in the list on the right panel. * Toggle the filter on and off to see the impact of it by toggling the tick box top right of the filter box in the right panel. * Move the sliders back and forth until you feel the balance and impact you want is right.NIK COLLECTION RECIPESOnce you have created a combination of filters with the sliders set to give you a style/look you can save those as a recipe for future use and to speed up the editing time next time round.So for example the image of the woodlands was edited within a few minutes because I had created a “woodland recipe” from previous images. The use of sunlight filter in conjunction with the others allowed me to go from a RAW file, first image to Color Efex using my recipe and back into Lightroom for final tweaks very quickly.On some images I may repeat the round-trip to Color Efex two or even three times. Unfortunately, the software doesn’t allow you to apply more than once recipe to an image so it requires going back to Lightroom after the first recipe is applied and then back into Color Efex a second time to add the next recipe again.Filter DefinitionsView fullsizeCreating a recipe - WoodlandsView fullsizeTwo trips into Color Efex. First image RAW, second image top is first recipe applied in Color Efex, third image bottom-middle the second recipe applied and last image on right the final image after some more LR tweaks.I will continue to add some more tips and examples in due course, but meantime sign up for one of my webinar, online photography class tutorials on Editing in NIK and Silver Efex for B&W.Editing with LR and NIK Color Efex B&W Editing with Silver Efex B&W Editing with Silver Efex Free QA Webinar To register, select from one or more of the webinars and join in at the day and time that is displayed. If you want to sign up for a free DXO webinar on NIK Collection see details below. DXO ANNOUNCES FREE WEBINAR SERIES FOR APRIL 2020 TO WATCH IN THE COMFORT OF HOMEThese webinars are perfect for beginners as well as seasoned photographers and offer step-by-step workflows and tips on everything from Landscape and Nature Photography to how to fix and solve common issues after the photo is taken. Our professional photography educators include DxO Ambassador Fabio Antenore, popular YouTube content creator PhotoJoseph, and instructor at the Rochester Institute of Technology Dan Hughes.TAKE YOUR NATURE PHOTOGRAPHY BEYOND THE ORDINARY WITH COLOR EFEX PROHosted by Dan HughesTuesday, April 7 – 6:00 PM GMTHOW TO REVEAL DETAILS IN SHADOWS AND HIGHLIGHTS USING DXO PHOTOLAB 3'S SMART LIGHTINGHosted by PhotoJosephThursday, April 9 – 6:00 PM GMTDISCOVER THE NIK COLLECTION 2.5 BY DXO IN ACTION WITH AFFINITY PHOTO 1.8Hosted by PhotoJosephTuesday, April 14 –6:00 PM GMTCREATIVE WAYS TO ENHANCE COLOR AND DRAMA USING VIVEZA IN THE NIK COLLECTION BY DXOHosted by Dan HughesThursday, April 16 – 6:00 PM GMTLEARN ABOUT HYPER-REAL LANDSCAPE PHOTOGRAPHY WITH THE NIK COLLECTION BY DXOStarring DxO Ambassador Fabio AntenoreHosted by Laurie RubinThursday, April 23 – 7:00 PM GMT----------------------------------------If you want to support my business and invest something for when we return to normal working ways you can buy yourself a digital gift voucher. You can redeem the voucher at any time against any event or service. You’ll be spending a little bit now for future use and I will have a little bit of cash flowing in, a win-win. ThanksBuy Yourself A Gift Voucher ----------------------------------------photography-basics , photography-tips , tip-of-the-day Alan Ranger 16 July 2020Alan Ranger Photography tips , learn-photography , NIK LinkedIn0 Pinterest0 Pinterest0",
  "wordCount": 1164,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/advanced-editing-with-nik-collection#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/advanced-editing-with-nik-collection#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Landscape photography"
    },
    {
      "@type": "Thing",
      "name": "Woodland photography"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}