{
  "@context": "https://schema.org",
  "@graph": [
    {
      "@type": "WebPage",
      "@id": "https://www.alanranger.com/blog-on-photography/alistair-willis-rps-distinctions#webpage",
      "url": "https://www.alanranger.com/blog-on-photography/alistair-willis-rps-distinctions",
      "name": "Case Study - Alistair Willis - ARPS | RPS Distinctions Panel",
      "description": "View fullsizeAlistair Willis Hanging PlanRPS DistinctionsAlistair first popped up on my radar in April 2018, waving his Flickr account at me like a flag.",
      "inLanguage": "en-GB",
      "isPartOf": {
        "@id": "https://www.alanranger.com#website"
      },
      "primaryImageOfPage": {
        "@id": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1721291448290-753YS967OXMJ37PSWTLS/_-2-25.jpg"
      }
    },
    {
      "@type": "BreadcrumbList",
      "@id": "https://www.alanranger.com/blog-on-photography/alistair-willis-rps-distinctions#breadcrumb",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://www.alanranger.com"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Blog",
          "item": "https://www.alanranger.com/blog-on-photography"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Case Study - Alistair Willis - ARPS | RPS Distinctions Panel",
          "item": "https://www.alanranger.com/blog-on-photography/alistair-willis-rps-distinctions"
        }
      ]
    },
    {
      "@type": "BlogPosting",
      "@id": "https://www.alanranger.com/blog-on-photography/alistair-willis-rps-distinctions#blogposting",
      "headline": "Case Study - Alistair Willis - ARPS | RPS Distinctions Panel",
      "alternativeHeadline": "Case Study - Alistair Willis - ARPS | RPS Distinctions Panel | Alan Ranger Photography",
      "description": "View fullsizeAlistair Willis Hanging PlanRPS DistinctionsAlistair first popped up on my radar in April 2018, waving his Flickr account at me like a flag.",
      "url": "https://www.alanranger.com/blog-on-photography/alistair-willis-rps-distinctions",
      "mainEntityOfPage": {
        "@type": "WebPage",
        "@id": "https://www.alanranger.com/blog-on-photography/alistair-willis-rps-distinctions#webpage"
      },
      "datePublished": "2024-07-18T00:00:00+00:00",
      "dateCreated": "2024-07-18T00:00:00+00:00",
      "dateModified": "2024-07-18T00:00:00+00:00",
      "inLanguage": "en-GB",
      "articleBody": "CASE STUDY - ALISTAIR WILLIS - ARPS | RPS DISTINCTIONS PANELView fullsizeAlistair Willis ARPS Hanging PlanRPS DistinctionsAlistair first popped up on my radar in April 2018, waving his Flickr account at me like a flag. He was after my two pence on whether he had the chops for an RPS Distinction. We kicked off with Alistair gunning for his Licentiateship, and he nearly nailed a final draft panel. But, we both felt it was about as representative of his style as a penguin in a tutu.After a bit of chin-wagging, Alistair decided to dive into my Intentions Photography Project Course. This turned out to be the springboard for a series of still-life images that would make even inanimate objects feel like celebrities.Then, wouldn't you know it, Covid gate-crashed our party and put the kibosh on the course schedule. Not to be deterred, Alistair pivoted back to my RPS Distinctions Mentoring Course, using his Intentions images as the foundation for an Associates Panel in Fine Art. Talk about making lemonade from lemons!The journey to the final 15 images was about as straightforward as a drunk octopus trying to put on rollerskates. But Alistair, bless him, stuck to it like a limpet. After more reshoots, re-edits, and meticulous critiques than you can shake a stick at, he finally had a panel ready for submission in June 2024.Alistair's panel is a proper corker, showcasing exactly what an Associates Panel should be. His unique style, editing prowess, and consistent ligh limpet. After more reshoots, re-edits, and meticulous critiques than you can shake a stick at, he finally had a panel ready for submission in June 2024.Alistair's panel is a proper corker, showcasing exactly what an Associates Panel should be. His unique style, editing prowess, and consistent lighting make his chosen subject shine brighter than a diamond in a coal mine.I'm always chuffed to bits when my RPS students succeed, but this one's got me grinning like a Cheshire cat. Alistair's dedication is truly inspiring. Massive congrats, mate! Here's hoping you can flog all those props you bought, or Louise might end up auctioning your images on eBay! 😊----------------------------------------STATEMENT OF INTENT> GENERATIONS> > In our constantly changing world, the passage of time leaves its mark on everything, even the most mundane objects found in our homes. By juxtaposing ordinary household items from different eras, I wanted to explore the stories embedded within these artifacts and the role they play in shaping our collective memories. Many of the objects in my images belong to my children, myself, my parents and even my grandparents. The images therefore reflect the shifts in technology, design and familiar artefacts over the different generations of a family.> > 89 wordsINTERVIEW WITH ALISTAIR FOLLOWING HIS RPS DISTINCTIONS ACHIEVEMENT1. WHY DID YOU WANT TO GAIN A DISTINCTION WITH THE ROYAL PHOTOGRAPHIC SOCIETY (RPS)?A well-regarded award. I've been a keen photographer since I was about 10, but hadn't done any structured learning until my late 40s. I was originally aiming for an LRPS, but ended up going directly for the ARPS.2. WHY DID YOU CHOOSE ALAN TO MENTOR YOU FOR A DISTINCTION AND HAD YOU WORKED WITH ALAN BEFORE THE RPS DISTINCTIONS MENTORING COURSE?I'd been thinking of submitting for the LRPS in about 2017, and visited the Photography Show at the NEC that year. A leaflet had some comments about the value of finding a mentor before submitting, so I went on the internet. Alan's site came up so I called him, and after a discussion about my initial proposed panel, I started on the LRPS mentoring course.In fact, while preparing for the LRPS, I started developing a strong interest in still-life photography. Rather than finishing the LRPS submission, Alan then suggested building a project on his Intentions course, and my images for that ended up as the starting point for the ARPS mentoring course. 3. DESCRIBE HOW YOU FOUND THE RPS MENTORING CLASSES. Very good, although it can be a bit frustrating trying to find a slot when enough people will attend. On the other hand, it's tremendously valuable seeing other people's work, and getting the insights that come from Alan's critique of them, so it's worth the logistical difficulties.On paper, the classes seemed to be a bit short at first; nominally 30 minutes per attendee. However, Alan's very generous with that time (and doesn't cut short the final attendee if the earlier ones have overrun), and the amount of insight that he can pack into that time is extraordinary. Outside the mentoring classes, I regularly use the techniques that Alan used to critique either my images, or those of the other students. 4. DO YOU FEEL YOU GOT THE RIGHT LEVEL AND INPUT OF SUPPORT FROM THE COURSE?Yes. 5. BEFORE YOU STARTED THE MENTORING COURSE, DID YOU FEEL YOU WERE ALREADY GOOD ENOUGH TO GAIN A DISTINCTION WITH THE RPS? I was a long way off the required le either my images, or those of the other students. 4. DO YOU FEEL YOU GOT THE RIGHT LEVEL AND INPUT OF SUPPORT FROM THE COURSE?Yes. 5. BEFORE YOU STARTED THE MENTORING COURSE, DID YOU FEEL YOU WERE ALREADY GOOD ENOUGH TO GAIN A DISTINCTION WITH THE RPS? I was a long way off the required level when I started the ARPS course. However, I think that, following the Intentions course, we were confident that the core concept of my panel (different generations of household objects) was sound, and that I had the potential to develop a panel at the required level.In fact, I needed to do the course twice over about 4 years before the final panel was ready to my satisfaction and Alan's. (Although the pandemic and some personal circumstances did drag things out.) I think I needed that amount of time to get a feel for all the aspects of the work, especially understanding the composition, and the photo editing techniques that give the images their final feel. I wasn't in any rush to get the distinction, so had time to enjoy the journey.Working in still life is very unforgiving; a frequent comment from Alan and the RPS mentors I have spoken to, is that any mistake, no matter how minor, is your fault as everything is under your control. Although this can be frustrating, I also found that it forced me to gain mastery of many aspects of the photography, including how to use artificial light sources, and artistic techniques using the Nik collection.6. WHAT DISTINCTION DID YOU APPLY FOR AND WERE YOU SUCCESSFUL?ARPS, and I was successful. 7. WHAT WAS YOUR EXPERIENCE LIKE OF THE RPS ASSESSMENT DAY?Quite nerve-wracking... my panel was the last of the associate panels to be assessed, and many of the panels that day didn't make the cut. Fortunately, the assessors' comments on my panel were very positive and I was awarded the distinction.8. DID YOU SEEK INDEPENDENT ADVICE, FEEDBACK OR INPUT FROM ANYWHERE ELSE BEFORE YOUR PANEL ASSESSMENT? Yes; I arranged a one2one advisory session with an RPS mentor (who turned out to be one of the assessors of my panel). She was very helpful, and picked out some small slips in the images (minor ghosting artifacts, and some blown highlights) which had somehow managed to get past Alan. The RPS mentor was also very helpful with her comments on my statement of intent. Apparently, many candidates struggle to get this right, and her feedback on my first draft was that it was too impersonal; the assessors like to see something that explains the photographers' connection to their work. 9. HAVING COMPLETED THE COURSE AND DISTINCTION ASSESSMENT, WHAT ADVICE WOULD YOU LIKE TO SHARE WITH OTHERS?The phrase that the assessors used a lot for the was that the successful panels look like \"the work of one photographer\". Meaning that they are looking for a distinctive style, but which is consistent across the panel. The assessors also put a lot of emphasis on the statement of intent, and preferred statements which were about the content of the images (\"this topic means a lot to me because...\"), rather than about the technical aspects of the images (\"I wanted to explore this technique because...\")It is also worth exploring other guides and reference books in your chosen area of photography: I found Kevin Best's book \"Still Life Photography\" to be extremely inspiring, and gave me lots of ideas. Also, the Strobist blog (https://strobist.blogspot.com/) is an absolutely invaluable guide to using artificial light. ploring other guides and reference books in your chosen area of photography: I found Kevin Best's book \"Still Life Photography\" to be extremely inspiring, and gave me lots of ideas. Also, the Strobist blog (https://strobist.blogspot.com/) is an absolutely invaluable guide to using artificial light. I would have found preparing my panel far, far harder without these two sources of information. 10. WHAT WAS THE HARDEST PART OF GAINING A DISTINCTION WITH THE RPS AND WHY?It's a bit prosaic, but the main difficulty I had was finding the time. Building up 15 high quality pictures which share a common theme is quite hard anyway, but then ensuring that they work together in a panel is an additional challenge. 11. HAS WORKING FOR A DISTINCTION HELPED YOU PROGRESS AS A PHOTOGRAPHER?Immensely so: my final panel is way beyond what I was doing when I started working for the distinction. It's very satisfying to look at some of the early attempts to see how much I've developed. 12. ANY OTHER COMMENTS YOU WOULD LIKE TO ADD?Does anyone need a mechanical gramophone?----------------------------------------Click on images to see full screenView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsize ----------------------------------------If you are interested in attaining an RPS distinction I can support you with my RPS Courses for distinctions RPS Mentoring Course SUMMARY- PRODUCE A PANEL OF IMAGES FOR AN RPS DISTINCTIONS QUALIFICATION * ZOOM - ONLINE * EVENING CLASS - 19:00 - 21:00. SIX CLASSES, YOU CHOOSE DATES, WITHIN A TWELVE-MONTH PERIOD TO SUIT * FROM £395 OR ALSO AVAILABLE AS A SERIES OF 1HR 1-2-1 ZOOM SESSIONS HAVING SUPPORTED MANY CLIENTS THROUGH A JOURNEY OF DEVELOPMENT AND IMPROVEMENT, WITH THEIR PHOTOGRAPHY, OVER THE PAST FEW YEARS, THIS MENTORING COURSE IS FOR THOSE WHO ARE ALREADY TECHNICALLY COMPETENT (OR AT LEAST ARE ON THE PATH TO MASTERING IT) AND ARE ABLE TO DEMONSTRATE GOOD DESIGN AND COMPOSITION IN THEIR PHOTOGRAPHY.You are not expected to be a master or even polished to attend. This RPS Distinctions course is to help support you in improving in all three areas of image production: * Technical - The mechanics of it * Creativity - The reason for it * Output - The editing and publication of itYou will be expected to understand and demonstrate or be willing to learn; * Good exposure of photographs * Good compositional awareness * A range of techniques and styles (L) or specific themed body of work (A) * Ability to edit images to a \"reasonable\" standard.Over the course of 12 months, where you will attend six RPS Distinctions classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS----------------------------------------Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so l or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.comView fullsize----------------------------------------photography-courses , student-photos Alan Ranger 18 July 2024Alan Ranger Photography rps-panel , rps distinctions LinkedIn0 Pinterest0",
      "wordCount": 2043,
      "timeRequired": "PT10M",
      "readingTime": "PT10M",
      "genre": "Photography Case Study",
      "articleSection": "RPS Distinctions",
      "keywords": [
        "rps-panel",
        "rps distinctions"
      ],
      "learningResourceType": "CaseStudy",
      "educationalLevel": "Intermediate",
      "proficiencyLevel": "Intermediate",
      "typicalAgeRange": "18-99",
      "educationalUse": "Learning",
      "estimatedCost": {
        "@type": "MonetaryAmount",
        "currency": "GBP",
        "value": "0"
      },
      "audience": {
        "@type": "EducationalAudience",
        "educationalRole": "Photographer",
        "audienceType": "Student"
      },
      "educationalAlignment": {
        "@type": "AlignmentObject",
        "alignmentType": "educationalFramework",
        "educationalFramework": "Photography Skills",
        "targetName": "Intermediate"
      },
      "about": [
        {
          "@type": "Thing",
          "name": "Royal Photographic Society"
        },
        {
          "@type": "Thing",
          "name": "Associate of the Royal Photographic Society (ARPS)"
        },
        {
          "@type": "Thing",
          "name": "RPS Distinctions"
        },
        {
          "@type": "Thing",
          "name": "Exposure (photography)"
        },
        {
          "@type": "Thing",
          "name": "Photographic composition"
        }
      ],
      "mentions": [
        {
          "@type": "Thing",
          "name": "RPS"
        },
        {
          "@type": "Thing",
          "name": "ARPS"
        }
      ],
      "hasPart": [],
      "image": {
        "@type": "ImageObject",
        "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1721291448290-753YS967OXMJ37PSWTLS/_-2-25.jpg",
        "width": 1500,
        "height": 1000,
        "caption": "Case Study - Alistair Willis - ARPS | RPS Distinctions Panel"
      },
      "thumbnailUrl": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1721291448290-753YS967OXMJ37PSWTLS/_-2-25.jpg",
      "primaryImageOfPage": {
        "@id": "https://www.alanranger.com/blog-on-photography/alistair-willis-rps-distinctions#webpage"
      },
      "speakable": {
        "@type": "SpeakableSpecification",
        "xpath": [
          "/html/head/title",
          "//h1"
        ],
        "cssSelector": [
          "h1",
          ".intro"
        ]
      },
      "discussionUrl": "https://www.alanranger.com/blog-on-photography/alistair-willis-rps-distinctions#comments",
      "author": {
        "@type": "Person",
        "@id": "https://www.alanranger.com/#alanranger",
        "name": "Alan Ranger",
        "url": "https://www.alanranger.com/about-alan-ranger",
        "jobTitle": "Photographer & Photography Educator",
        "sameAs": [
          "https://www.alanranger.com",
          "https://www.linkedin.com/in/alanrangerphotography"
        ]
      },
      "publisher": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography",
        "url": "https://www.alanranger.com",
        "logo": {
          "@type": "ImageObject",
          "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/b859ad2b-1442-4595-b9a4-410c32299bf8/ALAN+RANGER+photography+LOGO+BLACK.+switched+small.png?format=1500w",
          "width": 300,
          "height": 100
        }
      },
      "isPartOf": {
        "@type": "WebSite",
        "@id": "https://www.alanranger.com/#website"
      },
      "copyrightHolder": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography"
      },
      "copyrightYear": 2024,
      "sameAs": [
        "https://www.alanranger.com/blog-on-photography"
      ],
      "relatedLink": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "subjectOf": {
        "@type": "Blog",
        "@id": "https://www.alanranger.com/blog-on-photography#blog"
      },
      "isRelatedTo": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "citation": "Royal Photographic Society",
      "backstory": "CASE STUDY - ALISTAIR WILLIS - ARPS | RPS DISTINCTIONS PANELView fullsizeAlistair Willis ARPS Hanging PlanRPS DistinctionsAlistair first popped up on my radar in April 2018, waving his Flickr account at me like a flag.",
      "funding": {
        "@type": "MonetaryGrant",
        "funder": {
          "@type": "Organization",
          "name": "Alan Ranger Photography"
        }
      },
      "interactionStatistic": {
        "@type": "InteractionCounter",
        "interactionType": "https://schema.org/CommentAction",
        "userInteractionCount": 0
      },
      "commentCount": 0
    }
  ]
}