{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/alternative-long-exposure-photography-techniques#blogposting",
  "headline": "Tip of the day -  Alternative Long Exposure Photography",
  "alternativeHeadline": "Tip of the day -  Alternative Long Exposure Photography | Alan Ranger Photography",
  "description": "Tip of the day - Alternative Long Exposure Photography Long Exposure Photography Check out the exposure calculator Tip of the day - Alternative long.",
  "url": "https://www.alanranger.com/blog-on-photography/alternative-long-exposure-photography-techniques",
  "datePublished": "2023-10-12T00:00:00.000Z",
  "dateModified": "2023-10-12T00:00:00.000Z",
  "dateCreated": "2023-10-12T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Tip of the day - Alternative Long Exposure Photography Long Exposure Photography Check out the exposure calculator Tip of the day - Alternative long exposure photography Techniques - when there is no visible movement or you don't have Neutral Density Filters Background I recently ran a couple of long exposure workshops at Kenilworth Castle, they were rearranged ones from back in March that were postponed due to the lockdown and restrictions, so it was great to be back out again with a small group of clients chewing over ideas, techniques and hoping to create something on the nights. Unfortunately, both evenings were not blessed with any sort of sunset sky, and as we entered the dusk period, most clouds vanished altogether or were not over or anywhere near the castle ruins. However, there was still an opportunity to discuss techniques and one in particular that clients said they hadn't come across before which is how to take long exposures without the use of ND filters to extend exposure time and/or deal with little visible movement in the clouds. This technique that I am about to explain can also work on other subjects, not just cloudy skies so I hope you can put it into practice on your next shoot. Technique The technique is time-lapse photography. Meaning, you will take a series of shots at intervals, with or without ND filters so that the multiple frames capture subtle shifts in movement from your subject. Combining them into a single exposure is the function of software, in the examples below and steps I have used Adobe Photoshop but there are alternative software products on the market to do the same thing, and many are free to use or donation based. The advantage of this method is that you can optimise your aperture, ISO and exposure time to reduce the effects of sensor noise from extreme long exposures made with 10 and 15 stop ND filters when exposure times run into minutes rather than seconds. Method - 10 steps to create a long exposure Photography, time-lapse image You need a scene where there is some sort of movement, clouds, water, people, vehicles whatever your subject matter is. You will need; • a tripod a remote release to control to trigger the exposures Place the camera on the tripod and follow the same \"rules\" for the composition of your image and test shots as you would normally do. I.e. Take your shot and inspect it for sharpness, DoF, exposure and framing adjustments. Having checked everything you can shoot a series of shots which show the movement of your element. You may need at least 10-30 images taken 30 secs or longer apart, depending on the speed of movement. (optimise your ISO/Aperture combo to reduce noise) If you have a remote release with a lock option, you can switch your drive mode from single shot to continuous and lock the remote release, so it automatically takes a shot one after the other at the exposure time intervals set by the meter. My camera does adjust exposure time between frames to take into account changes in light throughout the process. You can use this method with or without ND filters in Aperture priority for exposure times up to 30 seconds. See my examples below When home, go to Adobe Lightroom. Import the images into the catalogue, work your basic edits on the first shot (crop/framing adjustments, dust spot removal and anything critical.) Then synchronise all the edits of this shot with the others of the series. Then select all the images in the series, right-click, and open in Photoshop as layers. This process may take some time depending on the size of files (RAW or JPG) and the processor and memory of your computer. So be patient. When finished, you will have a Photoshop document with all the images in a stack of layers. The next step is to select all the layers and then right-click \"Convert to a smart object\". This is a single layer object that contains the information of all the previous layers. When finished, go to the menu at the top and select Layers -> Smart Object -> Stack Mode -> Mean. It will take a little time to combine the layers and movement, but you will end up with a combined image simulating your long exposure. Finally, flatten the smart object because Photoshop has a limit on the size of the image of 4GB so you won't be able to save back to Lightroom if you have used multiple frames in RAW format - Check document size bottom left of Photoshop for file size. Now work on the combined time-lapse, long exposure image as you would typically do for stylising the result. My Examples - long exposure photography The first thing to say is the final images are not ones that I am happy with or think are noteworthy; they were taken to try and demonstrate the technique more than for their aesthetic beauty. The trouble with locations like these is that they are swamped by tourists, being generally ignorant, walking through the crops taking selfies and acting like selfish idiots. It’s one of the reasons I have dropped lavender field workshops from my schedule in the last two years. Yesterday was no exception and trying to time exposures without someone, or a group of narcissistic, self-indulgent day-trippers was a challenge, and the light was not great either, let alone the quality of the fields themselves. However, I think the images still give you an idea of effects you can get in the clouds at least even when there is no visible movement to the eye. Example 1 - long exposure photography Using a 10 stop ND filter ISO 50, F16, 13 secs x 50 frames in RAW (15 min of time-lapse) - the resulting combined image in PS was 10GB Observation - many frames, 50 in this example, you lose any real definition in the moving parts and it becomes blurred rather than showing any details. However, it does allow the static subject (lavender field) to take central focus and stage. View fullsize 12 min time-lapse long exposure combined image Example 2 - long exposure photography Using a 6 stop ND filter ISO 50, F16, 20 secs x 10 frames in RAW (2.5 mins apart over) 25 mins of time-lapse Observation - fewer exposures (10 frames) but spaced apart keeps more definition and details 25 min time-lapse long exposure combined image Example 3 - long exposure photography ISO 50, F16, 25 secs x 8 frames in RAW (1.5 mins apart over) 12 min of time-lapse Observation - fewer exposures (8 frames) but spaced apart creates a dramatic result Example 4 long exposure photography ISO 50, F16, 6 secs x 4 frames in RAW (2 mins apart over) 8 min of time-lapse Observation - fewer exposures (4 frames) but spaced longer apart shows subtle shifts in movement 8 min time-lapse long exposure combined image Conclusion - long exposure photography There are no rights or wrongs when it comes to which effect you prefer from the examples; they all have their merits depending on your personal viewpoint and taste. I’d be interested to know what my community think works best, so please add your comments to this post. Personally, I can see merit any of the above examples of different amounts of motion blur. Therefore I challenge you to learn how to experiment and create the impact you prefer for long exposures. Yes, of course, you have to execute technically with exposure, focus, DoF, composition and so on but the amount of time-lapse/long exposure effect is a personal choice so go and play with the method and enjoy how things turn out. photography-basics, photography-tips, tip-of-the-dayAlan Ranger12 October 2023Alan Ranger Photographytips, learn-photography, long-exposure LinkedIn0 Pinterest0",
  "wordCount": 1302,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/alternative-long-exposure-photography-techniques#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/alternative-long-exposure-photography-techniques#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}