{
  "@context": "https://schema.org",
  "@graph": [
    {
      "@type": "WebPage",
      "@id": "https://www.alanranger.com/blog-on-photography/autumn-photography-tips#webpage",
      "url": "https://www.alanranger.com/blog-on-photography/autumn-photography-tips",
      "name": "Free Autumn Photography Tips | Equipment | Approach",
      "description": "Table of Contents ShowAUTUMN TIPSAutumn is a favourite season for many outdoor photographers.",
      "inLanguage": "en-GB",
      "isPartOf": {
        "@id": "https://www.alanranger.com#website"
      },
      "primaryImageOfPage": {
        "@id": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1602765902956-JXNLBR7VUQ204HCMT2NV/photography-workshops+%283%29.jpg"
      }
    },
    {
      "@type": "BreadcrumbList",
      "@id": "https://www.alanranger.com/blog-on-photography/autumn-photography-tips#breadcrumb",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://www.alanranger.com"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Blog",
          "item": "https://www.alanranger.com/blog-on-photography"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Free Autumn Photography Tips | Equipment | Approach",
          "item": "https://www.alanranger.com/blog-on-photography/autumn-photography-tips"
        }
      ]
    },
    {
      "@type": "BlogPosting",
      "@id": "https://www.alanranger.com/blog-on-photography/autumn-photography-tips#blogposting",
      "headline": "Free Autumn Photography Tips | Equipment | Approach",
      "alternativeHeadline": "Free Autumn Photography Tips | Equipment | Approach | Alan Ranger Photography",
      "description": "Table of Contents ShowAUTUMN TIPSAutumn is a favourite season for many outdoor photographers.",
      "url": "https://www.alanranger.com/blog-on-photography/autumn-photography-tips",
      "mainEntityOfPage": {
        "@type": "WebPage",
        "@id": "https://www.alanranger.com/blog-on-photography/autumn-photography-tips#webpage"
      },
      "datePublished": "2025-10-05T00:00:00+00:00",
      "dateCreated": "2025-10-05T00:00:00+00:00",
      "dateModified": "2025-10-05T00:00:00+00:00",
      "inLanguage": "en-GB",
      "articleBody": "FREE AUTUMN PHOTOGRAPHY TIPS | EQUIPMENT | APPROACHTable of Contents ShowAUTUMN PHOTOGRAPHY TIPSAutumn is a favourite season for many outdoor photographers. The softer light with the sun being lower and the wonderful transition of summer greens to the rainbow of autumn colours makes it an ideal period for any level of photographer to go outdoors and enjoy the environment and make photos that convey their interpretation of this special period. Those interpretations could mean any number of ways to photograph, macro, abstract, close-up or something wider to show more than one element.This autumn photography tips guide is aimed at all those who want to make the most of their outdoor autumn photography adventures over the next 3-4 months. I’ve broken down the preparation required and considerations into several categories to help you plan and maximise each trip you make out with your camera.----------------------------------------HERE ARE MY TOP AUTUMN PHOTOGRAPHY TIPS TO MAKE THE MOST OF THE SEASON#01 TIMING AND WEATHER - AUTUMN PHOTOGRAPHY TIPS * Go out early morning or later afternoon for the softest light when the sun is lower in the sky. * Overcast, even drizzly days are not a write-off, the diffused light will make the colours appear even more saturated * Bright sunny days are good for reflections/shadows and backlit subjects like leaves but the high contrast light can make exposure and good mid-tones difficult to achieve without exposure bracketin izzly days are not a write-off, the diffused light will make the colours appear even more saturated * Bright sunny days are good for reflections/shadows and backlit subjects like leaves but the high contrast light can make exposure and good mid-tones difficult to achieve without exposure bracketing.#02 EQUIPMENT - AUTUMN PHOTOGRAPHY TIPS * A tripod will be essential if you want to do close/macro shots where smaller apertures and/or longer shutter speeds are required * A polarising filter will dramatically reduce the amount of reflected light on shiny surfaces (leaves especially) * Zoom lenses that cover a good range 50mm-200mm will allow you to isolate your subject and zoom in to a specific area of interest. They also allow you to compress the DoF (blur the background) * Use a remote release cable or self-timer to fire the shutter to avoid any camera shake (Remember to turn off image stabilisation if using a tripod) * Take a bin liner to kneel or even lay down on for low down shots and a plastic sandwich bag to cover your camera in drizzle/showers * Take water and snacks and warm clothing - you may be outside for a short period but standing around and becoming cold and hungry/thirsty will impact your energy.#03 OBSERVATION & COMPOSITION - AUTUMN PHOTOGRAPHY TIPS * Spend time evaluating, observing and looking at details and repeat this practice constantly throughout your time on location. For me, 80% of making an image is doing nothing other than observing and considering and only 20% execution. * Move around your subject to view from multiple angles, heights and perspectives. Pay attention to changes, in contrast, colour, texture, background and foreground objects * Don’t get lazy and plonk your tripod down and then use the same lens/settings for every shot. Maybe invest in my viewing frames to encourage you to explore each composition without the restriction of your tripod. * Vary your approach. Macro, abstract, ICM/Movement, Cameo shots - Framing stories, metaphors and essential autumn flavours * What you exclude is often more important than what you include. Discard anything that distracts from your subject matter. Identify your compelling subject and make it the star of the show * Observe the light and pay attention to where it falls on subjects and frame accordingly. Avoid the brightest areas being on the edges of the frame. * Get down low and look at compositions at your feet as well as the obvious brightly coloured trees * Consider how many colours are in the composition, sometimes less is more effective, just two or three colours maximum. * Try to avoid direct sunlight on your subject or shooting into direct sunlight - will create very heavy contrast, reducing colours to shadows and highlights. * Consider the visual weight of all the elements in the image and frame to create a balanced composition - look at opposites, diagonals, vertical and horizontals - are they balanced visually (think of a set of scales) * Think about the foreground, lines, patterns, shapes and direction of how the eye moves through the frame - create a pathway for the eye to follow but don’t just take a shot of a path because its a “leading line” - that won’t cut it in terms of creative thinking.#04 TECHNICAL - AUTUMN PHOTOGRAPHY TIPS * Check your exposure on every shot and re-shoot if needed. Sometimes a bracketed set of exposures is the only way to capture the full d ow but don’t just take a shot of a path because its a “leading line” - that won’t cut it in terms of creative thinking.#04 TECHNICAL - AUTUMN PHOTOGRAPHY TIPS * Check your exposure on every shot and re-shoot if needed. Sometimes a bracketed set of exposures is the only way to capture the full dynamic range of light * Check your depth of field and sharpness/focus point for every shot. Don’t be lazy and just assume you nailed it the first time or the last time. It pays to check it at the time. * Set your white balance to cloudy/shady or do a custom white balance if you want to capture colour accurately. * Vary your metering mode to create a different exposure. Spot metering, for example, on a bright leaf will make everything else in the frame darkerWHY NOT JOIN ME ON ONE OF MY AUTUMN PHOTOGRAPHY WORKSHOPS AT BATSFORD OR OTHER AREAS AND GET THE SUPPORT AND GUIDANCE OF THE ABOVE FIRST-HAND. DETAILS BELOW.----------------------------------------A SELECTION OF EXAMPLE AUTUMN PHOTOGRAPHY IMAGESLong Lens Shots120mm F10150mm F895mm F6.3----------------------------------------WIDER VISTA SHOTSView fullsize70mm F6.3View fullsize40mm F8View fullsize35mm F9View fullsize80mm F13----------------------------------------CLOSE-UP AND MACRO SHOTSView fullsize150mm F3.5View fullsize200mm F7.1View fullsize160mm F7.1----------------------------------------CAMEO SHOTS (A CAMERA-SHOT AND FILMING TECHNIQUE THAT GIVES ALL ATTENTION TO THE SUBJECT BEING PHOTOGRAPHED BY USING A NEUTRAL OR BLACKENED BACKGROUND AND THE FEWEST PROPS, IF ANY, AS POSSIBLE.)View fullsize200mm F2.8View fullsize180mm F4View fullsize130mm F6.3View fullsize160mm F4----------------------------------------ABSTRACT AND METAPHORICALView fullsize160mm f10View fullsize90mm F9View fullsize200mm f10View fullsize200mm F6.3----------------------------------------JOIN ME ON A BATSFORD ARBORETUM AUTUMN PHOTOGRAPHY WORKSHOP.AUTUMN LANDSCAPE, ABSTRACT AND MACRO PHOTOGRAPHYFull details and booking can be found on the website Batsford page . You will be sent a booking confirmation on receipt of payment and joining instructions with details of what to bring and where to meet at the visitor's centre seven days prior to the event.I hope to meet many of you again in 2020 and look forward to another great photographic year at Batsford. * ESSENTIALS FOR ALL PHOTOGRAPHY WORKSHOPS * Suitable for any camera (Compact, Bridge and DSLR) * Suitable for any level - complete beginner to advanced photographers * Receive 1-2-1 tuition and support throughout the workshop * Practical advice on camera settings and composition of images * No specialist equipment required * WORKSHOP CONTENT * A brief introduction for 20-30 min and a lesson on basic camera settings, techniques and the things to look for * A 3hr guided walk around the best seasonal part of Batsford Arboretum to make images with Alan's support and input. * Alan will guide you on; * Camera Settings * Exposure & Colour Settings * Composition and Framing * Abstract, Close-Up, Macro, Vista and any type of shot you want to create. * Image review and feedback throughout the workshop. * If you book a full 1-day workshop then we will break around midday and have a 30-60 min lunch break befo gs * Composition and Framing * Abstract, Close-Up, Macro, Vista and any type of shot you want to create. * Image review and feedback throughout the workshop. * If you book a full 1-day workshop then we will break around midday and have a 30-60 min lunch break before continuing in a different part of the Arboretum in the afternoon. The Arboretum has a great cafe and facilities but you can also bring your own packed lunch if preferred. FITNESS LEVEL REQUIRED - EASY This trip is rated as easy, meaning that most people with average health/fitness can comfortably deal with the short walks and occasional steps or gradients involved and be comfortable on their feet for the duration of the workshop event.For full details of the content of these events, visit www.alanranger.com/batsford ----------------------------------------AUTUMN WORKSHOP DATES 2023 * Half-day morning workshops are 8 am to 11.30 am - £99 * Half-day afternoon workshops are 12:30 pm to 4:00 pm - £99 * One Day workshop is 8 am to 4:00 pm £150 Dates * Sun-22-Oct * Mon-23-Oct * Tue-24-Oct * Wed-25-Oct * Thu-26-Oct * Fri-27-Oct * Sat-28-Oct * Sun-29-Oct/photo-workshops-uk/batsford-arboretum-photography-workshopsSaleBATSFORD Arboretum Autumn Photography Workshops 23 - 31 Oct from £99.00Available Sessions Left:Select Available Sessions Left Fri 23 Oct 2026 AM - 8am - 11:30am Fri 23 Oct 2026 PM - 12pm - 3:30pm Fri 23 Oct 2026 All Day -8am - 3:30pm Sat 24 Oct 2026 AM - 8am - 11:30am Sat 24 Oct 2026 PM - 12pm - 3:30pm Sat 24 Oct 2026 All Day -8am - 3:30pm Sun 25 Oct 2026 AM - 8am - 11:30am Sun 25 Oct 2026 PM - 12pm - 3:30pm Sun 25 Oct 2026 All Day -8am - 3:30pm Thu 29 Oct 2026 AM - 8am - 11:30am Thu 29 Oct 2026 PM - 12pm - 3:30pm Thu 29 Oct 2026 All Day -8am - 3:30pm Fri 30 Oct 2026 AM - 8am - 11:30am Fri 30 Oct 2026 PM - 12pm - 3:30pm Fri 30 Oct 2026 All Day -8am - 3:30pm Sat 31 Oct 2026 AM - 8am - 11:30am Sat 31 Oct 2026 PM - 12pm - 3:30pm Sat 31 Oct 2026 All Day -8am - 3:30pmAdd to cartOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 available----------------------------------------SATURDAY 21ST OCTOBER, SAT 4TH AND SUN 26TH NOVEMBERPEAK DISTRICT - PADLEY GORGE AND BOLEHILL QUARRY PHOTOGRAPHY WORKSHOPSMorning - Padley Gorge 9:00 - 12:30Padley Gorge is a deep but narrow valley in the Peak District, Derbyshire between the village of Grindleford and the A6187 road. The gorge is wooded with a stream, the Burbage Brook, at the bottom.Afternoon - Bolehill Quarry - 14:00 17:00Created hundreds of millions of years ago by the power of natural forces, the last few centuries have seen the rugged landscape surrounding Padley Gorge sculpted by man who long ago quarried these gritstone Edges for stone and tunnelled deep beneath the moors to drive a railway line through the hills. Now an area of outstanding natural beauty, this walk takes in the breathtaking heights of Millstone Edge and majestic silver birch woodlands.Book either morning or afternoon - or the whole day (discounted)/photo-works nd tunnelled deep beneath the moors to drive a railway line through the hills. Now an area of outstanding natural beauty, this walk takes in the breathtaking heights of Millstone Edge and majestic silver birch woodlands.Book either morning or afternoon - or the whole day (discounted)/photo-workshops-uk/landscape-peak-district-photography-workshops-derbyshireSalePEAK DISTRICT Photography Workshops - May, Oct and Nov Sale Price: £150.00 Original Price: £175.00Options:Select Options Padley and Bolehill Sat 16th May 2026 - 09:30 - 16:00 Padley and Bolehill Sat 17th Oct 2026 09:30am - 4:00pm Padley and Bolehill Sun 1st Nov 2026 09:30am - 4:00pm Padley and Bolehill Sat 7th Nov 2026 09:30am - 4:00pmBook NowOnly 6 availableOnly 6 availableOnly 6 availableOnly 6 availableGood To Go England----------------------------------------news , photography-workshops , tip-of-the-day Alan Ranger 5 October 2025Alan Ranger Photography LinkedIn0 Pinterest0",
      "wordCount": 1968,
      "timeRequired": "PT10M",
      "readingTime": "PT10M",
      "genre": "Photography Guide",
      "articleSection": "Seasonal & Location",
      "keywords": [
        "Free",
        "Autumn",
        "Photography",
        "Seasonal"
      ],
      "learningResourceType": "Guide",
      "educationalLevel": "Beginner",
      "proficiencyLevel": "Beginner",
      "typicalAgeRange": "18-99",
      "educationalUse": "Learning",
      "estimatedCost": {
        "@type": "MonetaryAmount",
        "currency": "GBP",
        "value": "0"
      },
      "audience": {
        "@type": "EducationalAudience",
        "educationalRole": "Photographer",
        "audienceType": "Student"
      },
      "educationalAlignment": {
        "@type": "AlignmentObject",
        "alignmentType": "educationalFramework",
        "educationalFramework": "Photography Skills",
        "targetName": "Beginner"
      },
      "about": [
        {
          "@type": "Thing",
          "name": "Exposure (photography)"
        },
        {
          "@type": "Thing",
          "name": "Aperture (photography)"
        },
        {
          "@type": "Thing",
          "name": "Shutter speed"
        },
        {
          "@type": "Thing",
          "name": "Photographic composition"
        },
        {
          "@type": "Thing",
          "name": "Landscape photography"
        },
        {
          "@type": "Thing",
          "name": "Woodland photography"
        }
      ],
      "mentions": [],
      "hasPart": [],
      "image": {
        "@type": "ImageObject",
        "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1602765902956-JXNLBR7VUQ204HCMT2NV/photography-workshops+%283%29.jpg",
        "width": 1500,
        "height": 1000,
        "caption": "Free Autumn Photography Tips | Equipment | Approach"
      },
      "thumbnailUrl": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1602765902956-JXNLBR7VUQ204HCMT2NV/photography-workshops+%283%29.jpg",
      "primaryImageOfPage": {
        "@id": "https://www.alanranger.com/blog-on-photography/autumn-photography-tips#webpage"
      },
      "speakable": {
        "@type": "SpeakableSpecification",
        "xpath": [
          "/html/head/title",
          "//h1"
        ],
        "cssSelector": [
          "h1",
          ".intro"
        ]
      },
      "discussionUrl": "https://www.alanranger.com/blog-on-photography/autumn-photography-tips#comments",
      "author": {
        "@type": "Person",
        "@id": "https://www.alanranger.com/#alanranger",
        "name": "Alan Ranger",
        "url": "https://www.alanranger.com/about-alan-ranger",
        "jobTitle": "Photographer & Photography Educator",
        "sameAs": [
          "https://www.alanranger.com",
          "https://www.linkedin.com/in/alanrangerphotography"
        ]
      },
      "publisher": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography",
        "url": "https://www.alanranger.com",
        "logo": {
          "@type": "ImageObject",
          "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/b859ad2b-1442-4595-b9a4-410c32299bf8/ALAN+RANGER+photography+LOGO+BLACK.+switched+small.png?format=1500w",
          "width": 300,
          "height": 100
        }
      },
      "isPartOf": {
        "@type": "WebSite",
        "@id": "https://www.alanranger.com/#website"
      },
      "copyrightHolder": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography"
      },
      "copyrightYear": 2025,
      "sameAs": [
        "https://www.alanranger.com/blog-on-photography"
      ],
      "relatedLink": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "subjectOf": {
        "@type": "Blog",
        "@id": "https://www.alanranger.com/blog-on-photography#blog"
      },
      "isRelatedTo": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "funding": {
        "@type": "MonetaryGrant",
        "funder": {
          "@type": "Organization",
          "name": "Alan Ranger Photography"
        }
      },
      "interactionStatistic": {
        "@type": "InteractionCounter",
        "interactionType": "https://schema.org/CommentAction",
        "userInteractionCount": 0
      },
      "commentCount": 0
    }
  ]
}