{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/avoid-camera-shake#blogposting",
  "headline": "Avoid Camera Shake - Use a remote release or self-timer",
  "alternativeHeadline": "Avoid Camera Shake - Use a remote release or self-timer | Alan Ranger Photography",
  "description": "Avoid Camera Shake - Remote Release = Sharp Shots Remote cable shutter releases removes the risk of blurred and sometimes indecipherable shots.",
  "url": "https://www.alanranger.com/blog-on-photography/avoid-camera-shake",
  "datePublished": "2020-01-16T00:00:00.000Z",
  "dateModified": "2020-01-16T00:00:00.000Z",
  "dateCreated": "2020-01-16T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Avoid Camera Shake - Use a remote release or self-timer Avoid Camera Shake - Remote Release = Sharp Shots Remote cable shutter releases removes the risk of blurred and sometimes indecipherable shots. When taking photos that require a longer exposure than you can hold the camera perfectly still for you need to ensure the camera is on a tripod or solid support and avoid any camera movement that can easily be caused by pressing the shutter down. This is why I recommend the shutter cable release. By half pressing on the button you can autofocus your camera, ready to take that all-important shot. There of course many variants of cable releases which can include timers, lights and audible signals. Personally given that I have lost, drowned and wrecked a few in my time I always opt for a simple cheap version and think of it merely as set of batteries that will have a limited life. So I always carry a spare in my camera bag too. Each camera manufacturer has a different connection type so you just need to buy one that is compatible with your camera model. Canon Sony Nikon You can purchase this from my amazon store, along with a number of other useful pieces of photography equipment. The Pixel RC-201 shutter cable release is a welcomed addition to any photographer’s bag. Saving your shots from blur and allowing them to take centre stage in your portfolio. photography-tips, recommended-productsAlan Ranger0 Pinterest0",
  "wordCount": 244,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/avoid-camera-shake#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/avoid-camera-shake#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    }
  ]
}