{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/basics-how-to-use-a-tripod#blogposting",
  "headline": "How to use a tripod correctly | Professional Guide",
  "alternativeHeadline": "How to use a tripod correctly | Professional Guide | Alan Ranger Photography",
  "description": "How to use a tripod correctly15 tips to improve your tripod useSetting up the tripod - How to use a tripod correctly • Always start with extending the.",
  "url": "https://www.alanranger.com/blog-on-photography/basics-how-to-use-a-tripod",
  "datePublished": "2021-06-16T00:00:00.000Z",
  "dateModified": "2021-06-16T00:00:00.000Z",
  "dateCreated": "2021-06-16T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "How to use a tripod correctly | Professional Guide How to use a tripod correctly15 tips to improve your tripod useSetting up the tripod - How to use a tripod correctly • Always start with extending the smallest, bottom legs first. It’s will help prevent dirt, sand and grit being pushed up inside the next leg and preserve the joints. Increase the tripod height by extending bottom legs fully first, then the next section and finally top section. It saves you bending down to make height adjustments. Always extend the legs fully so they are at their widest stopping point at that angle. Most tripod legs allow two or three further width positions if needed to stabilise further or get lower down. Try to get the tripod as level as possible. Use the spirit level on the tripod head or stand 90 degrees on (to side) and look at the centre column to see if it looks 180 degrees vertical (for those that don’t do degrees that’s 6 O’clock with clock hands) Always have one tripod leg pointing out at the same angle as the lens. Having a tripod leg under the lens reduces the chance of the tripod falling forwards and means you will be positioned between the rear two legs /\\ Using the tripod - How to use a tripod correctly Only use the centre column as the last resort to get extra height. Extending the centre column is a single point of connection versus three so destabilises the weight distribution. If you are using a heavier zoom lens, make sure to mount the lens on your tripod using its tripod collar. This will redistribute and balance the weight of camera and lens. Invest in a detachable camera strap system. Straps flap around in the wind causing vibration, are annoying when you are working on a tripod and worse still a hazard if you catch your hand/arm and topple the tripod over. Use a cable remote release or control (or 2sec timer) to fire the exposure. There’s not much point having a stable tripod setup if you then introduce movement and vibration by using your finger to take the shot. Turn Off Image Stabilization: When your gear is on a stable setup, you do not want image stabilization to try to compensate for movement that is not there. Caring for the tripod - How to use a tripod correctly Always leave an inch of the smallest let extended, even when storing, it allows time for the dirt to dry and fall off the feet and bottom inch of the leg. Clean the tripod with a damp (water) cloth, do not use soap or other liquids. Use a small soft brush or old toothbrush to remove sand and dirt from tripod leg joints. Always stand a tripod on 3 legs fully extended when out and about, laying a tripod down on its side is not going to preserve it at its best and will undoubtedly increase the risk of damage to the section joints and tripod head Store it standing up if possible, or laying down in a soft padded bag in a dry place so it has time to dry off and is protected from knocks and accidents. If you wish to purchase any of the accessories mentioned in these tips, please visit my Amazon recommended products page. More Free Photography Tips Take the free online colour test - how good is your vision? Find out how good your vision is with the free online colour test. Take the Munsell 100 Hue Test and discover if you have any colour vision deficiencies. Read More → What Are LEADING LINES in Photography: A How-To-Guide What Are Leading Lines In Photography: Do/don’ts and a 15-minute field exercise. Download the 1-page checklist or book a 30-min composition clinic for feedback What do CAMERA LENS FILTERS DO: A Guide for Beginners What do camera lens filters do? This guide walks you through UV filters, ND Filters, Polariser Filters and Graduated filter systems and my best suggestions 11 What is WHITE BALANCE in photography: A Beginners Guide Learn What is WHITE BALANCE in photography, how Kelvin and Tint fix colour casts, handle mixed light, and grab the free 1-page checklist for skin tones. What is CONTRAST in Photography: A Guide for Beginners What is Contrast in Photography?: Explore the use of contrasts and how to use contrast in photography. Light, Colour, texture and essential contrasts for impact Unlocking the Art of MACRO PHOTOGRAPHY: Techniques and Tips Unlocking Macro Photography: Techniques & Tips: Discover the art of macro photography with tips for sharp focus, lighting mastery, and creative exploration. Finding Your Compositional Balance: A Guide For Beginner's Master Compositional Balance with a free 1-page checklist. Learn symmetry, asymmetry, golden ratio and visual weight to create stronger, harmonious photos. 10 What is DYNAMIC RANGE in photography: A Beginners Guide Struggling with highlights and shadows? Discover What is DYNAMIC RANGE in photography and grab the free 1-page PDF checklist with field tips and HDR help. photography-basics, photography-tips, tip-of-the-dayAlan Ranger16 June 2021Alan Ranger Photographytips, tripod, learn-photography LinkedIn0 Pinterest0",
  "wordCount": 851,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/basics-how-to-use-a-tripod#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/basics-how-to-use-a-tripod#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}