{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/black-and-white-photography-practise-assignment#blogposting",
  "headline": "Black and White Photography Practise Assignment - Free",
  "alternativeHeadline": "Black and White Photography Practise Assignment - Free | Alan Ranger Photography",
  "description": "Learning Objectives • Understand the importance of contrast and tonal range in black and white photography.",
  "url": "https://www.alanranger.com/blog-on-photography/black-and-white-photography-practise-assignment",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Learning Objectives • Understand the importance of contrast and tonal range in black and white photography. • Learn to compose images that emphasize texture and form without color. • Master camera settings and techniques specifically for black and white photography. Want feedback on your assignment? Join Foundation Plus and get personalised monthly critique plus full access to all assignments. Learn More & Join Download Assignment PDF Before You Shoot • Choose a subject that has strong textures and contrasts, such as a weathered building or a portrait with dramatic lighting. • Scout locations with varying light conditions to see how shadows and highlights interact. • Decide on the time of day to shoot; early morning or late afternoon often provides the best light for black and white images. • Prepare your camera by ensuring it is set to shoot in RAW format for maximum post-processing flexibility. • Familiarize yourself with your camera's monochrome mode and how it affects the histogram. The Assignment Technical Focus • Use aperture settings like f/8 to achieve a good depth of field while maintaining sharpness across the frame. • Set your shutter speed to 1/125s to freeze motion while capturing details in dynamic scenes. • Adjust ISO to 200 for optimal image quality in well-lit conditions, avoiding noise in your black and white images. • Utilize spot metering to ensure your highlights are correctly exposed, especially in high-contrast scenes. • Set your white balance to daylight to maintain consistency in tones, even when shooting in black and white. Creative Focus • Look for leading lines in your composition that draw the viewer's eye through the image. • Experiment with high contrast scenes where shadows dominate to create dramatic effects. • Incorporate patterns or textures to add depth and interest to your black and white images. • Use negative space effectively to highlight your subject and enhance the emotional impact. • Consider the emotional tone you want to convey; softer contrasts can evoke calmness, while stark contrasts may suggest tension. Assignment Tasks • Capture a portrait using natural light at f/4, 1/100s, ISO 100 in aperture priority mode, focusing on the subject's facial textures. • Photograph a landscape scene at f/11, 1/250s, ISO 200 in manual mode, ensuring the sky has dramatic cloud patterns. • Shoot a close-up of an architectural detail at f/2.8, 1/60s, ISO 400 in shutter priority mode to emphasize texture and form. • Create a long exposure of flowing water at f/16, 1/2s, ISO 100 in manual mode to smooth out the water while capturing surrounding rocks. • Photograph a street scene at f/5.6, 1/125s, ISO 800 in aperture priority mode, focusing on the interplay of light and shadow created by buildings. • Capture a still life arrangement at f/8, 1/60s, ISO 200 in manual mode to highlight the textures of different materials. 💡 Stretch Tasks • Create a series of black and white images that tell a story, using a consistent theme and technique across all photos. • Experiment with infrared photography in black and white, using an appropriate filter and settings to create unique tonal contrasts. DO / DON'T DO • ✓ Do explore different lighting conditions to see how they affect your black and white images. • ✓ Do experiment with different focal lengths to find unique perspectives. • ✓ Do use post-processing software to fine-tune contrast and tonal range. • ✓ Do study the work of classic black and white photographers for inspiration. • ✓ Do practice viewing scenes in terms of light and shadow before capturing them. DON'T • ✗ Don't rely solely on color images; pre-visualize how a scene will look in black and white. • ✗ Don't ignore the importance of composition; leading lines and framing are crucial. • ✗ Don't shoot at too high an ISO, which can introduce noise and degrade image quality. • ✗ Don't forget to check your histogram to ensure a balanced exposure. • ✗ Don't shy away from high contrast scenes; they often yield the most striking black and white images. Reflection Questions • What emotions do you want to evoke in your black and white photographs? • How does the absence of color change your perception of the subject? • In what ways can you improve your composition for future black and white shots? • What challenges did you face while capturing black and white images, and how did you overcome them? 📚 Related Reading Before you start, read these related blog posts to deepen your understanding: • → Black And White Photography For Beginners • → What Is Contrast In Photography For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus. Alan Ranger0 Pinterest0",
  "wordCount": 803,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/black-and-white-photography-practise-assignment#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/black-and-white-photography-practise-assignment#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}