{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/camera-leveling-dont-be-wonky#blogposting",
  "headline": "Don't be wonky - Get your camera leveling right | Guide",
  "alternativeHeadline": "Don't be wonky - Get your camera leveling right | Guide | Alan Ranger Photography",
  "description": "Camera Spirit Level - camera leveling If there is one thing that tests my patience more than any other thing when reviewing images it's a wonky horizon.",
  "url": "https://www.alanranger.com/blog-on-photography/camera-leveling-dont-be-wonky",
  "datePublished": "2016-01-31T00:00:00.000Z",
  "dateModified": "2016-01-31T00:00:00.000Z",
  "dateCreated": "2016-01-31T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Don't be wonky - Get your camera leveling right | Guide DSLR Camera Spirit Level - camera leveling If there is one thing that tests my patience more than any other thing when reviewing images it's a wonky horizon. I guess some might say that's a little 'nit-picky', but to the trained eye, a slanted horizon is very obvious and distracting. built in level for 2 axis It also shows that the photographer has either not noticed it, doesn't know how to correct it or just doesn't think it looks as bad as I do! In any case it's such an easy thing to fix. Naturally, as you know I advocate getting it right in camera at the time of making the image. If you don't and therefore need to straighten in software you run the risk of having to crop some vital edges out of your image. There really is no excuse these days for wonky horizon's - many DSLR's and bridge camera's have a built in spirit level tool to show you when making the image if its it straight or not. They typically allow you to adjust your level on 2 axis, horizontal and tilt and aids camera leveling Even if you don't have this feature on your camera you can buy an accessory instead. Never take a wonky shot again with this handy, pocket sized tool! This DSLR Camera spirit level is the perfect solution for the photographer that loves to travel light, without missing that once in a lifetime shot. £1.50 from Amazon The spirit level: camera leveling • Is simple and quick to attach to the camera - Just mount it on your flash hot shoe! Ensuring your camera is level is a massive priority, especially when using a tripod on uneven ground or for a panoramic. One size fits all – This spirit level fits almost all DSLR/SLR cameras with a standard flast hot shoe fitting. This small tool is great value for money when your pictures are concerned. If you don't have either and don't want to spend £1.50 on this accessory then at least take 5 secs to check and correct any obvious wonky horizons in your images - it really does make a difference. photography-tips, recommended-productsAlan Ranger31 January 2016recommended-products, NIK LinkedIn0 Pinterest0",
  "wordCount": 382,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/camera-leveling-dont-be-wonky#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/camera-leveling-dont-be-wonky#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Photography"
    }
  ]
}