{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/camera-care-guide#blogposting",
  "headline": "Extend the life of your camera | Camera Care Guide",
  "alternativeHeadline": "Extend the life of your camera | Camera Care Guide | Alan Ranger Photography",
  "description": "Camera Care Camera's are for using, I have often remarked that buying a camera of any type that you leave at home in bubble wrap in fear of taking it out.",
  "url": "https://www.alanranger.com/blog-on-photography/camera-care-guide",
  "datePublished": "2022-04-20T00:00:00.000Z",
  "dateModified": "2022-04-20T00:00:00.000Z",
  "dateCreated": "2022-04-20T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Extend the life of your camera | Camera Care Guide Camera Care Camera's are for using, I have often remarked that buying a camera of any type that you leave at home in bubble wrap in fear of taking it out and damaging it, is a pointless procession to own. It isn't just because you won't have it when you need it for that spur of the moment shot, it's because you are more likely to be unfamiliar with it operation, controls and be able to adjust settings quickly enough to make the magic shot. There are of course plenty of things you can do to prolong the life of your treasured camera and ensure it's in full working order for hopefully years to come. Here is my list of top tips to help you extend the life of your camera and do camera care. Camera Care - #001 - Insure it My number 1 tip simply because if insured then you have peace of mind in case of an accident or theft etc. Most household contents policy will cover your camera equipment up to a certain level but there maybe a limit on how much it covers and types of use away from home so check with them and make sure you cover all eventualities. Accidental damage, (dropped, rain or sand/dirt and so on) stolen from car, B&B/Hotel or even out on location. Also check to see if the insurance covers multiples items or just single items and the limits on each as you may find you can only claim for some of the equipment in your bag rather than all of it. If you want the protection of everything then there are insurance policies that will cover just about all eventualities and all equipment too. I have used for Infocus/Hiscox for a number of years and made claims without any issues. There are alternatives to them but I can't vouch for them as have no experience. Eversure Camera Care - #002 - Bag it Buying a decent camera bag that has protective padding is essential to keep your camera and lenses from rolling around, knocking, scratching or even cracking as they jumble around whilst in transit in that loose rucksack. Just as important is getting the right size bag that caters for the gear to be comfortably packed rather then jammed into small spaces like sardines in a tin. When you think about the cost of a bag, or in my case multiple bags, so I have a choice about the size needed for the shoot and equipment I want to carry, its not a large cost given the price you paid for that gear. If looked after well it will protect your gear for many years to come, so also think about having enough room for expansion of gear in the future. Bags are always a personal choice so I can only give you my recommendations based on what suits me. See my post on my top 3 bags written a year ago. Since writing that blog I have added a new bag to my collection which I have been very happy with and would recommend if you have a reasonable amount of camera gear that you want to take out. Tamrac Evolution 9 Sling Rucksack Camera Care -#003 - Clean it Camera's are always going to get some level of dirt, moisture and dust on them - its in the atmosphere so there isn't much you can do to avoid it getting on and into your camera. Buying a weather sealed camera of course will help reduce the elements invading your internal workings but even with a weather sealed camera there are still some maintenance cleaning tasks that need to be performed regularly. • Sensor Cleaning - You can damage your sensor if you are not careful so if you decided to buy your own swabs, charged sensor brush then make sure you find out how to perform a sensor clean before diving onto that sensor. You can pay me to clean it for you but in any event read my previous blog post on general camera cleaning and separate blog post on sensor cleaning. Even if you don't change lenses you will still get dust on your sensor due your zoom lenses not being airtight and sucking in dust as you zoom in and out. A sensor needs to be cleaned on a regular basis to avoid dust becoming \"baked\" onto the sensor over time as the sensor heats up each time you shoot. Dry it - Yes, sounds obvious but maybe some people leave their damp equipment in the camera bag after a shoot. If you are shooting in damp/cold conditions then you need to ensure your equipment, camera body and lenses are dried afterwards. My routine is very simple but ensures I do not encourage the build up op of fungal spores and other nasty infections on my camera. If you have a warm room, where the boiler is ideal, just place a towel on top of the boiler and put your gear on it after the shoot. Remember to extend any zoom lenses, out fully so any moisture on the barrel is also able to dry and take off the lens cap! Likewise do the same for your tripod, standing up fully extended so that all the moisture can dry out at room temperature. I also regularly replace and use silicon gel bags in my camera bag they can absorb up to 1/3 of their own weight in water/moisture vapour. You can buy a pack of 50 for less than £3. Silica Gel Pouches - Pack of 50 Other cleaning products I recommend Also clean your camera bag out regularly, empty it completely, shake and rattle it to make sure every grain of sand, dirt falls out and wipe down the exterior with a damp cloth before leaving it to dry out (empty) in your warm room. Camera Care - #004 - Reduce it Reduce the amount of shots you take! This is not just good advice to slow you down and make you observe and consider more but it also reduces the amount of times the shutter fires on your camera. This is especially true on continuous burst mode. Yes this is a great feature of digital photography in all types of shooting situations - portraits, wildlife, sports and landscapes when timing is essential to freeze/capture the moment, however camera's that have a mirror mechanism also have a limit on how many shots can be made over the life of the camera. This is called \"number of shutter actuations\" and is often quoted when buying a second hand camera. Though personally I think it's a bit meaningless unless you know/trust the seller as there is no way to prove the actual number of shots taken as the counters generally go up to 9999 and then start again at 0 so unlike your car's odometer there isn't an easy way to validate the claim. There is an on-line camera database that you can use to tell you what to expect out of your particular camera model in terms of shutter actuations so take a look for yourself. Camera Care - #005 - Love it You don't quite have to wine and dine it but generally look after it, care about it and show it some love and it will reward you in the long run. I have lost count of the times I see people lay tripods and heads down on the ground or lean them up against walls and cars only for them to fall and cause damage. Or the countless times I see people changing a lens with the camera on the tripod and sensor exposed to air and dust as they turn and reach into their bag for the next lens rather than doing the whole operation kneeling down close to the ground over the camera bag with their back to the wind. Or even little things like leaving the bags compartment cover unzipped for the rain and dust to fall onto the inner contents or worse still the photographer who forgot it wasn't zipped up, grabbed their bag to move on and the contents flew across a 15 yard radius to the ground. It's impossible to list all the do's and don't s in a loving relationship - generally I think it's a case of common sense and just valuing what you have and ensuring you do your best at all times for camera care. photography-tipsAlan Ranger20 April 2022tips LinkedIn0 Pinterest0",
  "wordCount": 1433,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/camera-care-guide#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/camera-care-guide#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}