{
  "@context": "https://schema.org",
  "@graph": [
    {
      "@type": "WebPage",
      "@id": "https://www.alanranger.com/blog-on-photography/case-study-janice-jordan-rps-distinctions#webpage",
      "url": "https://www.alanranger.com/blog-on-photography/case-study-janice-jordan-rps-distinctions",
      "name": "Case Study - Janice Jordan - LRPS | RPS Distinctions",
      "description": "View fullsizeJanice Jordan Hanging PlanRPS DistinctionsJanice has been a regular client at my events for eight years, so I was delighted when she agreed to.",
      "inLanguage": "en-GB",
      "isPartOf": {
        "@id": "https://www.alanranger.com#website"
      },
      "primaryImageOfPage": {
        "@id": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1674578445626-45F0BPEEG06MRWKAT5D9/_-11.jpg"
      }
    },
    {
      "@type": "BreadcrumbList",
      "@id": "https://www.alanranger.com/blog-on-photography/case-study-janice-jordan-rps-distinctions#breadcrumb",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://www.alanranger.com"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Blog",
          "item": "https://www.alanranger.com/blog-on-photography"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Case Study - Janice Jordan - LRPS | RPS Distinctions",
          "item": "https://www.alanranger.com/blog-on-photography/case-study-janice-jordan-rps-distinctions"
        }
      ]
    },
    {
      "@type": "BlogPosting",
      "@id": "https://www.alanranger.com/blog-on-photography/case-study-janice-jordan-rps-distinctions#blogposting",
      "headline": "Case Study - Janice Jordan - LRPS | RPS Distinctions",
      "alternativeHeadline": "Case Study - Janice Jordan - LRPS | RPS Distinctions | Alan Ranger Photography",
      "description": "View fullsizeJanice Jordan Hanging PlanRPS DistinctionsJanice has been a regular client at my events for eight years, so I was delighted when she agreed to.",
      "url": "https://www.alanranger.com/blog-on-photography/case-study-janice-jordan-rps-distinctions",
      "mainEntityOfPage": {
        "@type": "WebPage",
        "@id": "https://www.alanranger.com/blog-on-photography/case-study-janice-jordan-rps-distinctions#webpage"
      },
      "datePublished": "2022-12-15T00:00:00+00:00",
      "dateCreated": "2022-12-15T00:00:00+00:00",
      "dateModified": "2022-12-15T00:00:00+00:00",
      "inLanguage": "en-GB",
      "articleBody": "CASE STUDY - JANICE JORDAN - LRPS | RPS DISTINCTIONSView fullsizeJanice Jordan LRPS Hanging PlanRPS DistinctionsJanice has been a regular client at my events for eight years, so I was delighted when she agreed to take the next step up in her photography development and join my RPS Mentoring Course for RPS distinctions.The pandemic threw a spanner in the works for many clients, and although I switched class sessions from my home to online via Zoom, it was clear that many people struggled to get out and produce new images. Thankfully we were free to go out again after several lockdowns and then it became a question of getting existing clients to be remotivated to pick this up again and continue.Some haven’t continued post-pandemic, which I understand, as life was changed forever with so much disruption and a rebalancing of priorities for everyone.Janice has always been a fun client to have on workshops and events. She is always keen to discover compositions, techniques and thinking patterns with her approach to image-making. She generally gives me a hard time with her banter, and that’s also fine, as I am always willing to give twice as much back 😊You will see from her final panel of images a great variation in technique, subject matter, the skilful use of perspective and exposure settings to place you at the moment, and the feeling of the place or subject. Empathy for the subject is always a vital part of the skills needed to demonstrate a successful pane rom her final panel of images a great variation in technique, subject matter, the skilful use of perspective and exposure settings to place you at the moment, and the feeling of the place or subject. Empathy for the subject is always a vital part of the skills needed to demonstrate a successful panel. The RPS assessors don’t always get it right but generally look for photographer input, awareness, communication and technical execution.Well done, Janice, a bit too long getting to this milestone, but I hope you will be motivated now to continue the journey and look to start creating bodies of work for an A panel and your own satisfaction.The assessors also commented on Janice’s panel for her paper choice for the printing, done by One Vision Imaging Ltd , who supported her with several test prints before the final panel production.----------------------------------------INTERVIEW WITH JANICE ON FOR RPS DISTINCTIONS1. WHY DID YOU WANT TO GAIN A DISTINCTION WITH THE ROYAL PHOTOGRAPHIC SOCIETY (RPS)?It seemed the next natural step. I’m best motivated by having a project so this was ideal for me. It was also a way for me to understand and focus on areas in which I needed to improve.2. WHY DID YOU CHOOSE ALAN TO MENTOR YOU FOR A DISTINCTION AND HAD YOU WORKED WITH ALAN BEFORE THE RPS DISTINCTIONS MENTORING COURSE?I first met Alan at a Get Off Auto workshop in around 2014 and was hooked from the first session. I attended many workshops across a whole range of subjects with Alan together with various day and residential workshops and, therefore, there was never any question that I would choose and trust Alan to mentor me in order to get to the next level. 3. DESCRIBE HOW YOU FOUND THE RPS DISTINCTIONS MENTORING CLASSES. I can’t really fault the format of the mentoring classes as they are restricted to a small group of participants which means that Alan is able to give each participant the right amount of time. Being able to listen to Alan’s critique and advice to the other participants is also really useful. 4. DO YOU FEEL YOU GOT THE RIGHT LEVEL AND INPUT OF SUPPORT FROM THE COURSE?Yes, I found it helpful that Alan gives you some flexibility to work at your own pace within the framework of lessons. There is also the support and understanding from others in the group that is sharing the experience. For me, this extended outside of the workshops with shared trips to locations and events to help us fill the gaps in our portfolios. 5. Did you feel you were already good enough to gain a distinction with the RPS before you started the mentoring course? Personally, I didn’t think I was good enough, but Alan suggested it was the next step and I trusted his judgment. The mentoring course was challenging for me, but Alan’s feedback and critique certainly helped me improve. In hindsight, I learned a great deal from the experience. The mentoring course certainly gave me a focus and has made me think differently about the creative side of photography.6. WHAT DISTINCTION DID YOU APPLY FOR AND WERE YOU SUCCESSFUL?I applied for the L and was successful. 7. WHAT WAS YOUR EXPERIENCE LIKE OF THE RPS ASSESSMENT DAY?I attended the assessment day on Zoom as I couldn’t make the trip to Bristol. Luckily I was first on, so I didn’t have to wait long in my “calmly stressed” state. I was pleasantly surprised at the positive feedback I had from the assessors, and it has certainly given me m OF THE RPS ASSESSMENT DAY?I attended the assessment day on Zoom as I couldn’t make the trip to Bristol. Luckily I was first on, so I didn’t have to wait long in my “calmly stressed” state. I was pleasantly surprised at the positive feedback I had from the assessors, and it has certainly given me more confidence in my ability.8. DID YOU SEEK INDEPENDENT ADVICE, FEEDBACK OR INPUT FROM ANYWHERE ELSE BEFORE YOUR PANEL ASSESSMENT? I booked a 1:1 with an RPS assessor to review my draft panel. This was invaluable as it gave an insight into what the assessors would be looking for. The advice given certainly helped me refine the panel layout and images to bring it up to the required standard 9. HAVING COMPLETED THE COURSE AND DISTINCTION ASSESSMENT, WHAT ADVICE WOULD YOU LIKE TO SHARE WITH OTHERS?Use the checklist provided by Alan, which helps you review the images you have and highlights the gaps you need to fill. Also, having taken part in an assessment day, my advice would be to have your panel critiqued by an RPS assessor before submission to give you the best chance of being successful. 10. WHAT WAS THE HARDEST PART OF GAINING A DISTINCTION WITH THE RPS AND WHY?Staying motivated and also processing images to the required standard. Sometimes having to go back and start processing again. 11. HAS WORKING FOR A DISTINCTION HELPED YOU PROGRESS AS A PHOTOGRAPHER?Yes, it taught me a lot about composition and camera technique. It also helped me improve my processing skills in Lightroom. 12. ANY OTHER COMMENTS YOU WOULD LIKE TO ADD?I would never have achieved a distinction without Alan’s support, patience and perseverance, so thank you. Having watched a live assessment made me realise that his attention to detail and critique is absolutely necessary and gave me the best chance of success.----------------------------------------Click on images to see full screenView fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize ----------------------------------------If you are interested in attaining a distinction with the RPS I can support you with my RPS Courses for distinct RN0D/_-8.jpg]View fullsize ----------------------------------------If you are interested in attaining a distinction with the RPS I can support you with my RPS Courses for distinctions RPS Mentoring Course SUMMARY- PRODUCE A PANEL OF IMAGES FOR AN RPS DISTINCTIONS QUALIFICATION * ZOOM - ONLINE * EVENING CLASS - 19:00 - 21:00. SIX CLASSES, YOU CHOOSE DATES, WITHIN A TWELVE-MONTH PERIOD TO SUIT * FROM £395HAVING SUPPORTED MANY CLIENTS THROUGH A JOURNEY OF DEVELOPMENT AND IMPROVEMENT, WITH THEIR PHOTOGRAPHY, OVER THE PAST FEW YEARS, THIS MENTORING COURSE IS FOR THOSE WHO ARE ALREADY TECHNICALLY COMPETENT (OR AT LEAST ARE ON THE PATH TO MASTERING IT) AND ARE ABLE TO DEMONSTRATE GOOD DESIGN AND COMPOSITION IN THEIR PHOTOGRAPHY.You are not expected to be a master or even polished to attend. This RPS Distinctions course is to help support you in improving in all three areas of image production: * Technical - The mechanics of it * Creativity - The reason for it * Output - The editing and publication of itYou will be expected to understand and demonstrate or be willing to learn; * Good exposure of photographs * Good compositional awareness * A range of techniques and styles (L) or specific themed body of work (A) * Ability to edit images to a \"reasonable\" standard.Over the course of 12 months, where you will attend six RPS Distinctions classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS----------------------------------------Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.comView fullsizephotography-courses , student-photos Alan Ranger 15 December 2022rps-panel , rps distinctions LinkedIn0 Pinterest0 Pinterest0",
      "wordCount": 1580,
      "timeRequired": "PT8M",
      "readingTime": "PT8M",
      "genre": "Photography Case Study",
      "articleSection": "RPS Distinctions",
      "keywords": [
        "rps-panel",
        "rps distinctions"
      ],
      "learningResourceType": "CaseStudy",
      "educationalLevel": "Intermediate",
      "proficiencyLevel": "Intermediate",
      "typicalAgeRange": "18-99",
      "educationalUse": "Learning",
      "estimatedCost": {
        "@type": "MonetaryAmount",
        "currency": "GBP",
        "value": "0"
      },
      "audience": {
        "@type": "EducationalAudience",
        "educationalRole": "Photographer",
        "audienceType": "Student"
      },
      "educationalAlignment": {
        "@type": "AlignmentObject",
        "alignmentType": "educationalFramework",
        "educationalFramework": "Photography Skills",
        "targetName": "Intermediate"
      },
      "about": [
        {
          "@type": "Thing",
          "name": "Royal Photographic Society"
        },
        {
          "@type": "Thing",
          "name": "RPS Distinctions"
        },
        {
          "@type": "Thing",
          "name": "Exposure (photography)"
        },
        {
          "@type": "Thing",
          "name": "Photographic composition"
        },
        {
          "@type": "Thing",
          "name": "Adobe Lightroom"
        }
      ],
      "mentions": [
        {
          "@type": "Thing",
          "name": "RPS"
        },
        {
          "@type": "Thing",
          "name": "Lightroom"
        }
      ],
      "hasPart": [],
      "image": {
        "@type": "ImageObject",
        "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1674578445626-45F0BPEEG06MRWKAT5D9/_-11.jpg",
        "width": 1500,
        "height": 1000,
        "caption": "Case Study - Janice Jordan - LRPS | RPS Distinctions"
      },
      "thumbnailUrl": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1674578445626-45F0BPEEG06MRWKAT5D9/_-11.jpg",
      "primaryImageOfPage": {
        "@id": "https://www.alanranger.com/blog-on-photography/case-study-janice-jordan-rps-distinctions#webpage"
      },
      "speakable": {
        "@type": "SpeakableSpecification",
        "xpath": [
          "/html/head/title",
          "//h1"
        ],
        "cssSelector": [
          "h1",
          ".intro"
        ]
      },
      "discussionUrl": "https://www.alanranger.com/blog-on-photography/case-study-janice-jordan-rps-distinctions#comments",
      "author": {
        "@type": "Person",
        "@id": "https://www.alanranger.com/#alanranger",
        "name": "Alan Ranger",
        "url": "https://www.alanranger.com/about-alan-ranger",
        "jobTitle": "Photographer & Photography Educator",
        "sameAs": [
          "https://www.alanranger.com",
          "https://www.linkedin.com/in/alanrangerphotography"
        ]
      },
      "publisher": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography",
        "url": "https://www.alanranger.com",
        "logo": {
          "@type": "ImageObject",
          "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/b859ad2b-1442-4595-b9a4-410c32299bf8/ALAN+RANGER+photography+LOGO+BLACK.+switched+small.png?format=1500w",
          "width": 300,
          "height": 100
        }
      },
      "isPartOf": {
        "@type": "WebSite",
        "@id": "https://www.alanranger.com/#website"
      },
      "copyrightHolder": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography"
      },
      "copyrightYear": 2022,
      "sameAs": [
        "https://www.alanranger.com/blog-on-photography"
      ],
      "relatedLink": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "subjectOf": {
        "@type": "Blog",
        "@id": "https://www.alanranger.com/blog-on-photography#blog"
      },
      "isRelatedTo": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "citation": "Royal Photographic Society",
      "backstory": "CASE STUDY - JANICE JORDAN - LRPS | RPS DISTINCTIONSView fullsizeJanice Jordan LRPS Hanging PlanRPS DistinctionsJanice has been a regular client at my events for eight years, so I was delighted when she agreed to take the next step up in her photography development and join my RPS Mentoring Course for RPS distinctions.",
      "funding": {
        "@type": "MonetaryGrant",
        "funder": {
          "@type": "Organization",
          "name": "Alan Ranger Photography"
        }
      },
      "interactionStatistic": {
        "@type": "InteractionCounter",
        "interactionType": "https://schema.org/CommentAction",
        "userInteractionCount": 0
      },
      "commentCount": 0
    }
  ]
}