{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/case-study-kirsten-pearce-rps-distinctions#blogposting",
  "headline": "Case Study - Kirsten Pearce - LRPS | RPS Distinctions",
  "alternativeHeadline": "Case Study - Kirsten Pearce - LRPS | RPS Distinctions | Alan Ranger Photography",
  "description": "View fullsize Kirsten has been a regular client at my events for some years, so it was fitting that she decided to take that step of gaining a RPS.",
  "url": "https://www.alanranger.com/blog-on-photography/case-study-kirsten-pearce-rps-distinctions",
  "datePublished": "2022-09-17T00:00:00.000Z",
  "dateModified": "2022-09-17T00:00:00.000Z",
  "dateCreated": "2022-09-17T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Case Study - Kirsten Pearce - LRPS | RPS Distinctions View fullsize Kirsten has been a regular client at my events for some years, so it was fitting that she decided to take that step of gaining a RPS Distinctions through my mentoring scheme. When Kirsten first signed up for the RPS classes, she (under my influence) embarked on the Associate level and steadily built up a panel of water abstracts. However, after initial feedback from an RPS 1-2-1 and much deliberation, she switched to attaining the Licentiate. Kirsten is a photographer with a natural eye, and her images are generally on the creative and abstract side rather than literal, so doing the L was, in some ways, a challenge. Stepping away from a single-themed panel to demonstrate diversity in technique, lighting, and genre requires a broad range of images from your back portfolio that can work together. In fact, the overall panel layout is often referred to as the 11th image. Kirsten’s journey to this achievement was delayed because of the initial false start and then Covid-19 restrictions, so I was delighted when she returned to complete this project earlier this year. Kirsten has demonstrated through her images that she can competently use the camera across a wide range of situations, from freezing action in 2, 3 and 9 to more abstract use in colour, shape and texture in 4, 5 and 7 and using light and mood in 1 and 8 to depict emotion in her landscapes. The assessors also commented on Kirsten’s panel for her paper choice for the printing, done by One Vision Imaging Ltd, who supported her with several test prints before the final panel production. Congratulations Kirsten; long overdue and well earned. It gives me so much pride to have seen you gain this achievement, and I hope you will be spurred on to enjoy your creative image-making with an eye on the Associate distinction soon.You can follow Kirsten on Instagram to see more of her creative images. https://www.instagram.com/kirstennpearce/ Interview with Kirsten going for RPS Distinctions1. Why did you want to gain a distinction with the Royal Photographic Society (RPS)? A question I asked myself many times! I’d made the commitment to develop my skills in photography. It is a recognised international qualification and was a standard to aim for and to challenge myself to reach. 2. Why did you choose Alan to mentor you for RPS Distinctions and had you worked with Alan before the RPS Mentoring Course? I completed Alan’s beginner’s course in 2014 as my first step in photography. Since then I have taken part in mentoring, many workshops and the intentions course. Alan was therefore the natural choice of mentor. 3. Describe how you found the RPS Mentoring Classes. The classes were really helpful in learning what made a good panel. Alan’s honest feedback and high standards gave me confidence that I was as prepared as I could be when I got to the assessment stage. It was a supportive way of working, good to learn from people on the same journey and to help and support each other. This extended outside of the classes with shared photo trips to look for images to fill any gaps. 4. Do you feel you got the right level and input of support from the course? Definitely. Getting 10 images together that not only work individually, but also as a panel is challenging. Lots of images were rejected along the way. Alan’s constructive criticism as well as the many hints and tips that I picked up from the course have really helped me to develop as a photographer. 5. Did you feel you were already good enough to gain a distinction with the RPS before you started the mentoring course? I trusted Alan’s opinion that it was achievable. Completing the LRPS was a good choice and has given me the confidence that I have achieved a benchmark that I can move on from. Now I’ve finished the qualification I’m looking forward to developing the areas of photography that I enjoy and not worrying about whether what I’m taking will work in a panel! 6. What RPS Distinctions did you apply for and were you successful? I gained the LRPS. 7. What was your experience like of the RPS Distinctions Assessment Day? Daunting! I wanted to attend in person as I’d heard from others about their experiences of the day. It turned out that audiences haven’t really returned in numbers post covid and I was the only observer there. Fortunately I was successful, otherwise it would have been very awkward! The staff there were very welcoming and after my assessment had been completed I had the opportunity to talk to the assessors who were very encouraging. I’m glad I went as it was good to be there in person to listen to their comments during my assessment, it made the experience feel more complete than it would have by staying at home. 8. Did you seek independent advice, feedback or input from anywhere else before your panel assessment? I signed up for a one2one with the RPS once my draft panel of 10 with 5 spares was ready. This was by zoom and with a volunteer that is sometimes a panel member. The second opinion gained by someone looking at the images with a fresh pair of eyes was really helpful. He made a number of suggestions that helped to refine my final panel. 9. Having completed the course and Distinction Assessment, what advice would you like to share with others? I’d definitely recommend getting your images printed rather than doing the digital assessment. I felt that learning about the printing process and having something physical at the end made everything feel more complete. I had my images printed at One Vision and Adam and the team there were incredibly supportive and helpful. 10. What was the hardest part of gaining a distinction with the RPS and why? Staying motivated. I had a few false starts before getting to this point and it would have been very easy to give up. I can’t begin to imagine how many images were rejected before getting to the final 10 11. Has working for a RPS Distinctions helped you progress as a photographer? I’ve learnt a lot from camera craft to composition to processing to forming a coherent panel showing a range of techniques. There’s still lots to learn but it has definitely made me a better photographer. 12. Any other comments you would like to add. Many thanks to Alan for all of his time, support and encouragement throughout the journey and particularly over the last few months. His high standards and attention to detail meant that although I was very nervous on the day I knew that I was as prepared as I could be for the assessment. Click on images to see full screen If you are interested in attaining a distinction with the RPS I can support you with my RPS Course - Mentoring to gain a distinction RPS Mentoring Course Summary- Produce a panel of images for an RPS Distinctions Qualification • Zoom - Online • Evening Class - 19:00 - 21:00. Six classes, you choose dates, within a twelve-month period to suit • From £395 Having supported many clients through a journey of development and improvement, with their photography, over the past few years, this mentoring course is for those who are already technically competent (or at least are on the path to mastering it) and are able to demonstrate good design and composition in their photography. You are not expected to be a master or even polished to attend. This course is to help support you in improving in all three areas of image production: • Technical - The mechanics of it Creativity - The reason for it Output - The editing and publication of it You will be expected to understand and demonstrate or be willing to learn; Good exposure of photographs Good compositional awareness A range of techniques and styles (L) or specific themed body of work (A) Ability to edit images to a \"reasonable\" standard. Over the course of 12 months, where you will attend six classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.com photography-courses, student-photosAlan Ranger17 September 2022rps-panel, rps distinctions LinkedIn0 Pinterest0",
  "wordCount": 1520,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-kirsten-pearce-rps-distinctions#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-kirsten-pearce-rps-distinctions#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "RPS Distinctions"
    },
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    }
  ]
}