{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/case-study-joyce-james-rps-distinctions#blogposting",
  "headline": "Case Study - Joyce James LRPS | RPS Distinctions Panel",
  "alternativeHeadline": "Case Study - Joyce James LRPS | RPS Distinctions Panel | Alan Ranger Photography",
  "description": "Joyce James shares how she gained her LRPS - RPS Distinctions, the challenges, experience and resulting successful panel with my rps mentoring programme.",
  "url": "https://www.alanranger.com/blog-on-photography/case-study-joyce-james-rps-distinctions",
  "datePublished": "2019-07-12T00:00:00.000Z",
  "dateModified": "2019-07-12T00:00:00.000Z",
  "dateCreated": "2019-07-12T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "CASE STUDY - JOYCE JAMES LRPS | RPS DISTINCTIONS PANELView fullsizeLRPS PanelJoyce James has been a client of mine for over five years and has become a good friend in that time too. Being a witness to her going for RPS Distinctions was a journey for us both.It’s fair to say that Joyce has just about engaged in every form of tuition with me and often rebelled against my advice to become more organised and at least try to follow my methodical/considered approach in most aspects. In many ways, despite many moments of crying, but usually laughter between us, her maverick ways have helped her to explore the multiple ways of doing something but discovering through perseverance and repetition that sticking to the outcome still gets her there in the end.Joyce is certainly not a technical purist and is very happy to see what turns out so, it was a long battle to convince her to go for her LRPS Distinction. The formality, “stuffiness” and discipline required to put a panel of individual images together that combined into a coherent panel, showing diversity of technique but consistency of competence is not something that came easy to her. Firstly it meant she would need to organise her image library, I can assure you that this is not Joyce’s way of doing things. Secondly she would need to re-work images that she was once happy with. Thirdly she would need take new images to fit into the panel rather than just take a picture because she liked something.Her initial RPS cl nise her image library, I can assure you that this is not Joyce’s way of doing things. Secondly she would need to re-work images that she was once happy with. Thirdly she would need take new images to fit into the panel rather than just take a picture because she liked something.Her initial RPS classes with me were a bit of a jumble sale approach (what about this one x 100 and of course her personal favourites) which meant that after sorting and filtering to create shortlists she had to return to the originals to embark on re-editing photos that for her were already done and dusted. Needless to say there were a few iterations required but as Joyce stuck to the task in hand and after less than 12 months and six classes had a draft panel ready for assessment and presentation.Her hard work, and often reluctant, but final conformity has led to her producing a panel of images that were not only successful for the LRPS Distinction but in my view have made her a better photographer.Joyce now recognises more about composition, technical execution, editing and final presentation than she ever did before as a result of doing the RPS Distinction Mentoring Course. In a nutshell, the journey of achieving the RPS Distinction has consolidated the years of input, nagging, mentoring and critiquing from me in six months that I had failed to get to her apply consistently in the previous five years.Joyce has now set herself a new benchmark and raised the bar so I hope (should i say optimistically pray for) that she will now apply the same effort and standards to her ongoing photography and journey.I am very proud of her achievement, progression and final acceptance of “sometimes it pays to keep re-working something until it’s as perfect as can be”.View fullsizeJoyce RPS Hanging Plan for LRPS - click to see large----------------------------------------INTERVIEW WITH JOYCE GOING FOR HER RPS DISTINCTIONS1. WHY DID YOU WANT TO GAIN A DISTINCTION WITH THE ROYAL PHOTOGRAPHIC SOCIETY (RPS)?It seemed a good next step in my progress towards improving as a photographer – however when Alan first suggested that I should go for it I wasn’t sure that I wanted to as I lacked confidence in my ability and I knew it was going to take a lot of time and commitment. I wasn’t sure that I was up for the challenge!2. Why did you choose Alan to mentor you for RPS Distinctions and had you worked with Alan before the RPS Mentoring Course?Yes, I knew Alan well. He has mentored me for a number of years now. I trust him.3. Describe how you found the RPS Mentoring Classes The classes were invaluable in building my panel. I enjoyed the collaboration but also valued the flexibility to leave early if you had other commitments e.g family. I got exactly what I needed from the input – especially as I grew more familiar with the requirements of LRPS and appreciated how the input was tailored to fit with them 4. Do you feel you got the right level and input of support from the course?Yes definitely 5. Did you feel you were already good enough to gain RPS Distinctions with the RPS before you started the mentoring course? I trusted Alan not to put me in for something that was beyond me. I was relieved when my panel started to come together as there was a point when I felt a bit all over the place -ie I had a stack of random images but no shape / flow. Then suddenly it came together in rather a eureka moment. I am interested to see whethe put me in for something that was beyond me. I was relieved when my panel started to come together as there was a point when I felt a bit all over the place -ie I had a stack of random images but no shape / flow. Then suddenly it came together in rather a eureka moment. I am interested to see whether it is the same if / when I put together an A panel. Hopefully, I’ll have more of a sense of what I need earlier in the process. 6. What RPS Distinctions did you apply for and were you successful?LRPS - yes 7. What was your experience like of the RPS Distinctions Assessment Day?I was ridiculously nervous! Everyone seemed to be.In the event it was incredible positive and affirming. I was so pleased I’d gone in person as the feedback was really nice to hear. If you don’t actually attend you just get the certificate. 8. Did you seek independent advice, feedback or input from anywhere else before your panel assessment?I attended an Advisory day – again this was a positive experience. It confirmed that I was just about ready for submission 9. Having completed the course and RPS Distinctions Assessment, what advice would you like to share with others?Be prepared to put the time and effort in.Accept that many of your images will be rejected during the process of building a panel that worksTake advice 10. What was the hardest part of gaining a distinction with the RPS and why?The sheer effort of building an effective panel – it is quite a challenge 11. Has working for a distinction helped you progress as a photographer?Oh yes definitely – and it’s given me a benchmark for the future 12. Any other comments you would like to add.Massively satisfying when you do pass! Well worth doingThanks for believing in meX----------------------------------------Click on images to see full screenView fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize ----------------------------------------If you are interested in attaining a distinction with the RPS I can support you with my RPS Mentoring Course .RPS Mentoring Course ----------------------------------------If you are interested in attaining a distinction with the RPS I can support you with my RPS Mentoring Course .RPS Mentoring Course SUMMARY- PRODUCE A PANEL OF IMAGES FOR AN RPS DISTINCTIONS QUALIFICATION * COVENTRY * EVENING CLASS - 19:00 - 21:00. SIX CLASSES, YOU CHOOSE DATES, WITHIN TWELVE MONTH PERIOD TO SUIT * OR OPTION TO DO ONLINE WITH SKYPE AND SCREEN SHARING WITH DATES/TIMES TO SUIT YOU. (1HR PER SESSION) * FROM £395HAVING SUPPORTED MANY CLIENTS THROUGH A JOURNEY OF DEVELOPMENT AND IMPROVEMENT, WITH THEIR PHOTOGRAPHY, OVER THE PAST FEW YEARS, THIS MENTORING COURSE IS FOR THOSE WHO ARE ALREADY TECHNICALLY COMPETENT (OR AT LEAST ARE ON THE PATH TO MASTERING IT) AND ARE ABLE TO DEMONSTRATE GOOD DESIGN AND COMPOSITION IN THEIR PHOTOGRAPHY.You are not expected to be a master or even polished to attend. This course is to help support you in improving in all three areas of image production: * Technical - The mechanics of it * Creativity - The reason for it * Output - The editing and publication of itYou will be expected to understand and demonstrate or be willing to learn; * Good exposure of photographs * Good compositional awareness * A range of techniques and styles (L) or specific themed body of work (A) * Ability to edit images to a \"reasonable\" standard.Over the course of 12 months, where you will attend six classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS----------------------------------------Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.comView fullsizephotography-courses , student-photos Alan Ranger 12 July 2019Alan Ranger Photography case-studies , rps-panel , rps distinctions LinkedIn0 Tumblr 0 Likes",
  "wordCount": 1627,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-joyce-james-rps-distinctions#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-joyce-james-rps-distinctions#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "RPS Distinctions"
    },
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    }
  ]
}