{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/case-study-mike-ford#blogposting",
  "headline": "Case Study - Mike Ford shares a photographic journey",
  "alternativeHeadline": "Case Study - Mike Ford shares a photographic journey | Alan Ranger Photography",
  "description": "Mike Ford signed up for photography tuition in March 2014 after meeting me the Photography Show at the NEC.&nbsp;&nbsp;Case Study a photographic journey with him to RPS.",
  "url": "https://www.alanranger.com/blog-on-photography/case-study-mike-ford",
  "datePublished": "2015-07-19T00:00:00.000Z",
  "dateModified": "2015-07-19T00:00:00.000Z",
  "dateCreated": "2015-07-19T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "CASE STUDY - MIKE FORD SHARES A PHOTOGRAPHIC JOURNEYView fullsizeA PHOTOGRAPHIC JOURNEY CASE STUDYMike Ford signed up for photography tuition in March 2014 after meeting me at the Photography Show at the NEC. Mike is based in Yorkshire so naturally attending classroom based evening classes was not viable. Instead Mike has had some 1-2-1 tuition, attended a location workshop and has been a committed participant on the mentoring programme for over a year now.I can't take to much credit for Mike's photography as he came to me with a reasonable understanding and good eye already. The area I think I can claim maybe a little bit of credit is in helping him to realise the full potential of his shots in Lightroom and broadening his range of topics to support his application for the Licentiateship with the RPS (Royal Photographic Society)Mike has regularly appeared in the blogs' on mentoring assignments as his work is a good and consistent standard. You will also see from his proposed panel for the RPS that he demonstrates a competent level of photography over a wide range of subjects and is now building a personal portfolio of images that show his unique perspective and connection to his subjects. Well done Mike I am very proud of your progress and know you will be successful with your photography. My only regret is that you don't live closer :)----------------------------------------View fullsizeMike's draft L Panel for the RPS - click to see large----- connection to his subjects. Well done Mike I am very proud of your progress and know you will be successful with your photography. My only regret is that you don't live closer :)----------------------------------------View fullsizeMike's draft L Panel for the RPS - click to see large----------------------------------------INTERVIEW WITH MIKE 1. WHY DID YOU WANT TO BECOME A PHOTOGRAPHER?a. I've always had an interest in photography for many years but recently have started to seriously look at my images and wondered why they didn’t look as the ones I used to see in the photography magazines. I wanted to understand what I needed to do differently to improve my images2. WERE YOU SCARED OR ANXIOUS TO START OUT?a. I was more excited and interested in learning new things than scared but submitting your first pictures for review is definitely a scary moment.3. WHY DID YOU SELECT ALAN AS YOUR TUTOR?a. I had decided to find a training course to learn how to get the best out of Adobe Lightroom. All the training I looked at on the internet talked about showing you what lightroom did. I really needed someone to show me how to apply it to my images. I met Alan at the Photography show and we talked about what I needed and I knew straight away his teaching style suited what I neededView fullsizeImage 1, not sure what I was thinking of, had an idea but not sure how to capture it.4. WHAT WAS YOUR MAIN MOTIVATION TO COMMIT TO ALAN’S TUITION?a. To improve the quality of my images and then to develop further to be able to get a portfolio of images together that would be good enough for joining the RPS5. WHAT TYPE OF TUITION HAVE YOU HAD FROM ALAN?a. My first course was a half day lightroom session which was excellent, I learnt so much in such a short space of time, I followed this with the mentoring assignments and another half day on a field trip.6. HOW DO YOU FEEL ALAN’S TEACHING STYLE HAS HELPED DEVELOP YOUR SKILLS THE MOST?a. My images coming out of lightroom are much better than they were in the past, I feel I have much more of an understanding of what I’m doing now with a defined workflow. Before I was just sliding the settings in a random order hoping they improved the look of the imageView fullsizeImage 2, nice scene but taken without thinking about depth of field, composition and what I was trying to capture7. WHAT ARE THE KEY THINGS ALAN HAS HELPED YOU WITH?a. Developing my photographer’s eye and attention to detail. When completing my mentoring assignments I spend much more time looking at the image I am trying to take and thinking of how it could be improved. I am more a technology person than creative so while my images are technically good they could be improved. Alan’s feedback, which is targeted at you as an individual, has pushed me to improve but he has also given tips on how to improve my creative side8. HOW DO YOU THINK YOU’VE GROWN AS A PHOTOGRAPHER?a. My images have definitely taken a step change over the last few years, I am happier with showing my images to others and I now feel I have the skills to take even better images. I feel I am much better at critiquing my own work, in the past I would have looked and been disappointed with the picture with no idea on what to do next but now I look at them knowing what I could do better to improve itView fullsizeStarting to get images that I’m pleased with - this one was from Al I am much better at critiquing my own work, in the past I would have looked and been disappointed with the picture with no idea on what to do next but now I look at them knowing what I could do better to improve itView fullsizeStarting to get images that I’m pleased with - this one was from Alan's mentoring assignment in March this year9. WHAT ARE YOUR AMBITIONS FOR THE FUTURE WITH PHOTOGRAPHY?a. To eventually have a portfolio that is good enough for entry to the RPS but also to be able to take a good images that feel proud of10. WHAT ADVICE WOULD YOU GIVE OTHERS WHO ARE THINKING OF STARTING PHOTOGRAPHY TUITION OR WHO ARE CURRENTLY STUDYING?a. Start the process as soon as you can, be prepared to be challenged but you will enjoy it as you see the improvements coming11. ANY OTHER COMMENTS:a. Think about Alan’s advice and really listen and understand what he is saying, it’s quite emotive when he’s not as excited about one of your images as you are, it may have even been one of your favourites! But when you look and think about the feedback you start to see how you could improve your imagesView fullsize----------------------------------------Mike has also taken the next step with her photography by becoming an Artist to have an on-line gallery of images to sell - see her wonderful images here.Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.comView fullsizestudent-photos Alan Ranger 19 July 2015case-studies , a photographic journey LinkedIn0 Pinterest0 study-mike-ford]",
  "wordCount": 1215,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-mike-ford#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-mike-ford#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}