{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/case-study-francis-peckham-rps-distinctions#blogposting",
  "headline": "Case Study - Francis Peckham LRPS | RPS Distinctions",
  "alternativeHeadline": "Case Study - Francis Peckham LRPS | RPS Distinctions | Alan Ranger Photography",
  "description": "Francis Peckham shares how he gained his LRPS - RPS Distinctions, the challenges, experience and resulting successful panel with my RPS Mentoring Programme.",
  "url": "https://www.alanranger.com/blog-on-photography/case-study-francis-peckham-rps-distinctions",
  "datePublished": "2020-03-22T00:00:00.000Z",
  "dateModified": "2020-03-22T00:00:00.000Z",
  "dateCreated": "2020-03-22T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "CASE STUDY - FRANCIS PECKHAM LRPS | RPS DISTINCTIONSView fullsizeFrancis Peckham LRPS PanelFrancis attended a residential workshop I ran in Snowdonia in July 2018. Francis is a keen photographer who regularly attends organised outdoor workshops and his local camera club in London.Having attended my Wales workshop, Francis signed up for the RPS Distinctions Mentoring Course in August 2018. He attended several group classes and undertook some 1-2-1 sessions too (mainly to try and master the IT/technical side of things) and my bluebells workshop last spring.Francis was not always easy to teach as he definitely gets frustrated over the IT but was always a pleasure to work with. His determination and effort to achieve this distinction was proven with regular 200 miles round trips and some Skype sessions to get him over the line at the first time of asking.His panel shows great variety, essential for the licentiateship, technical quality (though hard to see how good they are as he only managed to send me small thumbnails) and real a sense of place and time, demonstrating his good eye for a shot and careful composition.Well done Francis, I hope this is just the first step in your continued development and you will go on enjoying and progressing your hobby.----------------------------------------INTERVIEW WITH FRANCIS ON GOING FOR RPS DISTINCTIONS1. WHY DID YOU WANT TO GAIN A DISTINCTION WITH THE ROYAL PHOTOGRAPHIC SOCIETY (RPS)?As a keen lifelong photog ep in your continued development and you will go on enjoying and progressing your hobby.----------------------------------------INTERVIEW WITH FRANCIS ON GOING FOR RPS DISTINCTIONS1. WHY DID YOU WANT TO GAIN A DISTINCTION WITH THE ROYAL PHOTOGRAPHIC SOCIETY (RPS)?As a keen lifelong photographer, as with any hobby, I wanted to benchmark my progress, to compare my efforts to an accepted benchmark to ensure that I was making progress and becoming a better photographer.2. WHY DID YOU CHOOSE ALAN TO MENTOR YOU FOR A RPS DISTINCTIONS AND HAD YOU WORKED WITH ALAN BEFORE THE RPS MENTORING COURSE?Right place, right time.... I was on a field trip with Alan and the subject came up. Curiously, while there any number of photographic courses available, few instructors seem to offer distinctions mentoring. 3. DESCRIBE HOW YOU FOUND THE RPS MENTORING CLASSES. Living in West London, the 200-mile return trip to Coventry was often best combined with some other project e.g. poppy workshop etc. The format of a 2-3 man tutorial works well in that it is interesting to see how others are faring. Given the limited time available, it also creates motivation to have your own succinct timetable to address whatever needs to be done within your own portfolio. Its quite effective project management. When Alan prints off your panel at the end, there’s a clear agenda of what needs to be done. The other technical aspect I would highlight is that Alan is one of few photographers to have previously had an extensive IT career. Personally, I’ve always felt at home with the “artistry” of photography, but often quite puzzled by the IT aspects of moving images around catalogues, via Lightroom etc. Alan contributes a lot in this regard. 4. DO YOU FEEL YOU GOT THE RIGHT LEVEL AND INPUT OF SUPPORT FROM THE COURSE?Yes. There’s a high level of project management going on and Alan is a clear communicator. I always felt I knew where I was ( which was not necessarily where I ought to be ! ). 5. Did you feel you were already good enough to gain a distinction with the RPS before you started the mentoring course? I felt I was a reasonable photographer and “in with a chance.” Alan’s tuition is particularly helpful at imparting what the judges will be looking for and eliminating possible reasons for rejection. I’d say he is over-conservative in this regard, but that’s better than a cavalier approach!6. WHAT RPS DISTINCTIONS DID YOU APPLY FOR AND WERE YOU SUCCESSFUL?I succeeded in getting my LRPS 7. WHAT WAS YOUR EXPERIENCE LIKE OF THE RPS DISTINCTIONS ASSESSMENT DAY?I didn’t go this way...8. DID YOU SEEK INDEPENDENT ADVICE, FEEDBACK OR INPUT FROM ANYWHERE ELSE BEFORE YOUR PANEL ASSESSMENT? Yes, my camera club has a distinctions group and I also sought the advice of a former head of a regional judging panel. All very helpful in combination, but invariably a number of well-qualified people will end up saying different things, so beyond a certain point, I felt I just had to make up my own mind and go for it. 9. HAVING COMPLETED THE COURSE AND RPS DISTINCTIONS ASSESSMENT, WHAT ADVICE WOULD YOU LIKE TO SHARE WITH OTHERS?I would encourage any ambitious hobbyist photographer to have a go and see how their standard compares. I would also recommend some form of tutored process as this is way beyond the hit ‘n miss process of club competitions etc 10. WHAT WAS THE HARDEST PART OF GAINING A DISTINCT RE WITH OTHERS?I would encourage any ambitious hobbyist photographer to have a go and see how their standard compares. I would also recommend some form of tutored process as this is way beyond the hit ‘n miss process of club competitions etc 10. WHAT WAS THE HARDEST PART OF GAINING A DISTINCTION WITH THE RPS AND WHY?I use a Mac and Alan swears by his PC – that sometimes caused friction! 11. HAS WORKING FOR A DISTINCTION HELPED YOU PROGRESS AS A PHOTOGRAPHER?Unquestionably. Now, whenever I take a photo, there is so much more going on in my mind about how I want the resulting image to look 12. ANY OTHER COMMENTS YOU WOULD LIKE TO ADD.I have found doing my LRPS one of the most rewarding processes I have undertaken and would recommend it to any other keen photographer. Alan is a great tutor – even if he uses a PC ( ! )----------------------------------------Click on images to see full screenView fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize ----------------------------------------If you are interested in attaining a distinction with the RPS I can support you with my RPS Mentoring Course .RPS Mentoring Course SUMMARY- PRODUCE A PANEL OF IMAGES FOR AN RPS DISTINCTIONS QUALIFICATION * COVENTRY * EVENING CLASS - 19:00 - 21:00. SIX CLASSES, YOU CHOOSE DATES, WITHIN TWELVE MONTH PERIOD TO SUIT * OR OPTION TO DO ONLINE WITH SKYPE AND SCREEN SHARING WITH DATES/TIMES TO SUIT YOU. (1HR PER SESSION) * FROM £395HAVING SUPPORTED MANY CLIENTS THROUGH A JOURNEY OF DEVELOPMENT AND IMPROVEMENT, WITH THEIR PHOTOGRAPHY, OVER THE PAST FEW YEARS, THIS MENTORING COURSE IS FOR THOSE WHO ARE ALREADY TECHNICALLY COMPETENT (OR AT LEAST ARE ON THE PATH TO MASTERING IT) AND ARE ABLE TO DEMONSTRATE GOOD DESIGN AND COMPOSITION IN THEIR PHOTOGRAPHY.You are not expected to be a master or even polished to attend. This course is to help support you in improving in all three areas of image production: * Technical - The mechanics of it * Creativity - The reason for it * Output - The editing and publication of itYou will be expected to understand and demonstrate or be willing to learn; * Good exposure of photographs * Good composi you in improving in all three areas of image production: * Technical - The mechanics of it * Creativity - The reason for it * Output - The editing and publication of itYou will be expected to understand and demonstrate or be willing to learn; * Good exposure of photographs * Good compositional awareness * A range of techniques and styles (L) or specific themed body of work (A) * Ability to edit images to a \"reasonable\" standard.Over the course of 12 months, where you will attend six classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS----------------------------------------Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.comView fullsizephotography-courses , student-photos Alan Ranger 22 March 2020Alan Ranger Photography case-studies , rps-panel , rps distinctions LinkedIn0 Pinterest0",
  "wordCount": 1436,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-francis-peckham-rps-distinctions#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-francis-peckham-rps-distinctions#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "RPS Distinctions"
    },
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}