{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/case-study-anne-watkinson-rps-distinctions#blogposting",
  "headline": "Case Study - Anne Watkinson LRPS | RPS Distinctions",
  "alternativeHeadline": "Case Study - Anne Watkinson LRPS | RPS Distinctions | Alan Ranger Photography",
  "description": "View fullsize Panel RPS Distinctions Anne is a relatively new client who came to me about 18 months ago after not getting her for the first time of asking.",
  "url": "https://www.alanranger.com/blog-on-photography/case-study-anne-watkinson-rps-distinctions",
  "datePublished": "2019-07-14T00:00:00.000Z",
  "dateModified": "2019-07-14T00:00:00.000Z",
  "dateCreated": "2019-07-14T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Case Study - Anne Watkinson LRPS | RPS Distinctions View fullsize LRPS Panel RPS Distinctions Anne is a relatively new client who came to me about 18 months ago after not getting her LRPS for the first time of asking. Here is her story for RPS Distinctions Anne attended a few location workshops with me at that time to improve her understanding of composing a scene and executing the technical requirements. Interestingly and probably uniquely, she had already acquired a large body of images from her many travels around the world. Therefore in Anne’s case, a lot of her time with me was spent on organising her Lightroom library to create an image library structure and ways of identifying images for consideration and reviewing and critiquing a large portfolio. Anne took on the challenge of spending more time on working on existing images to realise their potential rather than having to go out and create new ones. Her tuition was largely, therefore based around image selection end editing rather than image creation. Anne undertook several 1-2-1 Lightroom tuition lessons, and, in the process, I took on grappling with the MAC operating system, alien to me, and the use of a mouse that didn’t do what I expected with a file management system that is “less than intuitive”. Anne always had a good range of images to choose from in terms of technique and subject matter for the L panel, but as she admitted, none were the finished article. It’s fair to say that almost 99% were just straight out of the camera and hadn’t had any enhancement or correction. Over eight months, Anne asked me to help her use Lightroom to edit images and bring them up to the required standard for a panel. Anne also used her network of friends and acquaintances in the camera club circles to get second and third opinions about image choices and panel layouts, but she was always trusting to seek my final adjudication on what to be submitted, Anne has been a pleasure to work with and develop her skills over the last year. She has been fully committed, compliant to my guidance and instructions (most of the time) and I am very proud that she has reached this goal of achieving an LRPS after her initial failed attempt. I know she will continue to work on her editing and presentation of images wherever her travels take her, and I wish her the ongoing enjoyment and satisfaction that I know photography brings her on her worldly travels and sometimes with me. Anne RPS Hanging Plan for LRPS - click to see large Interview with Anne on going for RPS Distinctions1. Why did you want to gain a distinction with the Royal Photographic Society (RPS)? I wanted to improve my photography in a more structured and disciplined way. I travel a great deal, and I wanted to come back with really good images, rather than a lot of poor snaps. I hoped the process of working towards a LRPS would improve my camera work, technique and composition. 2. Why did you choose Alan to mentor you for a distinction and had you worked with Alan before the RPS Distinctions Course? Before I met Alan I had submitted a panel for LRPS which was not successful. I subsequently did a few workshops with Alan and really liked his style of teaching, and when I saw that he was offering an RPS mentoring course, I felt I would like to give it another go. 3. Describe how you found the RPS Mentoring Classes. I found the course content and duration was exactly what I wanted. The small groups of three others gave us all plenty of time for individual help, as well having interesting discussions about each others work. The time between sessions was just right, allowing enough time to work on our panels and individual images. 4. Do you feel you got the right level and input of support from the course? Very definitely. 5. Did you feel you were already good enough to gain a distinction with the RPS before you started the mentoring course? At the beginning , definitely not. During the course I gained more confidence, although I realised I had to really focus on the many aspects to achieve my goals. It was a journey with ups and downs, but by the end of the course I felt I had achieved those goals, but I recognise I would never have learned so much without the mentoring course. 6. What distinction did you apply for and were you successful? LRPS successful 7. What was your experience like of the RPS Assessment Day? A bit nail biting, although I felt I had presented a panel I was happy with. However, you never know how the judges will view it. The RPS staff were very helpful throughout. The judges all commented on the importance of panel layout, printing, mounting, choice of image variety and of course camera technique. I really enjoyed looking at other candidates panels. 8. Did you seek independent advice, feedback or input from anywhere else before your panel assessment? I attended an advisory day before my assessment, which I found really useful. I had my prints professionally printed and mounted, and sought their advice on suitable papers and mounts to use. 9. Having completed the course and Distinction Assessment, what advice would you like to share with others? It was definitely worthwhile, however, I know that I would certainly not have learned nearly so much on my own, and I am not sure I would have been successful without Alan's mentoring. If it's something you think you would like to do, then go for it. With Alan's mentoring you are in very good hands! 10. What was the hardest part of gaining a distinction with the RPS and why? Although it was difficult selecting 10 images and working on them, the hardest part was putting images together that worked well, especially as many of them were not directly related. I also found post processing a challenge as I have preferred to get things right in camera in the past, but I have learned that even small adjustments can make or break an image. 11. Has working for a distinction helped you progress as a photographer? Absolutely! As that was my aim at the outset it has definitely been worthwhile. 12. Any other comments you would like to add. The last 15 months have been a lot of hard work and a great sense of achievement in equal measures, but it wouldn't have been as enjoyable or achievable without a huge amount of effort, encouragement and input from Alan. Thank you Alan for an amazing and successful journey. Click on images to see full screen If you are interested in attaining a distinction with the RPS I can support you with my RPS Mentoring Course. RPS Mentoring Course Summary- Produce a panel of images for an RPS Distinction Qualification • Coventry • Evening Class - 19:00 - 21:00. Six classes, you choose dates, within twelve month period to suit • Or option to do online with Skype and screen sharing with dates/times to suit you. (1hr per session) • From £395 Having supported many clients through a journey of development and improvement, with their photography, over the past few years, this mentoring course is for those who are already technically competent (or at least are on the path to mastering it) and are able to demonstrate good design and composition in their photography. You are not expected to be a master or even polished to attend. This RPS Distinctions course is to help support you in improving in all three areas of image production: • Technical - The mechanics of it Creativity - The reason for it Output - The editing and publication of it You will be expected to understand and demonstrate or be willing to learn; Good exposure of photographs Good compositional awareness A range of techniques and styles (L) or specific themed body of work (A) Ability to edit images to a \"reasonable\" standard. Over the course of 12 months, where you will attend six RPS Distinctions classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.com photography-courses, student-photosAlan Ranger14 July 2019Alan Ranger Photographycase-studies, rps-panel, rps distinctions LinkedIn0 Pinterest0",
  "wordCount": 1522,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-anne-watkinson-rps-distinctions#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-anne-watkinson-rps-distinctions#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "RPS Distinctions"
    },
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}