{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/case-study-joyce-james#blogposting",
  "headline": "Case Study - Joyce James shares a photographic journey",
  "alternativeHeadline": "Case Study - Joyce James shares a photographic journey | Alan Ranger Photography",
  "description": "Joyce signed up for her first photography tuition in September 2013. Since then she has remained a repeat customer - see a photographic journey case study.",
  "url": "https://www.alanranger.com/blog-on-photography/case-study-joyce-james",
  "datePublished": "2015-07-18T00:00:00.000Z",
  "dateModified": "2015-07-18T00:00:00.000Z",
  "dateCreated": "2015-07-18T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "CASE STUDY - JOYCE JAMES SHARES A PHOTOGRAPHIC JOURNEYView fullsizeJoyce's make-shift tripodA PHOTOGRAPHIC JOURNEY CASE STUDYJoyce signed up for her first photography tuition in September 2013. Since then she has remained a loyal and repeat customer and has also become a friend to me. Right from the start Joyce didn't try to hide her lack of knowledge of camera operation, composition and making images the way she felt about them. In fact it would be fair to say that she has always been the first to laugh at and question her own images and methods.Joyce knows what she wants to achieve (most of the time) and even when she has not crystallised her thoughts she has always been very open to trying something new even when it doesn't necessarily appeal to her natural subject preferences.Joyce's journey has not been without some hiccups along the way in her image production, but in my view this has been one of her greatest strengths and reasons for such a dramatic progression. She doesn't take herself to seriously and we have always had a good amount of banter between us, in addition it's always been a two way street when it comes feedback and advice, which I have really appreciated.Joyce's persistence to improve is a shining example to anyone wishing to take up photography as a hobby - as I remarked to her about a year ago \"you're hooked\" and she said \"I know and I love it\" - this attitude has led Joyce to travel to many corners of the UK in pursuit of crea eally appreciated.Joyce's persistence to improve is a shining example to anyone wishing to take up photography as a hobby - as I remarked to her about a year ago \"you're hooked\" and she said \"I know and I love it\" - this attitude has led Joyce to travel to many corners of the UK in pursuit of creating images and discovering heart warming moments in those environments.Joyce is currently working on her RPS Panel for Licentiaship distinction - I am enjoying supporting this next stage of her development which followed a great set of images for the Intermediates Course and Intentions Photography Exhibition in 2014.Well done Joyce and thank you for your support, friendship and honesty.----------------------------------------INTERVIEW WITH JOYCE1. WHY DID YOU WANT TO BECOME A PHOTOGRAPHER?I've enjoyed taking photographs for many years – and initially I just wanted to improve. I guess that is still what drives me – but the desire to improve has taken on a much deeper meaning!2. WERE YOU SCARED OR ANXIOUS TO START OUT?No – ignorance is bliss! I had no idea at the outset that it would become such a big part of my life.3. WHY DID YOU SELECT ALAN AS YOUR TUTOR?I bought a Groupon voucher – on a whim.View fullsizeAn early attempt Sep 20134. WHAT WAS YOUR MAIN MOTIVATION TO COMMIT TO ALAN’S COURSE?I was hooked at the Introductory Session. I came home buzzing and couldn't wait to do the next one. I've been like that ever since!5. HOW DO YOU FEEL ALAN’S TEACHING STYLE HAS HELPED DEVELOP YOUR SKILLS THE MOST?He has a very direct and honest style and he completely respects my intelligence – he doesn't do flannel or give false praise. That suits me – he tells me quite candidly what is right or wrong with my efforts and I listen and do my best to learn.He sets high expectations and can be quite demanding – but that's like an unspoken agreement between us. I want to be as good as I can be and he wants that too. I like that he sets the bar high.I should also stress that Alan has a lively sense of humour and the sessions are good fun - we get on well. It wouldn’t work otherwise.6. WHAT ARE THE KEY THINGS ALAN HAS HELPED YOU WITH?I was a complete novice and so I needed to learn all aspects of photography – technical know how, composition, the importance of light – you name it, I'm learning about it!View fullsize7. HOW DO YOU THINK YOU’VE GROWN AS A PHOTOGRAPHER?I’d say I probably scored 1/10 in terms of ability when I started out almost 2 years ago. I'm probably at 6/10 now. I still have a lot to learn. But that's good – if it was easy it wouldn't be nearly as much fun.8. COULD YOU DESCRIBE HOW YOU FELT WHEN YOU WERE FEATURED IN THE INTERMEDIATES PHOTOGRAPHY EXHIBITION?The Opening Night was amazing - my family and friends turned out to support me and I felt proud, excited and somewhat emotional.The exhibition itself was the culmination of a lot of hard work – I was also delighted and relieved that I'd succeeded in getting my panel ready.9. WHAT ARE YOUR AMBITIONS FOR THE FUTURE WITH PHOTOGRAPHY?I don't know – I wouldn't like to put a ceiling on my ambition. I have no intentions of making a career out of it or anything like that – but I certainly intend to be a lot better at it than I am now.View fullsizeMy eye has developed and subject range is much broader than it used to be10. WHAT ADVICE WOULD YOU GIVE OTHERS WHO ARE THINKING OF STARTING PHOTOGR e no intentions of making a career out of it or anything like that – but I certainly intend to be a lot better at it than I am now.View fullsizeMy eye has developed and subject range is much broader than it used to be10. WHAT ADVICE WOULD YOU GIVE OTHERS WHO ARE THINKING OF STARTING PHOTOGRAPHY TUITION OR WHO ARE CURRENTLY STUDYING?I’m not sure that I want to give advice – everyone goes into it for different reasons and with different outcomes in mind and that's good. We're all different after all. Just enjoy it I guess.View fullsizeRecent work----------------------------------------Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.comView fullsizestudent-photos Alan Ranger 18 July 2015case-studies , a photographic journey LinkedIn0 Pinterest0",
  "wordCount": 1099,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-joyce-james#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-joyce-james#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "RPS Distinctions"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    }
  ]
}