{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/case-study-paul-kirby-rps-distinctions#blogposting",
  "headline": "Case Study - Paul Kirby LRPS | RPS Distinctions Panel",
  "alternativeHeadline": "Case Study - Paul Kirby LRPS | RPS Distinctions Panel | Alan Ranger Photography",
  "description": "Paul Kirby shares how he gained his LRPS - RPS Distinctions, the challenges, experience and resulting successful panel with my rps mentoring programme.",
  "url": "https://www.alanranger.com/blog-on-photography/case-study-paul-kirby-rps-distinctions",
  "datePublished": "2019-07-12T00:00:00.000Z",
  "dateModified": "2019-07-12T00:00:00.000Z",
  "dateCreated": "2019-07-12T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "CASE STUDY - PAUL KIRBY LRPS | RPS DISTINCTIONS PANELView fullsizeLRPS PanelPaul Kirby has been a client for the last few years and has participated in a few workshops and courses. This is his journey towards RPS DistinctionsWhen Paul first came to me it was clear that he knew what he wanted to get from my tuition events and he has always been someone who has consciously worked hard to achieve better results.Paul is no stranger to processes and meticulous following of rules and guidelines (previous career) so to large extent he has been easy to teach, providing him with insights, tips and ideas and allowing him to take those away and apply to his photography. As ever, Paul approached this course and challenge in well disciplined, organised and methodical way.Paul had previously completed my Intermediates Intentions course and therefore, had already gained a good working knowledge of the end to end photography workflow of seeing | design | shoot | enhance | share that culminated in a public exhibition of his work. This didn’t mean that he already had a panel of images ready-made for an L panel, but he did understand what it took to produce a body of work that met the RPS’s criteria for a successful distinction award. In addition, Paul understood where he had gaps in his portfolio and stretched himself to take on new techniques to challenge himself and acquire and demonstrate new skills.In many ways, Paul has been very eas o produce a body of work that met the RPS’s criteria for a successful distinction award. In addition, Paul understood where he had gaps in his portfolio and stretched himself to take on new techniques to challenge himself and acquire and demonstrate new skills.In many ways, Paul has been very easy to mentor. He has taken on board advice and critiques and applied my suggestions for edits and interpretations without much input on the how and taken onboard the why without much support. His panel of images demonstrates a very diverse range of techniques, focal lengths and approach, so it was not a surprise to me that the RPS asked to hold on to his successful panel of images to use for their advisory days and website to show to LRPS candidates what a good panel consists of. That request speaks a thousand words in my opinion and for that fact and his successful panel I am very proud of his achievement and progression in awareness and understanding in a relatively short space of time.I am looking forward to the next stage of Paul’s development and when he is ready to take on the step of personal interpretation and innovative image making in his next challenge of an Associate’s RPS Panel.Congratulations Paul, well deserved, easy to mentor and a pleasure to see such great images from you.View fullsizePaul RPS Hanging Plan for LRPS - click to see large----------------------------------------INTERVIEW WITH PAUL1. WHY DID YOU WANT TO GAIN A DISTINCTION WITH THE ROYAL PHOTOGRAPHIC SOCIETY (RPS)?The starting point was four years ago when my interest in becoming a much more proficient amateur photographer was forged. Since then, study, tuition and practice has enhanced my ability and breadth of understanding - through seeing suitable subjects, use of camera, composition, editing and presentation.Beyond identifying personal improvements, I wanted to achieve an externally recognised standard which confirmed a broad level of expertise when judged against other competent photographers.2. Why did you choose Alan to mentor you for a distinction and had you worked with Alan before the RPS Mentoring Course?I have attended other practical and classroom-based courses with Alan who has had a significant influence on my development. In particular, he has helped me pull together several disparate strands of understanding into a much more complete approach to photography.Being familiar with Alan’s style of tuition and support made enrolment on his RPS Mentoring Course an easy decision.3. Describe how you found the RPS Mentoring Classes. The sessions are very relaxed and friendly, with benefit in attending with up to three other delegates. The general review process and critique (of all the delegates work) was very focused and helpful in understanding exactly what was required. The small group allowed for in depth discussion around technical and creative issues which added value when considering your own submissions. Session duration was good; so too the interval between sessions to allow time to develop and improve images.4. Do you feel you got the right level and input of support from the course?Yes5. Did you feel you were already good enough to gain a distinction with the RPS before you started the mentoring course? Before the course – NoDuring the course – Not until the final sessionsAfter the course - Yes6. What distinction did you apply for and were you successful?LRPS – successful7. eel you were already good enough to gain a distinction with the RPS before you started the mentoring course? Before the course – NoDuring the course – Not until the final sessionsAfter the course - Yes6. What distinction did you apply for and were you successful?LRPS – successful7. What was your experience like of the RPS Assessment Day?On the day itself, it was a good experience (although slightly nerve wracking). The RPS staff are very friendly and supportive and the assessment process (of 25 panels in my case) interesting and informative.But there are some important considerations before the day:· Paying a lot of attention to presentation (selection of paper and mounts)· Submitting to an RPS pre-assessment online or Advisory Day· Ensuring that images and associated submission paperwork arrive at RPS at least 14 days before assessment 8. Did you seek independent advice, feedback or input from anywhere else before your panel assessment? Before the final mentoring session, an RPS online assessment was requested. This required the provisionally selected 10 panel images to be forwarded, together with 5 spares, for assessment by one of the RPS judges. Comprehensive and very helpful feedback was received by email in less than a week.Advice was also sought from Permajet about paper selection to ensure that all the panel images presented well on a single paper. A one-to-one with one of their representatives was very helpful. 9. Having completed the course and Distinction Assessment, what advice would you like to share with others?In selecting images, it is easy to introduce a personal bias towards your favourites without necessarily considering flaws or technical benefits.An independent and sometimes robust critique adds valuable input to ensure that both image selection and presentation of panel as a whole is as good as possible. 10. What was the hardest part of gaining a distinction with the RPS and why?While it was challenging to select the very best individual images, the hardest part of the process was compiling the panel to ensure that images were complementary, balanced in colour, tone and composition, and sufficiently diverse to demonstrate a range of photographic skills and techniques.At the RPS Assessment, the judges paid a good deal of attention to the panel presentation as a whole (including use of paper and mounts), before examining individual images in considerable detail.An interesting comment made by one of the judges was their interest in distinguishing between photographers who simply ‘take’ photographs from those who ‘make’ an impressive composition.11. Has working for a distinction helped you progress as a photographer?Yes – compared with four years ago, I am ‘taking’ far less photographs now but my success rate in ‘making’ decent compositions is much better.12. Any other comments you would like to add.Thank you Alan for all your help and support.----------------------------------------Click on images to see full screenView fullsize View fullsize View fullsize Vi VKV/01+Craster.jpg]View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize ----------------------------------------If you are interested in attaining a distinction with the RPS I can support you with my RPS Mentoring Course .RPS Mentoring Course SUMMARY- PRODUCE A PANEL OF IMAGES FOR ASSESSMENT * COVENTRY * EVENING CLASS - 19:00 - 21:00. SIX CLASSES, YOU CHOOSE DATES, WITHIN TWELVE MONTH PERIOD TO SUIT * OR OPTION TO DO ONLINE WITH SKYPE AND SCREEN SHARING WITH DATES/TIMES TO SUIT YOU. (1HR PER SESSION) * FROM £395HAVING SUPPORTED MANY CLIENTS THROUGH A JOURNEY OF DEVELOPMENT AND IMPROVEMENT, WITH THEIR PHOTOGRAPHY, OVER THE PAST FEW YEARS, THIS MENTORING COURSE IS FOR THOSE WHO ARE ALREADY TECHNICALLY COMPETENT (OR AT LEAST ARE ON THE PATH TO MASTERING IT) AND ARE ABLE TO DEMONSTRATE GOOD DESIGN AND COMPOSITION IN THEIR PHOTOGRAPHY.You are not expected to be a master or even polished to attend. This course is to help support you in improving in all three areas of image production: * Technical - The mechanics of it * Creativity - The reason for it * Output - The editing and publication of itYou will be expected to understand and demonstrate or be willing to learn; * Good exposure of photographs * Good compositional awareness * A range of techniques and styles (L) or specific themed body of work (A) * Ability to edit images to a \"reasonable\" standard.Over the course of 12 months, where you will participate in six classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS----------------------------------------Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier an you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.comView fullsizephotography-courses , student-photos Alan Ranger 12 July 2019Alan Ranger Photography case-studies , rps-panel , rps distinctions LinkedIn0 Pinterest0",
  "wordCount": 1735,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-paul-kirby-rps-distinctions#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-paul-kirby-rps-distinctions#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "RPS Distinctions"
    },
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    }
  ]
}