{
  "@context": "https://schema.org",
  "@graph": [
    {
      "@type": "WebPage",
      "@id": "https://www.alanranger.com/blog-on-photography/case-study-max-dobres-rps-distinctions#webpage",
      "url": "https://www.alanranger.com/blog-on-photography/case-study-max-dobres-rps-distinctions",
      "name": "Case Study - Max Dobres - LRPS | RPS Distinctions Panel",
      "description": "View fullsizeMaxim Dobres Distinctions Hanging PlanRPS OR ME UP MY IN 2021.WE A IN 2021 ’S AT.",
      "inLanguage": "en-GB",
      "isPartOf": {
        "@id": "https://www.alanranger.com#website"
      },
      "primaryImageOfPage": {
        "@id": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1650368583558-98S9EK26POGQK7Z6SP6F/-Maxim%2BDobres%2BLRPS%2BHanging%2BPlan-Max%2BDobres%2BLRPS.jpg"
      }
    },
    {
      "@type": "BreadcrumbList",
      "@id": "https://www.alanranger.com/blog-on-photography/case-study-max-dobres-rps-distinctions#breadcrumb",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://www.alanranger.com"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Blog",
          "item": "https://www.alanranger.com/blog-on-photography"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Case Study - Max Dobres - LRPS | RPS Distinctions Panel",
          "item": "https://www.alanranger.com/blog-on-photography/case-study-max-dobres-rps-distinctions"
        }
      ]
    },
    {
      "@type": "BlogPosting",
      "@id": "https://www.alanranger.com/blog-on-photography/case-study-max-dobres-rps-distinctions#blogposting",
      "headline": "Case Study - Max Dobres - LRPS | RPS Distinctions Panel",
      "alternativeHeadline": "Case Study - Max Dobres - LRPS | RPS Distinctions Panel | Alan Ranger Photography",
      "description": "View fullsizeMaxim Dobres Distinctions Hanging PlanRPS OR ME UP MY IN 2021.WE A IN 2021 ’S AT.",
      "url": "https://www.alanranger.com/blog-on-photography/case-study-max-dobres-rps-distinctions",
      "mainEntityOfPage": {
        "@type": "WebPage",
        "@id": "https://www.alanranger.com/blog-on-photography/case-study-max-dobres-rps-distinctions#webpage"
      },
      "datePublished": "2022-04-24T00:00:00+00:00",
      "dateCreated": "2022-04-24T00:00:00+00:00",
      "dateModified": "2022-04-24T00:00:00+00:00",
      "inLanguage": "en-GB",
      "articleBody": "CASE STUDY - MAX DOBRES - LRPS | RPS DISTINCTIONS PANELView fullsizeMaxim Dobres LRPS RPS Distinctions Hanging PlanRPS DISTINCTIONSMAX HAD NOT ATTENDED ANY EVENTS OR WORKED WITH ME BEFORE SIGNING UP FOR MY RPS DISTINCTIONS COURSE IN NOVEMBER 2021.WE STARTED A CONVERSATION IN SEPTEMBER 2021 AFTER MAX’S FIRST ATTEMPT AT THE LRPS HAD FAILED. UPON REVIEWING THAT SUBMISSION, I UNDERSTOOD WHY IT HADN’T MET THE CRITERIA, SO I OFFERED TO HELP HIM CREATE A PANEL OF IMAGES THAT I FELT WOULD BE TO THE STANDARD REQUIRED.I hadn’t anticipated that Max would complete the task with such speed and determination to be awarded his Licentiate distinction just five/six months after his first RPS mentoring class. More amazing is that only two or three images remained in his final panel from the original failed submission.Max used a mixture of group RPS mentoring classes and online 1-2-1 Zoom sessions with me to reach this rapid turnaround. The sessions concentrated on image selection, editing and how to analyse an image and every element in meticulous detail. Max also took my advice about printing, and using a professional print lab to ensure print quality was not a factor. He used One Vision Imaging Ltd , who supported him with the choice of paper and several test prints before the final panel production.Max’s successful panel demonstrates the range of subject matter, technique, perspective and photogr rint quality was not a factor. He used One Vision Imaging Ltd , who supported him with the choice of paper and several test prints before the final panel production.Max’s successful panel demonstrates the range of subject matter, technique, perspective and photographer’s input required to meet the standard of an L with the RPS. The panel layout is balanced with tonality, colour, visual weight and capturing moments. Max has an eye for imagery, whether it be stratospheric with his Astrophotography to the micro of dials inside an engine, and then showing empathy with his portraits and captured moments.Congratulations Max; I was confident you would pass with your new panel, and I look forward to you starting your next steps into developing your photography further with projects on subjects that may take you to your Associate distinction.----------------------------------------INTERVIEW WITH MAX GOING FOR HIS RPS DISTINCTIONS1. WHY DID YOU WANT TO GAIN A DISTINCTION WITH THE ROYAL PHOTOGRAPHIC SOCIETY (RPS)?I wanted to improve my general photography and applying for the Licentiate with its clear criteria provided a structured approach and a goal to aim for.2. WHY DID YOU CHOOSE ALAN TO MENTOR YOU FOR A DISTINCTION AND HAD YOU WORKED WITH ALAN BEFORE THE RPS MENTORING COURSE?I had not worked with Alan before and choose him from a list of candidates from Google. I was looking for someone who was well qualified and who was focused on the RPS distinction pathway. Alan’s claim to get all candidates through the Licentiate was reassuring. 3. DESCRIBE HOW YOU FOUND THE RPS MENTORING CLASSES. I used a mixture of classes and individual mentoring. This enabled me to learn from the experience of others but also concentrate on my portfolio. 4. DO YOU FEEL YOU GOT THE RIGHT LEVEL AND INPUT OF SUPPORT FROM THE COURSE?Yes, I got from the course exactly what I needed, by building my learning around my images and what they revealed about my strengths and needs for improvement. 5. Did you feel you were already good enough to gain a distinction with the RPS before you started the mentoring course? I contacted Alan after I failed my first assessment with the RPS. I understood why images did not meet the RPS criteria but needed an experienced eye to guide me on how I should improve.6. WHAT DISTINCTION DID YOU APPLY FOR AND WERE YOU SUCCESSFUL?I applied for the Licentiate and after Alan’s mentoring my images sailed through the assessment. 7. WHAT WAS YOUR EXPERIENCE LIKE OF THE RPS ASSESSMENT DAY?The Assessment Day was very successful. The judges gave me lots of positive feedback.8. DID YOU SEEK INDEPENDENT ADVICE, FEEDBACK OR INPUT FROM ANYWHERE ELSE BEFORE YOUR PANEL ASSESSMENT? I used my local camera club, but it would not have been reasonable to expect the same time commitment I got from Alan 9. HAVING COMPLETED THE COURSE AND DISTINCTION ASSESSMENT, WHAT ADVICE WOULD YOU LIKE TO SHARE WITH OTHERS?To be successful in the assessment you need to understand the RPS criteria in detail and have the advice of someone who knows what this means in practise 10. WHAT WAS THE HARDEST PART OF GAINING A DISTINCTION WITH THE RPS AND WHY?It was not hard as long as you listened to exactly what Alan said and put it into practice. 11. HAS WORKING FOR A DISTINCTION HELPED YOU PROGRESS AS A PHOTOGRAPHER?I feel my overall standard has gone up a level from interested amateur to a T PART OF GAINING A DISTINCTION WITH THE RPS AND WHY?It was not hard as long as you listened to exactly what Alan said and put it into practice. 11. HAS WORKING FOR A DISTINCTION HELPED YOU PROGRESS AS A PHOTOGRAPHER?I feel my overall standard has gone up a level from interested amateur to a competent photographer with still much to learn. 12. ANY OTHER COMMENTS YOU WOULD LIKE TO ADD.I valued Alans direct style. He told me exactly what I needed to do to get my images to the standard required by the RPS. You need to leave your ego at the door and listen.----------------------------------------Click on images to see full screenMaxim Dobres RPS Distinctions Hanging PlanView fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize ----------------------------------------If you are interested in attaining a distinction with the RPS I can support you with my Royal Photographic Society Distinctions Mentoring RPS Mentoring Course SUMMARY - RPS DISTINCTIONS- PRODUCE A PANEL OF IMAGES FOR AN RPS DISTINCTIONS QUALIFICATION * ZOOM - ONLINE / OR COVENTRY * EVENING CLASS - 19:00 - 21:00. SIX CLASSES, YOU CHOOSE DATES, WITHIN A TWELVE-MONTH PERIOD TO SUIT * DO ONLINE WITH ZOOM AND SCREEN SHARING OR ATTEND IN PERSON AT COVENTRY ONCE COVID RESTRICTIONS ALLOW. * FROM £395HAVING SUPPORTED MANY CLIENTS THROUGH A JOURNEY OF DEVELOPMENT AND IMPROVEMENT WITH THEIR PHOTOGRAPHY OVER THE PAST FEW YEARS, THIS RPS DISTINCTIONS MENTORING COURSE IS FOR THOSE WHO ARE ALREADY TECHNICALLY COMPETENT (OR AT LEAST ARE ON THE PATH TO MASTERING IT) AND ARE ABLE TO DEMONSTRATE GOOD DESIGN AND COMPOSITION IN THEIR PHOTOGRAPHY.You are not expected to be a master or even polished to attend. This course is to help support you in improving in all three areas of image production: * Technical - The mechanics of it * ON THE PATH TO MASTERING IT) AND ARE ABLE TO DEMONSTRATE GOOD DESIGN AND COMPOSITION IN THEIR PHOTOGRAPHY.You are not expected to be a master or even polished to attend. This course is to help support you in improving in all three areas of image production: * Technical - The mechanics of it * Creativity - The reason for it * Output - The editing and publication of itYou will be expected to understand and demonstrate or be willing to learn; * Good exposure of photographs * Good compositional awareness * A range of techniques and styles (L) or specific themed body of work (A) * Ability to edit images to a \"reasonable\" standard.Over the course of 12 months, where you will attend six RPS Distinctions classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS----------------------------------------Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.comView fullsizephotography-courses , student-photos Alan Ranger 24 April 2022Alan Ranger Photography case-studies , rps-panel , rps distinctions LinkedIn0 Pinterest0",
      "wordCount": 1398,
      "timeRequired": "PT7M",
      "readingTime": "PT7M",
      "genre": "Photography Case Study",
      "articleSection": "RPS Distinctions",
      "keywords": [
        "case-studies",
        "rps-panel",
        "rps distinctions"
      ],
      "learningResourceType": "CaseStudy",
      "educationalLevel": "Intermediate",
      "proficiencyLevel": "Intermediate",
      "typicalAgeRange": "18-99",
      "educationalUse": "Learning",
      "estimatedCost": {
        "@type": "MonetaryAmount",
        "currency": "GBP",
        "value": "0"
      },
      "audience": {
        "@type": "EducationalAudience",
        "educationalRole": "Photographer",
        "audienceType": "Student"
      },
      "educationalAlignment": {
        "@type": "AlignmentObject",
        "alignmentType": "educationalFramework",
        "educationalFramework": "Photography Skills",
        "targetName": "Intermediate"
      },
      "about": [
        {
          "@type": "Thing",
          "name": "Royal Photographic Society"
        },
        {
          "@type": "Thing",
          "name": "RPS Distinctions"
        },
        {
          "@type": "Thing",
          "name": "Exposure (photography)"
        },
        {
          "@type": "Thing",
          "name": "Photographic composition"
        }
      ],
      "mentions": [
        {
          "@type": "Thing",
          "name": "RPS"
        }
      ],
      "hasPart": [],
      "image": {
        "@type": "ImageObject",
        "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1650368583558-98S9EK26POGQK7Z6SP6F/-Maxim%2BDobres%2BLRPS%2BHanging%2BPlan-Max%2BDobres%2BLRPS.jpg",
        "width": 1500,
        "height": 1000,
        "caption": "Case Study - Max Dobres - LRPS | RPS Distinctions Panel"
      },
      "thumbnailUrl": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1650368583558-98S9EK26POGQK7Z6SP6F/-Maxim%2BDobres%2BLRPS%2BHanging%2BPlan-Max%2BDobres%2BLRPS.jpg",
      "primaryImageOfPage": {
        "@id": "https://www.alanranger.com/blog-on-photography/case-study-max-dobres-rps-distinctions#webpage"
      },
      "speakable": {
        "@type": "SpeakableSpecification",
        "xpath": [
          "/html/head/title",
          "//h1"
        ],
        "cssSelector": [
          "h1",
          ".intro"
        ]
      },
      "discussionUrl": "https://www.alanranger.com/blog-on-photography/case-study-max-dobres-rps-distinctions#comments",
      "author": {
        "@type": "Person",
        "@id": "https://www.alanranger.com/#alanranger",
        "name": "Alan Ranger",
        "url": "https://www.alanranger.com/about-alan-ranger",
        "jobTitle": "Photographer & Photography Educator",
        "sameAs": [
          "https://www.alanranger.com",
          "https://www.linkedin.com/in/alanrangerphotography"
        ]
      },
      "publisher": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography",
        "url": "https://www.alanranger.com",
        "logo": {
          "@type": "ImageObject",
          "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/b859ad2b-1442-4595-b9a4-410c32299bf8/ALAN+RANGER+photography+LOGO+BLACK.+switched+small.png?format=1500w",
          "width": 300,
          "height": 100
        }
      },
      "isPartOf": {
        "@type": "WebSite",
        "@id": "https://www.alanranger.com/#website"
      },
      "copyrightHolder": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography"
      },
      "copyrightYear": 2022,
      "sameAs": [
        "https://www.alanranger.com/blog-on-photography"
      ],
      "relatedLink": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "subjectOf": {
        "@type": "Blog",
        "@id": "https://www.alanranger.com/blog-on-photography#blog"
      },
      "isRelatedTo": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "citation": "Royal Photographic Society",
      "backstory": "CASE STUDY - MAX DOBRES - LRPS | RPS DISTINCTIONS PANELView fullsizeMaxim Dobres LRPS RPS Distinctions Hanging PlanRPS DISTINCTIONSMAX HAD NOT ATTENDED ANY EVENTS OR WORKED WITH ME BEFORE SIGNING UP FOR MY RPS DISTINCTIONS COURSE IN NOVEMBER 2021.",
      "funding": {
        "@type": "MonetaryGrant",
        "funder": {
          "@type": "Organization",
          "name": "Alan Ranger Photography"
        }
      },
      "interactionStatistic": {
        "@type": "InteractionCounter",
        "interactionType": "https://schema.org/CommentAction",
        "userInteractionCount": 0
      },
      "commentCount": 0
    }
  ]
}