{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/case-study-chris-shaw#blogposting",
  "headline": "Case Study - Chris Shaw - Client A Photographic Journey",
  "alternativeHeadline": "Case Study - Chris Shaw - Client A Photographic Journey | Alan Ranger Photography",
  "description": "A Photographic Journey Case Study Chris Shaw first signed up photography tuition with me in Oct 2013, initially, he joined the on-line mentoring programme.",
  "url": "https://www.alanranger.com/blog-on-photography/case-study-chris-shaw",
  "datePublished": "2020-04-15T00:00:00.000Z",
  "dateModified": "2020-04-15T00:00:00.000Z",
  "dateCreated": "2020-04-15T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Case Study - Chris Shaw - Client A Photographic Journey A Photographic Journey Case Study Chris Shaw first signed up photography tuition with me in Oct 2013, initially, he joined the on-line mentoring programme and after some initial attempts at assignments that proved challenging for him, he soon started to show a flair for image making. Chris continued with mentoring for a year and then went onto have some 1-2-1 private tuition, attend a workshop and the Adobe Lightroom Course. By the end of 2014 he was exhibiting and selling his images produced from the Intermediates Course in a high street gallery in Leamington Spa. Chris is a testament to the proverb try try and try again... He never seems to be deterred by the fact that he knows he doesn't know how to do it all yet or that his own images do not meet the high standards he wants to achieve. Being his own harshest critique has meant that Chris has worked hard to improve and despite that he sometimes lacks self belief he never lets this become a barrier to experimenting with new techniques and ideas. In my view, his work has shown a dramatic improvement over the last 18 months and he has quickly reached the level of a proficient photographer with images that are now starting to develop into photos of personal expression and art. Well done Chris, you have been pleasure to teach and support and I look forward to more excellent images from you in the months and years to come. Interview with Chris 1. Why did you want to become a photographer?It was something that I had an interest in when I was a teenager at sixth form college but unfortunately, other things took over and became a priority. It was always something I wanted and knew I would come back to later in life so I'm happy that I'm now finding time to devote to it. 2. Were you scared or anxious to start out?Not to start learning and using my camera but definitely scared and anxious when it came to sharing my images. I have always dealt with and am more comfortable with facts and figures so doing something creative and putting yourself out there to be critiqued in a subjective environment was something very alien to me and initially not that enjoyable but I think if you can take the “what the hell” approach and let people comment, then the feedback is invaluable in getting you to the next stage. 3. Why did you select Alan as your tutor?I was referred by a colleague who had attended his intro course and he sent me the link to his website. His images were just inspiring, typically in the genre that most interested me and of a quality that I could only dream of achieving. The fact that he was also relatively local was an added bonus. View fullsize One of the first images I put on Flickr August 2013 – What was I thinking!! 4. What was your main motivation to commit to Alan’s tuition?I was getting frustrated both with the quality of my images and also that I wanted to go out and use my camera but was lacking direction and intention of what I wanted to shoot. The monthly mentoring changed my way of thinking and gave me a clear vision of what to do. It may not always have been in a genre that I enjoy or was comfortable with but that was still so much better that my previous wishy-washy approach. 5. What type of tuition have you had from Alan? • Monthly Mentoring Lightroom Post Processing Intermediates Course One to One Workshops Critique Masterclass 6. How do you feel Alan’s teaching style has helped develop your skills the most?In the nicest possible way he is brutally honest. Sometimes it’s not what you want to hear but it’s the only way to learn. That aside he still make you feel relaxed and at ease, enjoys the banter with the groups and is not above taking on-board student comments and working with them in areas where he himself is not quite so comfortable. His love of photography and what he does is infectious to be around. 7. What are the key things Alan has helped you with?Probably the main one is composition and I’ve still got so much to learn as it’s definitely my weak spot and the element that I constantly fight with!Being able to critique you own images and understanding what you have struggled to correct post process so you know what to look for next time you go out to shoot or how you should change your workflow to accommodate avoiding the same mistakes. gradual improvement 8. How do you think you've grown as a photographer?I'm still miles away from where I want to be and I think it’s easy to convince yourself sometimes that you haven’t actually come that far but if I wasactually honest with myself and less self-critical then I would probably have to accept that I’m proud of what I have accomplished in a relatively short space of time. I rarely shoot without having a clear vision of what I'm trying to achieve, my hit rate(although still poor) is definitely improving, my confidence to share image has grown and my mind set to accept, understand and absorb the critique of my images to help me improve has completely changed for the better. 9. Could you describe how you felt when you were featured in the intermediates photography exhibition?Nervous but excited none the less! I guess it goes back to the confidence to put yourself out there to share you images. I had invited friend, family and colleagues to the opening night so I didn't know how they would react but in hind sight overwhelmed by their positivity and support. One from the Intermediates Exhibition – November 2014 10. What are your ambitions for the future with photography?Keep enjoying it, keep learning and keep improving! I have started working toward my “L” panel to be assessed by the institute which if successful will give me a formal photography qualification.I'm not at the stage yet where I want to pigeon hole myself to a specific genre as I still enjoy messing about and experimenting with different things but eventually, consciously or unconsciously, creating my own style so that my images are instantly recognisable would be great. 11. What advice would you give others who are thinking of starting photography tuition or who are currently studying?Go for it / keep going! It’s so rewarding when it all comes together and you produce an image that you are proud to share.It’s also been a great way of meeting new friends with the same interest to go out and shoot with and discuss new ideas. 12. Any other comments: Yeah, be prepared to be bitten by the bug and be prepared for the bank balance to take a beating – (Cost of the equipment that is and clearly not the cost of Alan’s tuition!) Things I currently like messing around with…. April 2015 Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.com Think outside the box and stretch yourself to the next level. student-photosAlan Ranger15 April 2020Solihullcase-studies, a photographic journey LinkedIn0 Pinterest0",
  "wordCount": 1322,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-chris-shaw#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-chris-shaw#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}