{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/case-study-jacki-rosin#blogposting",
  "headline": "Case Study - Jacki Rosin - Client A Photographic Journey",
  "alternativeHeadline": "Case Study - Jacki Rosin - Client A Photographic Journey | Alan Ranger Photography",
  "description": "Jacki Rosin has been with me since 2013 - read this case study to see how much Jacki has improved her photography with tutoring and a photographic journey.",
  "url": "https://www.alanranger.com/blog-on-photography/case-study-jacki-rosin",
  "datePublished": "2020-06-28T00:00:00.000Z",
  "dateModified": "2020-06-28T00:00:00.000Z",
  "dateCreated": "2020-06-28T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "CASE STUDY - JACKI ROSIN - CLIENT A PHOTOGRAPHIC JOURNEYA PHOTOGRAPHIC JOURNEY CASE STUDYJacki Rosin first signed up photography tuition with me in April 2013. Initially she joined a 3hr introductory class and followed up with the 4 week extended beginner's course before enrolling on the on-line mentoring programme which she has been doing for 18 months now. Jackie has completed a mixture of practical workshops and classroom based tuition to improve her photo making and editing skills. Jacki has improved her ability to design photo compositions, execute the camera settings and put the final touches to images in Lightroom over the last 2 years. Her journey has been a steady one but has shown a significant step up in the standard and quality of her work in the last 9 months. Her work has featured most month's in the mentoring assignment blogs, showing she clearly works hard with each new challenge. I hope Jacki, won't mind me sharing this, and I know many people who are similar, but she doesn't always accept that her work is good enough as she has given herself a challenging level of quality to achieve, this, with her sometimes lack of confidence means that she has been pushed outside her comfort zone on a frequent basis with photography - but what better testament to the results can I make than her inspiring panel of images that she produced for the Intermediates Course and public exhibition of her work.Well done Jacki, always a pleasure to tutor and support en pushed outside her comfort zone on a frequent basis with photography - but what better testament to the results can I make than her inspiring panel of images that she produced for the Intermediates Course and public exhibition of her work.Well done Jacki, always a pleasure to tutor and support your photography and I look forward to the next stage of your development.View fullsizeJacki Rosin - Intermediates Panel of Exhibition Images----------------------------------------INTERVIEW WITH JACKI1. WHY DID YOU WANT TO BECOME A PHOTOGRAPHER?I’d always had an interest, which I think comes from my Dad, but had only ever owned a compact camera. When I realised what you could achieve with a DSLR once it was out of the auto mode I was determined to learn how to use it to its full potential2. WERE YOU SCARED OR ANXIOUS TO START OUT?The answer to that has to be yes! Not so much in terms of learning and getting to grips with different technical ideas and managing my camera, but definitely when it came to showing my images and getting feedback from the rest of the group, which was really scary for the first few sessions.3. WHY DID YOU SELECT ALAN AS YOUR TUTOR?I attended a 3 hour introductory session and was inspired by both Alan’s images and his method of teaching, which is both relaxed and informativeView fullsizeSep 2012 - room for improvement at the start of the journey4. WHAT WAS YOUR MAIN MOTIVATION TO COMMIT TO ALAN’S TUITION?Prior to meeting Alan I had done an 8 week beginners course and had come away feeling quite despondent, in that, the group was large and there seemed to be no structure to the sessions. I really didn't feel I had achieved anything. Alan’s course was totally different. The group was small and each one of us had personal attention therefore ensuring our individual requirements were met, whatever stage of photography we were at.5. WHAT TYPE OF TUITION HAVE YOU HAD FROM ALAN? * 5 Week Beginners Course * Post Processing Lightroom Course * Several location workshops * On-line Mentoring * Intermediates Photography Course * Masterclasses6. HOW DO YOU FEEL ALAN’S TEACHING STYLE HAS HELPED DEVELOP YOUR SKILLS THE MOST?Alan doesn't beat about the bush when it comes to giving feedback on your images! Having said that, all feedback is both honest and constructive and that is the only way to learn. That, combined with a relaxed (honest!) atmosphere makes for an enjoyable learning experience with plenty of banter flying about. The odd glass of wine thrown in helps too!View fullsizeA step up in quality of composition and technical execution7. WHAT ARE THE KEY THINGS ALAN HAS HELPED YOU WITH?The main one is to have a vision of what you want to convey to others with your photograph, both visually and emotionally. Also the importance of good composition. I now take time to think about how I really want the image to look.8. HOW DO YOU THINK YOU’VE GROWN AS A PHOTOGRAPHER?I have definitely improved from a technical point of view and am happy with using my camera, which in turn allows me to be more creative with my photography. The mentoring scheme often takes me out of my comfort zone when it comes to meeting Alan’s assignments, but this encourages me to try new ideas.9. COULD YOU DESCRIBE HOW YOU FELT WHEN YOU WERE FEATURED IN THE INTERMEDIATES PHOTOGRAPHY EXHIBITION?A combination of utter terror and excitement of having my images on di en takes me out of my comfort zone when it comes to meeting Alan’s assignments, but this encourages me to try new ideas.9. COULD YOU DESCRIBE HOW YOU FELT WHEN YOU WERE FEATURED IN THE INTERMEDIATES PHOTOGRAPHY EXHIBITION?A combination of utter terror and excitement of having my images on display in a public gallery. However the opening night was great and we all had positive comments from both friends and complete strangers.View fullsizeResting - one of Jacki's emotive flower images from her exhibition panel10. WHAT ARE YOUR AMBITIONS FOR THE FUTURE WITH PHOTOGRAPHY?I still have a long way to go before I achieve the really high standard I would like to be at, but I will keep learning and practicing, but above all continue to enjoy it.11. WHAT ADVICE WOULD YOU GIVE OTHERS WHO ARE THINKING OF STARTING PHOTOGRAPHY TUITION OR WHO ARE CURRENTLY STUDYING?You definitely need determination to just keep trying. I’ve hit the delete button more times than not, but when a shot works on all levels it is something to be proud of.12. ANY OTHER COMMENTS:You just need lots of enthusiasm to learn, rather than the latest camera on the market.----------------------------------------Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.comView fullsizePhotographic Journey of Developmentstudent-photos Alan Ranger 28 June 2020case-studies , a photographic journey LinkedIn0 Pinterest0",
  "wordCount": 1154,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-jacki-rosin#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-jacki-rosin#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}