{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/case-study-jacki-rosin-rps-distinctions#blogposting",
  "headline": "Case Study - Jacki Rosin ARPS | RPS Distinctions Panel",
  "alternativeHeadline": "Case Study - Jacki Rosin ARPS | RPS Distinctions Panel | Alan Ranger Photography",
  "description": "Jacki Rosin shares how she gained her ARPS - RPS Distinctions, the challenges, experience and resulting successful panel with my RPS mentoring sessions.",
  "url": "https://www.alanranger.com/blog-on-photography/case-study-jacki-rosin-rps-distinctions",
  "datePublished": "2019-10-20T00:00:00.000Z",
  "dateModified": "2019-10-20T00:00:00.000Z",
  "dateCreated": "2019-10-20T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "CASE STUDY - JACKI ROSIN ARPS | RPS DISTINCTIONS PANELView fullsizeJacki Rosin ARPS PanelRPS DistinctionsJacki has been a client from the early days of me starting photography tuition as a full time profession, about 8 years ago. was delighted when she gave in to my persuasion to go for RPS distinctionsJacki attended my beginners photography and Lightroom courses some years ago and followed up on those with doing the Intentions Photography Course which ended in a public exhibition in 2015.Jacki’s project for Intentions was still life floral shots so having taken her idea through to exhibition with a good range of superb shots it was an easy transition (easy for me, not for her) to take this to the next level to produce fifteen shots worthy of a the Associate Distinction with the RPS. I am not entirely sure how many of the original shots from her Intentions course remain in the final panel but importantly the work completed then and further development of the concept has culminated in a successful A panel a few years later.I am particularly happy with this, the second successful A panel this month, because Jacki had some bad news to deal with a several months ago and understandably wasn’t motivated to carry on, but with a little arm twisting (something I always have to do with Jacki) she thankfully continued and has now been rewarded, rightly so, with this recognition and achievement of her creative photography skills.I a to deal with a several months ago and understandably wasn’t motivated to carry on, but with a little arm twisting (something I always have to do with Jacki) she thankfully continued and has now been rewarded, rightly so, with this recognition and achievement of her creative photography skills.I am sure Jacki would confirm that sometimes having a focus when other, more important, things are occupying your mind that photography can be a great outlet. It has always been a pleasure to mentor and tutor Jackie in all aspects of photography and I am also proud to call her a friend too. Jackie has been a great supporter of my business, the Facebook Forum and the charitable photography activities we have worked on together over the years. Thank you for your custom, friendship and support and I wish you every success in your ongoing photography development, health and happiness.View fullsizeJacki RPS Hanging Plan for ARPS - click to see large----------------------------------------Jacki Rosin STATEMENT OF INTENT > Apart from photography, I have two other major interests - flowers and painting. This panel represents a combination of all three.> > The flowers are positioned as botanical specimens, but I wanted to interpret them in a creative style.> > By focus stacking certain elements of each flower and leaving some areas to fall out of focus I have attempted to concentrate attention to specific areas.> > This effect is intensified by overlaying textures in post-processing, which softens part of each image, thus giving more of an impression of a painting.> > Brushing away the textures in varying degrees retains the shape, form and fine details of each image, allowing complex structures within the flowers to be clearly appreciated> > The muted tones and pastel colours of the textures I have applied hopefully bring cohesion to the panel and a balance of light to enhance the beauty of the flowers. Word Count 150 ----------------------------------------INTERVIEW WITH JACKI FOLLOWING HER RPS DISTINCTIONS ACHIEVEMENT1. WHY DID YOU WANT TO GAIN A DISTINCTION WITH THE ROYAL PHOTOGRAPHIC SOCIETY (RPS)?To be honest, I had not thought about doing a distinction, but once Alan had suggested the idea I thought that having such a goal to reach would help me develop my photography2. WHY DID YOU CHOOSE ALAN TO MENTOR YOU FOR A DISTINCTION AND HAD YOU WORKED WITH ALAN BEFORE THE RPS DISTINCTIONS MENTORING COURSE?Alan has mentored me over the last few years. I respect his advice. 3. DESCRIBE HOW YOU FOUND THE RPS DISTINCTIONS MENTORING CLASSES. The classes were very helpful in that not only did you have your own work looked at in detail but you were also able to see how others were progressing. Everyone collaborated ideas and suggestions, so there was a lot of support and feedback, not just from Alan but from others on the same journey 4. DO YOU FEEL YOU GOT THE RIGHT LEVEL AND INPUT OF SUPPORT FROM THE COURSE?Yes, definitely 5. Did you feel you were already good enough to gain a distinction with the RPS before you started the mentoring course? No, but I don’t think Alan would have contemplated the idea if he didn’t think I had some potential6. WHAT DISTINCTION DID YOU APPLY FOR AND WERE YOU SUCCESSFUL?ARPS and yes. 7. WHAT WAS YOUR EXPERIENCE LIKE OF THE RPS ASSESSMENT DAY?I attended an RPS advisory day about halfway into the course and my panel changed contemplated the idea if he didn’t think I had some potential6. WHAT DISTINCTION DID YOU APPLY FOR AND WERE YOU SUCCESSFUL?ARPS and yes. 7. WHAT WAS YOUR EXPERIENCE LIKE OF THE RPS ASSESSMENT DAY?I attended an RPS advisory day about halfway into the course and my panel changed quite a lot as a result. I then applied for online advice when I felt that I was almost ready to be assessed. Again a few tweaks but it helped to consolidate my panel8. DID YOU SEEK INDEPENDENT ADVICE, FEEDBACK OR INPUT FROM ANYWHERE ELSE BEFORE YOUR PANEL ASSESSMENT? I attended an advisory day before my assessment, which I found really useful. I had my prints professionally printed and mounted and sought their advice on suitable papers and mounts to use. 9. HAVING COMPLETED THE COURSE AND DISTINCTION ASSESSMENT, WHAT ADVICE WOULD YOU LIKE TO SHARE WITH OTHERS?You have to be prepared to put in a lot of time and effort. Sometimes it’s difficult to keep the enthusiasm going, especially when images are rejected, but eventually, you will see your panel beginning to come together 10. WHAT WAS THE HARDEST PART OF GAINING A DISTINCTION WITH THE RPS AND WHY?Producing 15 images that were varied enough for the judges, but that also worked cohesively to produce a panel 11. HAS WORKING FOR A DISTINCTION HELPED YOU PROGRESS AS A PHOTOGRAPHER?Yes. 12. ANY OTHER COMMENTS YOU WOULD LIKE TO ADD.It’s a great sense of achievement when you pass----------------------------------------Click on images to see full screenView fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize ----------------------------------------If you are interested in attaining a distinction with the RPS I can support you with my Distinction with the RPS Course RPS Mentoring Course SUMMARY- PRODUCE A PANEL OF IMAGES FOR AN RPS DISTINCTIONS QUALIFICATION * COVENTRY * EVENING CLASS - 19:00 - 21:00. SIX CLASSES, YOU CHOOSE DATES, WITHIN TWELVE MONTH PERIOD TO SUIT * OR OPTION TO DO ONLINE WITH SKYPE AND SCREEN SHARING WITH DATES/TIMES TO SUIT YOU. (1HR PER SESSION) * FROM £395HAVING SUPPORTED MANY CLIENTS THROUGH A JOURNEY OF DEVELOPMENT AND IMPROVEMENT, WITH THEIR PHOTOGRAPHY, OVER THE PAST FEW YEARS, THIS MENTORING COURSE IS FOR THOSE WHO ARE ALREADY TECHNICALLY COMPETENT (OR AT LEAST ARE ON THE PATH TO MASTERING IT) AND ARE ABLE TO DEMONSTRATE GOOD DESIGN AND COMPOSITION IN THEIR PHOTOGRAPHY.You are not expected to be a master or even polished to attend. This RPS Distinctions course is to help support you in improving in all three areas of image production: * Technical - The mechanics of it * Creativity - The reason for it * Output - The editing and publication of itYou will be expected to understand and demonstrate or be willing to learn; * Good exposure of photographs * Good compositional awareness * A range of techniques and styles (L) or specific themed body of work (A) * Ability to edit images to a \"reasonable\" standard.Over the course of 12 months, where you will attend six RPS Distinctions classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS----------------------------------------Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.comView fullsizephotography-courses , student-photos Alan Ranger 20 October 2019Alan Ranger Photography case-studies , rps-panel , rps distinctions case-studies , rps-panel , rps distinctions LinkedIn0 Pinterest0",
  "wordCount": 1498,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-jacki-rosin-rps-distinctions#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-jacki-rosin-rps-distinctions#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "Associate of the Royal Photographic Society (ARPS)"
    },
    {
      "@type": "Thing",
      "name": "RPS Distinctions"
    },
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "ARPS"
    },
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}