{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/case-barbara-voules-rps-distinctions#blogposting",
  "headline": "Case Study - Barbara Voules - LRPS | RPS Distinctions Panel",
  "alternativeHeadline": "Case Study - Barbara Voules - LRPS | RPS Distinctions Panel | Alan Ranger Photography",
  "description": "View fullsize Barbara Voules Hanging Plan RPS Distinctions Barbara signed up for my monthly mentoring scheme in July 2023, and after four months of.",
  "url": "https://www.alanranger.com/blog-on-photography/case-barbara-voules-rps-distinctions",
  "datePublished": "2024-03-13T00:00:00.000Z",
  "dateModified": "2024-03-13T00:00:00.000Z",
  "dateCreated": "2024-03-13T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Case Study - Barbara Voules - LRPS | RPS Distinctions Panel View fullsize Barbara Voules LRPS Hanging Plan RPS Distinctions Barbara signed up for my monthly mentoring scheme in July 2023, and after four months of completing the monthly assignments, we discussed the potential to go for RPS Distinctions. In October 2023 she made the decision to go for it. Given the short timescales created by the withdrawal of print submissions for the L by the RPS, we had only a couple of months to select images and organise a panel ready for printing by Christmas 2023. Therefore, Barbara opted for Zoom 1-2-1 lessons rather than waiting for my RPS Distinctions Group Mentoring classes. Over the course of five 1hr Zoom sessions in relatively quick succession, we selected a shortlist of images for consideration and following, and RPS Advisory narrowed the selection down to the final ten and went about scrutinising each image for edits and refinements. Barbara also had to go out to make a couple of new images where we felt there were gaps in technique or subject diversity. Barbara managed to achieve those new images with just one or two outings and we were ready to embark on test prints and paper selection in early December. One Vision Imaging were extremely helpful in providing the test prints quickly. After some further discussions and refinements, the final ten images were ready for printing by the end of the year. Barbara’s panel shows a good eye and technique for simplifying what she is observing to convey a story and ask the viewer to create an interpretation. As always, the RPS demands technical quality but also sympathetic treatment in post-processing to ensure that the light is balanced and images have balanced visual weight individually and overall as a panel of ten images. I am really proud that Barbara was courageous enough to go through the process in such a short space of time to achieve the accreditation. Importantly she has learned how to put a panel together too and treat every image with the care and attention in post-production as she did whilst taking them. Congratulations, Barbara; I look forward to supporting you more as you develop your passion and photography hobby. Interview with Barbara following Her RPS Distinctions Achievement1. Why did you want to gain a distinction with the Royal Photographic Society (RPS)? I was actually talked into it by a friend who wanted support to gain the distinction. Many years ago, I had completed an A-level, resulting in an A*, which is equivalent to the LRPS distinction, so I thought I would try as well. By previously doing the A-level, I had some idea of what would be required, although without the support of a tutor. 2. Why did you choose Alan to mentor you for a distinction and had you worked with Alan before the RPS Distinctions Mentoring Course? I was already on Alan’s monthly mentoring scheme, so it was a natural progression to work towards the distinction with him. 3. Describe how you found the RPS Mentoring Classes. I found the mentoring extremely helpful; Alan is very knowledgeable about what exactly is required for the distinction; he helped with processing where required and went at a pace which was right for me. He gave advice about printing which was very helpful. 4. Do you feel you got the right level and input of support from the course? Yes, Alan was supportive in advising me about my images, arranging and rearranging the panel and printing 5. Before you started the mentoring course, did you feel you were already good enough to gain a distinction with the RPS? When I first started mentoring with Alan, I was overconfident and felt I was up to the required standard. I was not. Alan then guided me to improve my photography and processing. I had intended to apply for the distinction after 6 months of mentoring, but due to RPS changing requirements, it happened much sooner. I then had to really focus on taking more photographs and going through my past photographs to produce a panel of the standard needed to gain the distinction. 6. What distinction did you apply for and were you successful? I applied for and gained the LRPS 7. What was your experience like of the RPS Assessment Day? I attended on Zoom, I was quite nervous but also confident that Alan had guided me to do my best. It was one of the last print assessments and I felt the print submissions were of a higher quality compared with many of the digital submissions. 8. Did you seek independent advice, feedback or input from anywhere else before your panel assessment? I attended an Advisory Day at RPS House which was very useful. 9. Having completed the course and Distinction Assessment, what advice would you like to share with others? Definitely get a mentor for guidance, and attend an Advisory Day or a One-to-One with the RPS. 10. What was the hardest part of gaining a distinction with the RPS and why? I was time-limited as I wanted to submit a Print Panel before the RPS changed to digital submissions only. This made the process a little stressful, but Alan helped to give me the confidence that I could be ready in time. Deciding on the panel as a whole and swapping images was at times trying, but I was able to achieve what was required with Alan’s guidance in the end. 11. Has working for a distinction helped you progress as a photographer? Yes I feel my photography has improved immensely and I have more confidence. 12. Any other comments you would like to add? I am not sure if I would have achieved the distinction without Alan's support and guidance. At times, I felt confident, and at other times, I did not. I felt I could rely on Alan’s knowledge to get me through the process. I was grateful that Alan took the time to see my prints printed before they were sent to me. Click on images to see full screen If you are interested in attaining an RPS distinction I can support you with my RPS Courses for distinctions RPS Mentoring Course Summary- Produce a panel of images for an RPS Distinctions Qualification • Zoom - Online • Evening Class - 19:00 - 21:00. Six classes, you choose dates, within a twelve-month period to suit • From £395 Or also available as a series of 1hr 1-2-1 Zoom Sessions Having supported many clients through a journey of development and improvement, with their photography, over the past few years, this mentoring course is for those who are already technically competent (or at least are on the path to mastering it) and are able to demonstrate good design and composition in their photography. You are not expected to be a master or even polished to attend. This RPS Distinctions course is to help support you in improving in all three areas of image production: • Technical - The mechanics of it Creativity - The reason for it Output - The editing and publication of it You will be expected to understand and demonstrate or be willing to learn; Good exposure of photographs Good compositional awareness A range of techniques and styles (L) or specific themed body of work (A) Ability to edit images to a \"reasonable\" standard. Over the course of 12 months, where you will attend six RPS Distinctions classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.com photography-courses, student-photosAlan Ranger13 March 2024Alan Ranger Photographyrps-panel, rps distinctions LinkedIn0 Pinterest0",
  "wordCount": 1398,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-barbara-voules-rps-distinctions#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-barbara-voules-rps-distinctions#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "RPS Distinctions"
    },
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    }
  ]
}