{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/case-study-janet-boulter-rps-distinctions#blogposting",
  "headline": "Case Study - Janet Boulter LRPS | RPS Distinctions",
  "alternativeHeadline": "Case Study - Janet Boulter LRPS | RPS Distinctions | Alan Ranger Photography",
  "description": "View fullsize Janet Boulter Panel RPS Distinctions Janet attended her first event with me, Bluebell Woodland Workshop in April 2017.",
  "url": "https://www.alanranger.com/blog-on-photography/case-study-janet-boulter-rps-distinctions",
  "datePublished": "2021-03-12T00:00:00.000Z",
  "dateModified": "2021-03-12T00:00:00.000Z",
  "dateCreated": "2021-03-12T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Case Study - Janet Boulter LRPS | RPS Distinctions View fullsize Janet Boulter LRPS Panel RPS Distinctions Janet attended her first event with me, Bluebell Woodland Workshop in April 2017. Since then Janet has undertaken numerous masterclasses, workshops and had some 1-2-1 lessons. Janet, wisely, or not, decided to embark on the RPS distinctions Licentiateship in Mar 2018 and signed up for my RPS Course Janet’s first few attempts of submitting candidate images for my review were painful for us both :) with many being rejected for technical and/or composition issues. I know Janet initially went through quite a dip in confidence due to the number of rejects, but with some coercion, she managed to pick herself up and get motivated to be more considered about what level of technical, creative and post-production competence was required to meet the distinction standard set by the RPS.Her panel shows the variety of lighting, use of focal lengths, apertures and shutter speeds, essential for the Licentiateship. I especially like her still life which I know she had to really expand her editing skills to produce and the image of the canon being fired is perfectly timed for the decisive moment. A very big well done Janet, your perseverance and determination have quite rightly rewarded you with this recognised achievement and in the process made you a more competent and creative photographer. I know you will continue to develop, enjoy and take your photography hobby further to even greater heights. Interview with Janet on going for RPS Distinctions1. Why did you want to gain a distinction with the Royal Photographic Society (RPS)? I was keen to improve my photography skills and felt to gain this recognition from RPS a worldwide recognised photography accreditation would be a benchmark of achievement towards that goal. I still have more to learn and this has pushed my ability in the right direction for improvement. 2. Why did you choose Alan to mentor you for a distinction and had you worked with Alan before the RPS Distinctions Mentoring Course? I have worked with Alan on other workshops I felt his driven high standards would benefit my journey to improvement. Alan always gives you an honest opinion and has high expectations. 3. Describe how you found the RPS Distinctions Mentoring Classes. The group format was enlightening as you learn from everyone’s journey as well as your own which was helpful. I picked up ideas of composition and tips on processing from other reviews which I incorporated into my work. I would have liked to have had a more open forum rather than what felt like a 1:1 with an audience. I feel that a combination of personal 1:1 plus the group meetings was beneficial as the 1:1 made the time to focus on specific issues. The mentoring was interrupted by Covid 19 and had to switch to Zoom meetings which were particularly challenging at the print stage, however, all were achieved with dedication and focus as in previous meetings in person. 4. Do you feel you got the right level and input of support from the RPS Distinctions course? The support throughout was excellent, not only from prearranged meetings but also a response to a phone call and short notice Zoom calls. Alan was even prepared to meet me at the printers for that last crucial check of my prints which proved valuable as I had to have one re-mounted. 5. Did you feel you were already good enough to gain a distinction with the RPS before you started the mentoring course? I knew I was not ready for the RPS distinction when I started and remember being horrified that I might be expected to have completed my panel in less than 6 months. I had earmarked 12 months in my head from the start. My expectation was a steep learning curve which is what I needed to take my photography to a new level. I reflect on past images and can see the improvement in the composition, and better use of settings giving me greater quality in my raw files before I start processing. My post-production skills have increased many-fold and probably more so than the image capture. My personal confidence is never high so even when I watched the assessment I was sure I wasn’t going to be good enough. However, I did follow the other submissions and found myself saying “should have adjusted the shadows more on that” or “Alan would never have let me get away with that sharpness on the edge”; so I know I have learnt to be able to evaluate images better and am now transferring this critic into improved image taking. 6. What distinction did you apply for and were you successful? LRPS Fine Art and was successful on 3/3/21 7. What was your experience like of the RPS Assessment Day? The assessment of 2021 done via Zoom was well organised and very informative. Full credit to RPS for achieving this. Due to Covid 19, this was my first assessment and wished I had attended one before. The panel comments were always encouraging and detailed regarding the photography and the print quality; even the quality of the image mount was reviewed, so detail is very important. As it was a Zoom assessment there were regular requests from the home-based panel for the print expert to check the tonal quality, highlights and shadows close up. I would have benefited from seeing and understanding what the panel was looking for, and recommend others do. 8. Did you seek independent advice, feedback or input from anywhere else before your panel assessment? Alan was my key mentor, plus I did book a 1:1 with RPS which again was a Zoom call and extremely insightful and encouraging. The assessor provided a friendly environment offering both positive and constructive criticism of my images. He recommended two amendments as well as providing helpful information on the assessment day and the pros and cons of print v DPI. Adam at OneVision for printing was extremely helpful at the final stage. 9. Having completed the course and Distinction Assessment, what advice would you like to share with others? How quickly you get there will depend on your current ability, but don’t be put off by the prospect and treat it as a journey for improvement, not just gaining a recognised photography accreditation, but personal improvement in creativity and skills. For me, I learnt to respect and change my view that the final stage is print which is an affirmation of what I want the viewer to see. Monitor settings will vary and therefore the image can be different, in print it cannot and it will be your image that is seen. Be prepared to try another genre(s) outside your normal choice to expand your knowledge. Use as many opportunities as you can to view other photographers work and evaluate their approach to develop your own. Devote specific time for photography and don’t try to multi-task with other events. I soon learnt that others, with the exception of my husband who is a cinematographer, don’t get why you can spend a couple of hours in the same spot waiting for the light. If the budget allows book a 121 with Alan (mentor) and spend time on the difficult bits. If your processing skills need developing take a Lightroom or Photoshop course, you will need more than basic skills to get to the final image. In addition, do not underestimate the commitment you will need to make to get there, but it is worth it. It also helps too if you are a little tough skinned to onboard the trials and rejects along the way, this is part of the process. 10. What was the hardest part of gaining a distinction with the RPS and why? In a practical sense, personal time was a struggle juggling work and family commitments. From a technical view developing my post-production skills. I have had to increase my Lightroom, Photoshop and Nik abilities to enhance the images. Soft proofing for the final print, unless you have a lot of experience I would leave it to the experts. 11. Has working for a distinction helped you progress as a photographer? Most definitely, I am a far better photographer for working for this distinction. It is evident if I look back over the images from the last few years. 12. Any other comments you would like to add. One other benefit I have acquired is to actually take fewer shots, but more planned ones. More focused photography reduces the editing time getting to the final selection. Above all, it has increased my enjoyment of photography and has changed me to strive to be a storyteller, not just a photographer. Click on images to see full screen If you are interested in attaining a distinction with the RPS I can support you with my RPS Mentoring Course. RPS Mentoring Course Summary- Produce a panel of images for an RPS Distinctions Qualification • Coventry • Evening Class - 19:00 - 21:00. Six classes, you choose dates, within a twelve-month period to suit • Do online with Zoom and screen sharing or attend in person at Coventry once Covid restrictions allow. • From £395 Having supported many clients through a journey of development and improvement, with their photography, over the past few years, this mentoring course is for those who are already technically competent (or at least are on the path to mastering it) and are able to demonstrate good design and composition in their photography. You are not expected to be a master or even polished to attend. This RPS Distinctions course is to help support you in improving in all three areas of image production: • Technical - The mechanics of it Creativity - The reason for it Output - The editing and publication of it You will be expected to understand and demonstrate or be willing to learn; Good exposure of photographs Good compositional awareness A range of techniques and styles (L) or specific themed body of work (A) Ability to edit images to a \"reasonable\" standard. Over the course of 12 months, where you will attend six RPS Distinctions classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.com photography-courses, student-photosAlan Ranger12 March 2021Alan Ranger Photographycase-studies, rps-panel, rps distinctions LinkedIn0 Pinterest0",
  "wordCount": 1855,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-janet-boulter-rps-distinctions#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-janet-boulter-rps-distinctions#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "RPS Distinctions"
    },
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Woodland photography"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}