{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/case-study-kirsten-pearce#blogposting",
  "headline": "Case Study - Kirsten Pearce shares a photographic journey",
  "alternativeHeadline": "Case Study - Kirsten Pearce shares a photographic journey | Alan Ranger Photography",
  "description": "Kirsten Pearce A Photographic Journey - Case Study - Kirsten's improvement has been steady and a testament to anyone who thinks it's too complicated |.",
  "url": "https://www.alanranger.com/blog-on-photography/case-study-kirsten-pearce",
  "datePublished": "2015-06-12T00:00:00.000Z",
  "dateModified": "2015-06-12T00:00:00.000Z",
  "dateCreated": "2015-06-12T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "CASE STUDY - KIRSTEN PEARCE SHARES A PHOTOGRAPHIC JOURNEYOne of my early Paris pictures - Didn't know what a histogram was then and I would compose the shot differently if I took it again nowA PHOTOGRAPHIC JOURNEY CASE STUDYKirsten Pearce first signed up photography tuition with me in June 2014. Initially she joined a 3hr introductory class and followed up with the 4 week extended beginner's course before enrolling on the on-line mentoring programme which she has been doing for a year now. Kirsten's improvement has been steady and a testament to anyone who thinks it's to difficult and gives up or believes they can just motivate themselves and doesn't need any support and advice.Whilst Kirsten has taken her first steps on her photographic journey she recognises the path ahead continues to be challenging but also exciting. Photography is a hobby for Kirsten and one she seems to take a lot of pleasure from doing. Her images have shown great steps forwards over the last 12 months and she is now much more confident in her own ability and is now developing her own individual creative perspective on the places she travels to and subjects she sees. Well done Kirsten, the initial hard work and investment is paying off, remember after just 5 weeks you had produced your first, and an excellent, audio visual as part of the 5 week beginners course. I know you will look back at some of the images in this and shudder, but it shows just how far you have come since! the initial hard work and investment is paying off, remember after just 5 weeks you had produced your first, and an excellent, audio visual as part of the 5 week beginners course. I know you will look back at some of the images in this and shudder, but it shows just how far you have come since!INTERVIEW WITH KIRSTEN1. WHY DID YOU WANT TO BECOME A PHOTOGRAPHER?Photographs were always taken during childhood holidays, a tradition that I continued once I was old enough to travel on my own. I have countless albums of photos as a record of holidays and events, both to share where I have been and as memories to keep and look back at years later.I'm not really sure where the interest in learning more about photography started. I know that moving from film to digital gave me far more scope for experimenting as if it didn't work you could delete it. I think I saw some great photographs of the buildings of Paris about 10 years ago and wanted to try to do something similar when I visited the city, looking at the buildings from different angles.Any good photographs that I took were more by luck than judgement and I realised that I would probably need to know what all of the different settings and dials on my camera were for so I could take better photographs. I experimented a bit and bought a book which gave me some clues about composition but it was a very dry way to learn and I couldn't ask questions when I was unsure.I continued to take photographs and tried to improve on my own but promised myself that one day I would learn properly. When I found Alan’s beginners course it seemed ideal. I signed up for the 3 hour introductory session and haven't looked back.2. WERE YOU SCARED OR ANXIOUS TO START OUT?Yes as I didn't know what I was letting myself in for. I was concerned that I'd be the odd one out as I had a compact camera; another reason for waiting so long before joining a course because most seemed to require a DSLR. Alan's courses are definitely accessible to all no matter what camera you are using so I didn't need to worry.3. WHY DID YOU SELECT ALAN AS YOUR TUTOR?I found one of Alan's leaflets and liked the sound of the courses that he offered; I also looked at his website to find out more and loved his photographs.I really enjoyed the introductory course and learnt more in three hours than I would ever have picked up from a book. Alan's style of teaching and way of explaining photography made everything so much clearer. The wide range of tuition available allowed me to choose a path that was suitable to my level of ability.From the Mentoring Program - abstract assignment - sep 20144. WHAT WAS YOUR MAIN MOTIVATION TO COMMIT TO ALAN’S TUITION?Having completed and thoroughly enjoyed the beginner's course I realised that despite the wealth of information and techniques that I'd learnt that there was so much more to photography than I ever would have imagined. I didn't want to stop there and felt that Alan offered a wide range of opportunities to continue my journey.5. WHAT TYPE OF TUITION HAVE YOU HAD FROM ALAN? * Beginners five week course * Monthly mentoring * Adobe Lightroom course * Evening workshop * 1-2-1 tuition6. HOW DO YOU FEEL ALAN’S TEACHING STYLE HAS HELPED DEVELOP YOUR SKILLS THE MOST?Alan is welcoming and approachable but his teaching challenges and stretches you, allowing you to progress quickly. His critiques 'take no prisoners' which was a bit disconcertin vening workshop * 1-2-1 tuition6. HOW DO YOU FEEL ALAN’S TEACHING STYLE HAS HELPED DEVELOP YOUR SKILLS THE MOST?Alan is welcoming and approachable but his teaching challenges and stretches you, allowing you to progress quickly. His critiques 'take no prisoners' which was a bit disconcerting to begin with but we were warned beforehand! I soon realised that there was no point in shying away from the truth if I was going to learn quickly.7. WHAT ARE THE KEY THINGS ALAN HAS HELPED YOU WITH?To begin with, understanding my camera fully. I only ever used automatic mode, I'm now fully aware of how to use my camera to get the result that I want and whilst I still have a long way to go it's beginning to feel more natural. After about six months I committed to getting my first DSLR camera and took 1-2-1 tuition to make sure that I was able to get the most from it which was incredibly helpful.Away from the technical side I'm finding the mentoring to be really helpful. It’s forcing me to explore genres of photography that I would otherwise not have tried. Monthly deadlines ensure that I prioritise and don't allow work commitments to get in the way. Alan's very honest feedback is really useful and I'm gradually finding myself remembering and applying his advice as I try to compose my photographs.8. HOW DO YOU THINK YOU’VE GROWN AS A PHOTOGRAPHER?I still feel like I'm at the beginning of my journey with so much more to learn but almost a year on from taking the introductory course I know that the photos that I'm taking now are very different. They are being taken with aperture or shutter priority rather than on automatic and I'm thinking carefully about composition. I have a far greater understanding of what makes a \"good photo\" and am able to look at my own photographs critically.There have been many ups and downs along the way. It has taken a while to get used to my camera and there have been good and bad months with the different mentoring themes but I'm constantly learning something new, trying different things and really enjoying my photography.From the mentoring program - 50mm assignment- feb 20159. WHAT ARE YOUR AMBITIONS FOR THE FUTURE WITH PHOTOGRAPHY?To continue to improve the quality of my photographs as much as possible and to try many different genres of photography. I will continue the mentoring and have booked Alan's fireworks workshop. I'd like to do some other workshops too and possibly work towards the intermediate course in the future.I feel more confident than I was with the technical aspects so my current goal is to work on the creative side of things. I've never seen myself as even remotely artistic so it’s my next challenge to further improve my composition, trying to convey my intention more without feeling the need to give my photographs a title when sharing them. I'm also using the skills learnt on the Adobe Lightroom course and trying to improve my post-processing. I know it will take a long time but with determination and patience I will get there and continue to improve.10. WHAT ADVICE WOULD YOU GIVE OTHERS WHO ARE THINKING OF STARTING PHOTOGRAPHY TUITION OR WHO ARE CURRENTLY STUDYING?There's lots of jargon to start with which took a lot of getting used to. There's lots of ups and downs too when it would be easy to give up but it does start to get easier after a while so it’s definitely worth the continued commitment to develop your skills.ANY OTHER COMMENTS:Just to say th There's lots of jargon to start with which took a lot of getting used to. There's lots of ups and downs too when it would be easy to give up but it does start to get easier after a while so it’s definitely worth the continued commitment to develop your skills.ANY OTHER COMMENTS:Just to say thank you to Alan for everything so far; for the support and feedback and for continuing to challenge me to make me a better photographer.----------------------------------------Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.comView fullsizestudent-photos Alan Ranger 12 June 2015case-studies , a photographic journey LinkedIn0 Pinterest0",
  "wordCount": 1674,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-kirsten-pearce#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-kirsten-pearce#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}