{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/case-study-vincenzo-albano-rps-distinctions#blogposting",
  "headline": "Case Study - Vincenzo Albano ARPS | RPS Distinctions",
  "alternativeHeadline": "Case Study - Vincenzo Albano ARPS | RPS Distinctions | Alan Ranger Photography",
  "description": "Vincenzo Albano shares how he gained his ARPS - RPS Distinctions, the challenges, experience and resulting successful panel with my RPS Mentoring Programme.",
  "url": "https://www.alanranger.com/blog-on-photography/case-study-vincenzo-albano-rps-distinctions",
  "datePublished": "2019-10-30T00:00:00.000Z",
  "dateModified": "2019-10-30T00:00:00.000Z",
  "dateCreated": "2019-10-30T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "CASE STUDY - VINCENZO ALBANO ARPS | RPS DISTINCTIONSView fullsizeVincenzo ARPS PanelVincenzo approached me in May 2019 following an RPS Advisory Day for an Associate Panel that was advised as not being ready for submission. This is his story for RPS DistinctionsVincenzo and I had never met but after a discussion and review of his proposed panel, spare images and the feedback from the advisory day he agreed to enrol in my RPS Mentoring Course but with one difference. Being London based, Vincenzo was not able to make the group mentoring sessions so instead we had six Skype sessions at times to suit his schedule.Between May and September, we held six online sessions to work through the many changes required to bring the panel, images and output up to standard. I don’t recall how many of the original panel images remain in the final panel and know that Vincenzo went out multiple times to take new photos. The first stage of mentoring was very much focused on getting the statement of intention right. Associate panels are assessed against the statement of intention as much as they are for their individual and overall technical and creative quality. I’m sure Vincenzo won’t mind me sharing that it took a lot of stripping back, simplifying and then working tightly to the brief to ensure it was right. Personally I felt that was the turning point for Vincenzo as gave him greater focus about what the photos needed to illustrate and how to present them.When Vincenzo inform ind me sharing that it took a lot of stripping back, simplifying and then working tightly to the brief to ensure it was right. Personally I felt that was the turning point for Vincenzo as gave him greater focus about what the photos needed to illustrate and how to present them.When Vincenzo informed me he had booked his assessment for October for a RPS Distinctions accreditation, I was a little concerned he would not be ready in time. Vincenzo proved my doubts wrong and worked very hard and fast to take new images, re-edit images at the same time as learning new editing skills and produce a successful panel in less than four months. Congratulations to Vincenzo for this great achievement in gaining an Associate Distinction in Documentary Photography with the RPS. I am sure our paths will cross again at some point and I wish you ongoing success and enjoyment of your photography.STATEMENT OF INTENT > My RPS Distinctions panel explores the impact of graffiti on the urban environment and the public. Born as rebellious vandalism and mostly painted stealthily at night, graffiti have now evolved into elaborated artworks created in open daylight.> > In recent years, entire metropolitan areas have changed their appearance for the better, thanks to ever present graffiti. Hence, I was keen to discover whether the general acceptance of graffiti as an urban artform has led to an active relationship by us, the public, with street art: do we ignore, engage or unconsciously blend into such colourful works?> > After months of living and breathing the graffiti in parts of London, I have tried to capture the fascinating tale of urban space repossession and the spontaneous symbiosis between street art and the public. Word Count 127 View fullsizeVincenzo RPS Hanging Plan for ARPS Documentary - click to see large----------------------------------------INTERVIEW WITH VINCENZO ON GOING FOR RPS DISTINCTIONS1. WHY DID YOU WANT TO GAIN A DISTINCTION WITH THE ROYAL PHOTOGRAPHIC SOCIETY (RPS)?After obtaining my RPS Licentiateship in 2002, I felt it was time, to sum up, my scattered photographic experience into a prestigious qualification.2. WHY DID YOU CHOOSE ALAN TO MENTOR YOU FOR A DISTINCTION AND HAD YOU WORKED WITH ALAN BEFORE THE RPS MENTORING COURSE?I felt that my weakest area was editing, therefore I needed to learn how to manage a workflow that would “pop” my images, still retaining their original flavour and immediacy. Alan’s portfolio on his website shows how, carefully taken pictures, could be enhanced to an artistic level, still retaining their authenticity. 3. DESCRIBE HOW YOU FOUND THE RPS MENTORING CLASSES. Alan has been pivotal in guiding me through editing, so important in digital photography. Having a strong and long-dated experience with film photography, I initially struggled to adapt to the new world of digital. Alan has shown me how savvy editing can transform a dull image into storytelling. 4. DO YOU FEEL YOU GOT THE RIGHT LEVEL AND INPUT OF SUPPORT FROM THE RPS DISTINCTIONS COURSE?Absolutely yes, Alan was frank in his feedback, no messing around! 5. Did you feel you were already good enough to gain a distinction with the RPS before you started the mentoring course? RPS distinction has a very high bar and the Advisory Day put me in front of the reality of lots of work ahead if I wanted to achieve success. In particular, after close analysis, I understood that editing eady good enough to gain a distinction with the RPS before you started the mentoring course? RPS distinction has a very high bar and the Advisory Day put me in front of the reality of lots of work ahead if I wanted to achieve success. In particular, after close analysis, I understood that editing was my biggest weakness and Alan’s tutorials lead to a better understanding of the integration process from shooting to post-production and lastly print.6. WHAT DISTINCTION DID YOU APPLY FOR AND WERE YOU SUCCESSFUL?ARPS in Documentary Photography and yes, it was successful. 7. WHAT WAS YOUR EXPERIENCE LIKE OF THE RPS ASSESSMENT DAY?I didn’t attend, too stressful!8. DID YOU SEEK INDEPENDENT ADVICE, FEEDBACK OR INPUT FROM ANYWHERE ELSE BEFORE YOUR PANEL ASSESSMENT? I attended an RPS Advisory day and also benefitted from RPS online advice. 9. HAVING COMPLETED THE COURSE AND DISTINCTION ASSESSMENT, WHAT ADVICE WOULD YOU LIKE TO SHARE WITH OTHERS?The standard required for RPS distinctions is very high. You need to demonstrate understanding and control of the three major steps: shooting, editing and printing. Storytelling is also an important part particularly at ARPS level, showing consistency between the Statement of Intent and the Portfolio. Nevertheless, I suppose that Licentiate applicants would also benefit by creating a “narrative” portfolio. Therefore, preparation in all the above fields is highly recommended. Budget is also important to prevent last-minute surprises. Lastly, presentation is so important: I would recommend using a high-level lab for printing (unless you are comfortable with a high-quality printer at home), choosing high-quality paper and using a professional mounting service. 10. WHAT WAS THE HARDEST PART OF GAINING A DISTINCTION WITH THE RPS AND WHY?There isn’t a specific “hard” part, the entire process is demanding! If I have to pick one, consistency between intent and narrative requires lots of hard thinking. 11. HAS WORKING FOR A DISTINCTION HELPED YOU PROGRESS AS A PHOTOGRAPHER?Absolutely yes, standards required are very high, hence had to up my standards accordingly. 12. ANY OTHER COMMENTS YOU WOULD LIKE TO ADD.----------------------------------------Click on images to see full screenView fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize ----------------------------------------If you are interested in attaining a distinction with the RPS I can support you with my RPS Course for distinctions RPS Mentoring Course SUMMARY- PRODUCE A PANEL OF IMAGES FOR AN RPS DISTINCTION QUALIFICATION * COVENTRY * EVENING CLASS - 19:00 - 21:00. SIX CLASSES, YOU CHOOSE DATES, WITHIN TWELVE MONTH PERIOD TO SUIT * OR OPTION TO DO ONLINE WITH SKYPE AND SCREEN SHARING WITH DATES/TIMES TO SUIT YOU. (1HR PER SESSION) * FROM £395HAVING SUPPORTED MANY CLIENTS THROUGH A JOURNEY OF DEVELOPMENT AND IMPROVEMENT, WITH THEIR PHOTOGRAPHY, OVER THE PAST FEW YEARS, THIS MENTORING COURSE IS FOR THOSE WHO ARE ALREADY TECHNICALLY COMPETENT (OR AT LEAST ARE ON THE PATH TO MASTERING IT) AND ARE ABLE TO DEMONSTRATE GOOD DESIGN AND COMPOSITION IN THEIR PHOTOGRAPHY.You are not expected to be a master or even polished to attend. This course is to help support you in improving in all three areas of image production: * Technical - The mechanics of it * Creativity - The reason for it * Output - The editing and publication of itYou will be expected to understand and demonstrate or be willing to learn; * Good exposure of photographs * Good compositional awareness * A range of techniques and styles (L) or specific themed body of work (A) * Ability to edit images to a \"reasonable\" standard.Over the course of 12 months, where you will attend six classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS----------------------------------------Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.comView fullsizephotography-courses , student-photos Alan Ranger 30 October 2019Alan Ranger Photography case-studies , rps-panel , rps distinctions LinkedIn0 Pinterest0",
  "wordCount": 1641,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-vincenzo-albano-rps-distinctions#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-vincenzo-albano-rps-distinctions#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "Associate of the Royal Photographic Society (ARPS)"
    },
    {
      "@type": "Thing",
      "name": "RPS Distinctions"
    },
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "ARPS"
    }
  ]
}