{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/case-study-dennis-jeffrey-rps-distinctions#blogposting",
  "headline": "Case Study - Dennis Jeffrey LRPS | RPS Distinctions",
  "alternativeHeadline": "Case Study - Dennis Jeffrey LRPS | RPS Distinctions | Alan Ranger Photography",
  "description": "View fullsize Dennis Jeffrey Panel Dennis attended his first event with me in Oct 2018, Batsford Arboretum Autumn Workshop, and following a conversation on.",
  "url": "https://www.alanranger.com/blog-on-photography/case-study-dennis-jeffrey-rps-distinctions",
  "datePublished": "2021-10-29T00:00:00.000Z",
  "dateModified": "2021-10-29T00:00:00.000Z",
  "dateCreated": "2021-10-29T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Case Study - Dennis Jeffrey LRPS | RPS Distinctions View fullsize Dennis Jeffrey LRPS Panel Dennis attended his first event with me in Oct 2018, Batsford Arboretum Autumn Workshop, and following a conversation on that event signed up for the RPS Courses soon after in pursuit of RPS Distinctions It doesn’t usually take over two years for clients to submit their final panel for assessment to the RPS, but Dennis took a number of breaks from the project to prioritise other things in his life. In addition, Dennis is a perfectionist, so he wanted to try various panel and image iterations even though, as I told him, he was ready six months earlier than when he finally took the plunge. Therefore, it’s a testament to Dennis that he had the persistence and motivation to keep going with the project and finally achieve the deserved accreditation. His final panel shows the variety, abstract, wildlife, architecture, environmental portrait, street photography, travel and range of exposure times, depth of field, lighting situations that are all essential for a successful RPS panel. Dennis supplemented my RPS Classes with several 1-2-1’s to improve his photo editing skills in Lightroom and DXO NIK plugins. In doing so he improved his visual awareness skills considerably and now has a better understanding of the whole photographic process from seeing, designing, shooting, enhancing and the final output. Well done Dennis a richly deserved achievement and I hope this milestone will now give you the confidence to enjoy your photography more and start to develop your own way of interpreting and conveying your photographic voice. Interview with Dennis for his RPS Distinctions1. Why did you want to gain a distinction with the Royal Photographic Society (RPS)? I had subscribed to RPS for many years and therefore saw successful panels and always wondered whether I could get up to that standard. At 71 I decided to put that to the test. 2. Why did you choose Alan to mentor you for RPS Distinctions and had you worked with Alan before the RPS Mentoring Course? I wasn’t a member of a photography club with regular competitions and consequently didn’t have much experience of selecting images against a set of criteria and for those images to be critiqued by someone else. I, therefore, needed to learn those skills. Before joining the course, I attended one of Alan’s Arboretum workshops. 3. Describe how you found the RPS Mentoring Classes. I started the programme just before Covid and therefore had three face-to-face group sessions. Subsequently, the sessions were on Zoom. Both face-to-face and Zoom sessions enabled me to see what other photographers at various stages in the process were submitting and hear Alan’s comments about their images. Alan sets high standards! He taught me to look more critically for compositional and technical errors. He suggested how post-processing may improve potential images but there isn’t time on the programme, nor is it one of the course objectives, for Alan to teach post-processing. I, therefore, did Group Zoom courses with him and RPS trainers on Nik, Lightroom and Photoshop to tackle post-processing in a systematic way to achieve an objective. I extended the course to two years simply because there were periods in the initial year when other priorities arose. Deep down I’m a ‘perfectionist’ and consequently, despite Alan’s patience, support and advice, I began to realise that I was in a cycle of wanting to continually ‘improve ‘every image. I also had numerous other major commitments vying for my time. I, therefore, decided to stop the course at that point and take stock. After a period when I dealt with those other priorities, I re-focused on the project. I realised the only way for me to determine whether I had reached the RPS standard was to submit a panel without further feedback /training sessions. I reviewed the images and spares presented to the RPS Portfolio Reviews and some other ‘favourites’ and selected a sub-set of images. Some images only required fine-tuning to be candidates for the panel, whilst others required a processing plan from a ‘stable’ image. However, I believed I had the training to select a panel and process those images in a consistent way. The final stage for me was to print the panel plus ‘variants’ full size so I could see them physically in place within the prospective panel rather than on a screen. Throughout the course, Alan emphasised to all candidates that it was their panel which they needed to own. He was simply expressing an opinion. It is a testament to the training I’d received, that despite a five-month break, I was able to select the final images and create a panel I was happy with and met the standard required. 4. Do you feel you got the right level and input of support from the course?Yes 5. Did you feel you were already good enough to gain a distinction with the RPS before you started the mentoring course? No. I knew that within my catalogue, I had some ‘good’ photographs, but I learned from Alan’s critique, that even the ‘good’ photographs could be improved by targeted post-processing to get them to an ‘appropriate’ standard. I also learned how to create a ‘panel’ which I hadn’t done before. After the course, I felt confident that I could achieve the standard. 6. What RPS Distinctions did you apply for and were you successful? I successfully submitted a panel for the Print ‘Licentiate’ Fine Art. 7. What was your experience like of the RPS Distinctions Assessment Day? I found the RPS staff very helpful in dealing with queries I had about the submission prior to the Assessment but I had a prior commitment on the day of the Assessment. 8. Did you seek independent advice, feedback or input from anywhere else before your panel assessment? I’m aware some applicants use Club Members or Judges to get feedback on their prospective panel. Not being a member of a club meant I didn’t have that resource. However, I did use the two RPS Distinctions 1:1 Portfolio Reviews to help me review individual images and alternative panels. Both reviewers also empathised that their review was a personal opinion but being able to discuss draft panels and substitutes with panel members were very useful. 9. Having completed the course and RPS Distinctions Assessment, what advice would you like to share with others? If you can accept ‘critique’ and learn from that process you should go for it! With Alan’s guidance, as a minimum, you will learn to be a better photographer and, if you acquire the necessary skills, you will have the satisfaction of your achievement being recognised. 10. What was the hardest part of gaining a distinction with the RPS and why? The hardest part of the process was the creation of a cohesive panel rather than simply selecting my 10 ‘best images’. 11. Has working for a RPS Distinctions helped you progress as a photographer? Yes. That was one of the objectives and consequently, I tried to ensure that I did so across the whole range of skills required to gain the Licentiate. 12. Any other comments you would like to add. Enjoy it! Click on images to see full screen RPS Mentoring Course Summary - RPS Distinctions- Produce a panel of images for an RPS Distinction Qualification • Zoom - Online / Or Coventry • Evening Class - 19:00 - 21:00. Six classes, you choose dates, within a twelve-month period to suit • Do online with Zoom and screen sharing or attend in person at Coventry once Covid restrictions allow. • From £395 Having supported many clients through a journey of development and improvement, with their photography, over the past few years, this mentoring course is for those who are already technically competent (or at least are on the path to mastering it) and are able to demonstrate good design and composition in their photography. You are not expected to be a master or even polished to attend. This course is to help support you in improving in all three areas of image production: • Technical - The mechanics of it Creativity - The reason for it Output - The editing and publication of it You will be expected to understand and demonstrate or be willing to learn; Good exposure of photographs Good compositional awareness A range of techniques and styles (L) or specific themed body of work (A) Ability to edit images to a \"reasonable\" standard. Over the course of 12 months, where you will attend six classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.com photography-courses, student-photosAlan Ranger29 October 2021Alan Ranger Photographycase-studies, rps-panel, rps distinctions LinkedIn0 Pinterest0",
  "wordCount": 1578,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-dennis-jeffrey-rps-distinctions#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/case-study-dennis-jeffrey-rps-distinctions#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "RPS Distinctions"
    },
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}