{
  "@context": "https://schema.org",
  "@graph": [
    {
      "@type": "WebPage",
      "@id": "https://www.alanranger.com/blog-on-photography/case-study-ian-slater-rps-distinctions#webpage",
      "url": "https://www.alanranger.com/blog-on-photography/case-study-ian-slater-rps-distinctions",
      "name": "Case Study - Ian Slater - LRPS | RPS Distinctions Panel",
      "description": "View fullsizeIan Slater Hanging PlanRPS DistinctionsIan signed up for my Distinctions Mentoring Course in March 2023, having failed his first attempt at the.",
      "inLanguage": "en-GB",
      "isPartOf": {
        "@id": "https://www.alanranger.com#website"
      },
      "primaryImageOfPage": {
        "@id": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1709977223849-8S5YRNS49NGD9DXGY0KV/_-11.jpg"
      }
    },
    {
      "@type": "BreadcrumbList",
      "@id": "https://www.alanranger.com/blog-on-photography/case-study-ian-slater-rps-distinctions#breadcrumb",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://www.alanranger.com"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Blog",
          "item": "https://www.alanranger.com/blog-on-photography"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Case Study - Ian Slater - LRPS | RPS Distinctions Panel",
          "item": "https://www.alanranger.com/blog-on-photography/case-study-ian-slater-rps-distinctions"
        }
      ]
    },
    {
      "@type": "BlogPosting",
      "@id": "https://www.alanranger.com/blog-on-photography/case-study-ian-slater-rps-distinctions#blogposting",
      "headline": "Case Study - Ian Slater - LRPS | RPS Distinctions Panel",
      "alternativeHeadline": "Case Study - Ian Slater - LRPS | RPS Distinctions Panel | Alan Ranger Photography",
      "description": "View fullsizeIan Slater Hanging PlanRPS DistinctionsIan signed up for my Distinctions Mentoring Course in March 2023, having failed his first attempt at the.",
      "url": "https://www.alanranger.com/blog-on-photography/case-study-ian-slater-rps-distinctions",
      "mainEntityOfPage": {
        "@type": "WebPage",
        "@id": "https://www.alanranger.com/blog-on-photography/case-study-ian-slater-rps-distinctions#webpage"
      },
      "datePublished": "2024-02-18T00:00:00+00:00",
      "dateCreated": "2024-02-18T00:00:00+00:00",
      "dateModified": "2024-02-18T00:00:00+00:00",
      "inLanguage": "en-GB",
      "articleBody": "CASE STUDY - IAN SLATER - LRPS | RPS DISTINCTIONS PANELView fullsizeIan Slater LRPS Hanging PlanRPS DistinctionsIan signed up for my RPS Distinctions Mentoring Course in March 2023, having failed his first attempt at the Licentiate with the Royal Photographic Society (RPS)I have never met Ian, and on my first online encounter with him, I sensed, understandably, that he was a little bit disillusioned with the process provided by the RPS with favourable comments on a preliminary RPS Advisory Day to be followed shortly after with rejection in his assessment.My job was to pick up the pieces, select the best bits of the existing panel and reshape things to help him choose, edit and put a panel together again for assessment.Ian presented me with what I can only call a plethora of images depicting men on bicycles in various environments and at different speeds of motion. We quickly agreed (somewhat reluctantly on Ian’s part, that whilst they all had merit individually, there needed to be a broader selection of subject matter, lighting, point of view and communication. It didn’t take long for us to work through a back portfolio of alternative images and genres to draft a panel of ten photos that could meet the criteria set by the RPS.Ian is pretty skilled in the editing aspect of things, so the suggested edits I made were quickly executed with a reasonable degree of skill. Once halos, dust spots, consistent aspect ratios and a few shadow/highlight or areas of dis panel of ten photos that could meet the criteria set by the RPS.Ian is pretty skilled in the editing aspect of things, so the suggested edits I made were quickly executed with a reasonable degree of skill. Once halos, dust spots, consistent aspect ratios and a few shadow/highlight or areas of distracting colour saturation were dealt with, he went on to have an online 1-2-1 with an RPS Assessor for preliminary feedback. Thankfully, the assessor’s feedback was positive, with a few minor tweaks and suggestions, and Ian was set to go following a couple of reviews with me on amendments. While I feel my experience is solid after twenty years of teaching and working alongside various photographic organisations for accreditation, I always prefer an independent second opinion before judgement day!Ian passed on the day, one of the few, who had opted for the DPI (Digital Projected Images) assessment. Sadly, in my view, the RPS only allows the Licentiate as a DPI and has removed the Printed Image option. Contrary to popular myth, this doesn’t make it more challenging; it just means more attention to image resolution and apparent issues with dust spots, halos and similar matters in image production. Well done, you, Ian. It's a great result and panel showcasing your versatility in photography. I look forward to supporting you in your next chapter and pursuing your Associate Accreditation.You can view more of Ian’s work on his website here: Slater Photography.----------------------------------------INTERVIEW WITH IAN FOLLOWING HIS RPS DISTINCTIONS ACHIEVEMENT1. WHY DID YOU WANT TO GAIN A DISTINCTION WITH THE ROYAL PHOTOGRAPHIC SOCIETY (RPS)?I see photography as my creative outlet and, rightly or wrongly, I felt that the journey to become a Licentiate of the RPS was an opportunity to learn, develop and push myself beyond my comfort zone. It has been all those things and more.2. WHY DID YOU CHOOSE ALAN TO MENTOR YOU FOR A DISTINCTION AND HAD YOU WORKED WITH ALAN BEFORE THE RPS DISTINCTIONS MENTORING COURSE?I had tried and failed the LRPS assessment twice before contacting Alan. I had not worked with him before but half the battle is knowing when (and where) to seek help and Alan came highly recommended. 3. DESCRIBE HOW YOU FOUND THE RPS DISTINCTIONS MENTORING CLASSES. In a word “difficult”. This isn’t an easy option: there are no short cuts… the RPS assessors will, on the surface, be kind and considerate but they will not overlook any deficiencies in your work and nor should they. Alan’s classes are an exercise in acclimatisation, he will be straight with you and, personally, I valued that above all else. 4. DO YOU FEEL YOU GOT THE RIGHT LEVEL AND INPUT OF SUPPORT FROM THE COURSE?I feel that I had the level of support that I needed. I could have had more if I had wanted it but as I already had some knowledge of the process I wasn’t starting from scratch and therefore it was more about guidance, technique improvement and a toning down of my desire to include 10 cycling related images. 5. Did you feel you were already good enough to gain a distinction with the RPS before you started the mentoring course? At the time I started the course yes I did. If I am being honest I was frustrated by the failures and a bit irritated by the assessment process. Now, however, I can see how much I have improved. If at first you don’t succeed try, try and try again… I am a better photographer now than when I started this journey and arted the course yes I did. If I am being honest I was frustrated by the failures and a bit irritated by the assessment process. Now, however, I can see how much I have improved. If at first you don’t succeed try, try and try again… I am a better photographer now than when I started this journey and the day I stop trying to improve is the day I put my camera down.6. WHAT DISTINCTION DID YOU APPLY FOR AND WERE YOU SUCCESSFUL?LRPS and yes :) 7. WHAT WAS YOUR EXPERIENCE LIKE OF THE RPS ASSESSMENT DAY?I attended by Zoom which is slightly artificial but convenient. It was very clear that the print panels were far more successful as a group than the digital panels. I would say 70 - 80% of the print candidates were successful whereas there were only 3 digital candidates who succeeded. It is harder to hide deficiencies in a digital image but by the same token the standard of some of the digital panels really wasn’t great. It felt as if some of the candidates were just taking a punt on a random collection of 10 images but this is an internationally recognised achievement: no one should under estimate how seriously the assessors take their job as guardians of the keep.8. DID YOU SEEK INDEPENDENT ADVICE, FEEDBACK OR INPUT FROM ANYWHERE ELSE BEFORE YOUR PANEL ASSESSMENT? I had a 1-2-1 with one of the RPS assessors prior to the final selection of my 10 panel images. There is a degree of subjectivity in all of this but with the knowledge that Alan had given me I found the 1-2-1 a useful mechanism to get inside the mindset of an assessor. 9. HAVING COMPLETED THE COURSE AND DISTINCTION ASSESSMENT, WHAT ADVICE WOULD YOU LIKE TO SHARE WITH OTHERS?Don’t underestimate the task ahead: it is a high bar that you are seeking to get over but if you are determined and willing to think critically about your own work and development then Alan can (and will) help you. 10. WHAT WAS THE HARDEST PART OF GAINING A DISTINCTION WITH THE RPS AND WHY?For me the hardest part was recognising my own deficiencies and ignoring the well wishers who told me that nearly every image I produced was a good one. There is a world of difference between Instagram likes and being a technically proficient and critically thinking photographer. 11. HAS WORKING FOR A DISTINCTION HELPED YOU PROGRESS AS A PHOTOGRAPHER?Massively… but it doesn’t end here. I know it sounds very cheesy but I want every day to be a learning experience. 12. ANY OTHER COMMENTS YOU WOULD LIKE TO ADD?Alan loves images of cycling: he’s a BIG fan so I would recommend that anyone who is thinking about seeking his help to put an RPS panel together fill it with cyclists and bikes :-) ----------------------------------------Click on images to see full screenView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsize ----------------------------------------If you are interested in attaining an RPS distinction I can support you with my RPS Courses for distinctions RPS Mentoring Course SUMMARY- PRODUCE A PANEL OF IMAGES FOR AN RPS DISTINCTIONS QUALIFICATION * ZOOM - ONLINE * EVENING CLASS - 19:00 - 21:00. SIX CLASSES, YOU CHOOSE DATES, WITHIN A TWELVE-MONTH PERIOD TO SUIT * FROM £395 OR ALSO AVAILABLE AS A SERIES OF 1HR 1-2-1 ZOOM SESSIONS HAVING SUPPORTED MANY CLIENTS THROUGH A DISTINCTIONS QUALIFICATION * ZOOM - ONLINE * EVENING CLASS - 19:00 - 21:00. SIX CLASSES, YOU CHOOSE DATES, WITHIN A TWELVE-MONTH PERIOD TO SUIT * FROM £395 OR ALSO AVAILABLE AS A SERIES OF 1HR 1-2-1 ZOOM SESSIONS HAVING SUPPORTED MANY CLIENTS THROUGH A JOURNEY OF DEVELOPMENT AND IMPROVEMENT, WITH THEIR PHOTOGRAPHY, OVER THE PAST FEW YEARS, THIS MENTORING COURSE IS FOR THOSE WHO ARE ALREADY TECHNICALLY COMPETENT (OR AT LEAST ARE ON THE PATH TO MASTERING IT) AND ARE ABLE TO DEMONSTRATE GOOD DESIGN AND COMPOSITION IN THEIR PHOTOGRAPHY.You are not expected to be a master or even polished to attend. This RPS Distinctions course is to help support you in improving in all three areas of image production: * Technical - The mechanics of it * Creativity - The reason for it * Output - The editing and publication of itYou will be expected to understand and demonstrate or be willing to learn; * Good exposure of photographs * Good compositional awareness * A range of techniques and styles (L) or specific themed body of work (A) * Ability to edit images to a \"reasonable\" standard.Over the course of 12 months, where you will attend six RPS Distinctions classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS----------------------------------------Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.comView fullsize----------------------------------------photography-courses , student-photos Alan Ranger 18 February 2024Alan Ranger Photography rps-panel , rps distinctions LinkedIn0 Pinterest0",
      "wordCount": 1767,
      "timeRequired": "PT9M",
      "readingTime": "PT9M",
      "genre": "Photography Case Study",
      "articleSection": "RPS Distinctions",
      "keywords": [
        "rps-panel",
        "rps distinctions"
      ],
      "learningResourceType": "CaseStudy",
      "educationalLevel": "Intermediate",
      "proficiencyLevel": "Intermediate",
      "typicalAgeRange": "18-99",
      "educationalUse": "Learning",
      "estimatedCost": {
        "@type": "MonetaryAmount",
        "currency": "GBP",
        "value": "0"
      },
      "audience": {
        "@type": "EducationalAudience",
        "educationalRole": "Photographer",
        "audienceType": "Student"
      },
      "educationalAlignment": {
        "@type": "AlignmentObject",
        "alignmentType": "educationalFramework",
        "educationalFramework": "Photography Skills",
        "targetName": "Intermediate"
      },
      "about": [
        {
          "@type": "Thing",
          "name": "Royal Photographic Society"
        },
        {
          "@type": "Thing",
          "name": "RPS Distinctions"
        },
        {
          "@type": "Thing",
          "name": "Exposure (photography)"
        },
        {
          "@type": "Thing",
          "name": "Photographic composition"
        }
      ],
      "mentions": [
        {
          "@type": "Thing",
          "name": "RPS"
        }
      ],
      "hasPart": [],
      "image": {
        "@type": "ImageObject",
        "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1709977223849-8S5YRNS49NGD9DXGY0KV/_-11.jpg",
        "width": 1500,
        "height": 1000,
        "caption": "Case Study - Ian Slater - LRPS | RPS Distinctions Panel"
      },
      "thumbnailUrl": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1709977223849-8S5YRNS49NGD9DXGY0KV/_-11.jpg",
      "primaryImageOfPage": {
        "@id": "https://www.alanranger.com/blog-on-photography/case-study-ian-slater-rps-distinctions#webpage"
      },
      "speakable": {
        "@type": "SpeakableSpecification",
        "xpath": [
          "/html/head/title",
          "//h1"
        ],
        "cssSelector": [
          "h1",
          ".intro"
        ]
      },
      "discussionUrl": "https://www.alanranger.com/blog-on-photography/case-study-ian-slater-rps-distinctions#comments",
      "author": {
        "@type": "Person",
        "@id": "https://www.alanranger.com/#alanranger",
        "name": "Alan Ranger",
        "url": "https://www.alanranger.com/about-alan-ranger",
        "jobTitle": "Photographer & Photography Educator",
        "sameAs": [
          "https://www.alanranger.com",
          "https://www.linkedin.com/in/alanrangerphotography"
        ]
      },
      "publisher": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography",
        "url": "https://www.alanranger.com",
        "logo": {
          "@type": "ImageObject",
          "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/b859ad2b-1442-4595-b9a4-410c32299bf8/ALAN+RANGER+photography+LOGO+BLACK.+switched+small.png?format=1500w",
          "width": 300,
          "height": 100
        }
      },
      "isPartOf": {
        "@type": "WebSite",
        "@id": "https://www.alanranger.com/#website"
      },
      "copyrightHolder": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography"
      },
      "copyrightYear": 2024,
      "sameAs": [
        "https://www.alanranger.com/blog-on-photography"
      ],
      "relatedLink": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "subjectOf": {
        "@type": "Blog",
        "@id": "https://www.alanranger.com/blog-on-photography#blog"
      },
      "isRelatedTo": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "citation": "Royal Photographic Society",
      "backstory": "CASE STUDY - IAN SLATER - LRPS | RPS DISTINCTIONS PANELView fullsizeIan Slater LRPS Hanging PlanRPS DistinctionsIan signed up for my RPS Distinctions Mentoring Course in March 2023, having failed his first attempt at the Licentiate with the Royal Photographic Society (RPS)I have never met Ian, and on my first online encounter with him, I sensed, understandably, that he was a little bit disillusioned with the process provided by the RPS with favourable comments on a preliminary RPS Advisory Day t",
      "funding": {
        "@type": "MonetaryGrant",
        "funder": {
          "@type": "Organization",
          "name": "Alan Ranger Photography"
        }
      },
      "interactionStatistic": {
        "@type": "InteractionCounter",
        "interactionType": "https://schema.org/CommentAction",
        "userInteractionCount": 0
      },
      "commentCount": 0
    }
  ]
}