{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/choosing-a-camera#blogposting",
  "headline": "Choosing a camera - Considerations and Comparisons",
  "alternativeHeadline": "Choosing a camera - Considerations and Comparisons | Alan Ranger Photography",
  "description": "Before you know it, you will have spent double the amount you had planned to.",
  "url": "https://www.alanranger.com/blog-on-photography/choosing-a-camera",
  "datePublished": "2021-10-27T00:00:00.000Z",
  "dateModified": "2021-10-27T00:00:00.000Z",
  "dateCreated": "2021-10-27T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "before you know it, you will have spent double the amount you had planned to. Longevity The length of time you expect to have the camera is of course a factor when setting a budget. If you really feel that photography is something that will become a serious passion/hobby then naturally you will want something that will see you through at least a couple of years of progression. Of course it’s much harder to know this at the start of the journey, but I encounter a lot of people who bought early and then realised in the first year that the camera they had just couldn’t do it or made it too hard to achieve what they wanted. Try and think about what should see you through for 2-3 years. Whilst the second hand market is good it will depend on how current your camera model is and a little luck to get more than 50-60% of what you paid for it. New or Second-hand The obvious advantages of new are the “no quibble return” if anything goes wrong and of course the latest technological advances in sensors, mainly important when it comes to High ISO performance and some advances in focusing. The latest models also now include GPS which will show you exactly where your images were taken and some other nice but not essential features. Of course buying second-hand has some inherent risks of condition and wear and tear. Modern DSLR’s are good for at least a 100,000 shutter actuations (i.e. images taken). It’s not easy, in fact impossible to know how many images a second hand camera has taken because despite the numbering sequence, it’s easy to reset that counter (which goes to 9,999) or know how many cycles around the clock it has done. On the up side, you can of course end up with a highly specified DSLR for a lot less money and generally speaking you can also obtain a number of lenses and accessories as part of the package. Apart from checking for obvious signs of use and wear and tear it really is a case of buyer beware. However you can buy new on EBay too and I have found that are several good outlets that provide new camera’s, not just the current model, for a lot less than you would pay from the high street or even on a major online retailer that still provide 1 year warranty/guarantee. Features for choosing a camera “The bells and whistles” – this is where you could easily end up blowing your budget as you get allured into an endless list of nice to haves. My main advice here is make yourself a prioritised shortlist of the things that you must have for your type of photography interest and those that are nice to have. You should consider the following: · High ISO performance – this is important if you want to shoot portraits, low light photography (events) · High resolution – megapixels/sensor size – wildlife and landscapes benefit most from this as it enables you to crop into an image and not lose too much resolution/pixel quality. · Image stabilisation – there are not many brands who have this built in-camera but if shooting handheld a lot then this will save you some money on lenses as every lens you buy will be stabilised by the camera body – this simply gives you a few more stops of control (the ability to hand hold the camera at shutter speeds slower than you could otherwise achieve on a non-stabilised set-up.) · HDR – High Dynamic Range simply means you can take a number of bracketed shots and have them blended in-camera automatically rather than having to use software and do it yourself, post shoot. HDR in-camera is relatively new and not quite perfected, it also generally only does this in JPG format and whilst that’s fine for many, personally I still find shooting RAW bracketed frames and merging them myself produces better results for me. · Rapid Fire – also known as continuous shooting or burst mode. This enables you to shoot several frames per second with one continuous press on the shutter button. This is a really useful technique for portraits, sports, certain wildlife and even landscapes when you are trying to anticipate something with movement. The higher the bust rate (measured in frames per second) the more chance you have of getting a frame in a sequence you want. · Screen/LCD – they all come with LCD screens so what’s the big deal here? For me not much other than a high res screen that ideally flips out so I can use it at difficult heights to frame shots and therefore has “Live-View” on it. Personally having a touch screen doesn’t entice me, but one I can actually see does! Of course the above is not an exhaustive list but just some considerations: If you come across something that you don’t know the importance of then Google it or drop me an email and I’ll try and research and advise you. Size, Weight & Comfort - for choosing a camera All camera’s list their weight and size on many websites, please check this or better still try and find a retail outlet where you can go and hold it and have a play. A camera needs to be balanced in your hands so you can comfortably hold it with a lens on and not get the dreaded wobbly hand syndrome! In addition if you end up with something to big it main deter you from taking it out and using it as often as you would like to. Check to see if you know anyone who has the camera you considering, to get their feedback (but be aware most people will always sing the praises of what they bought!) Better still why not hire one for a week or a weekend? There are plenty of sites now where hiring a camera is really simple not badly priced and it gives you a real opportunity to have a proper play with no pressure from a salesperson. Lens for Hire Hire a camera Lens Pimp Calumet Lenses, Accessories and Ad-Ons This is where you end up spending more money – in fact you will end up spending more on these over time than the camera body. This is why doing some research now might pay dividends in the long run. Spend some time looking at the cost of each manufacturers lens range, cost and specs. Compare two lenses for price, e.g. 24-70mm from Canon, Nikon & Sony and the 70-200mm. Some manufacturers also charge extra for items, like lens hoods, that come as standard with other manufacturers lens. Am sure some of you have heard me say this before, but for those that haven’t, the lens is the most important part of the gear. The quality of the optics really does make a difference to the quality of the pixels/resolution/sharpness and of course depth of field with apertures. It was for this reason that I chose to stick with Sony for the last 10years as they have an exclusive deal with Carl Zeiss for their lens range. Yes I pay more for Carl Zeiss compared to Canon or Nikon equivalents but not vastly different in some cases and for the quality difference I am prepared to pay a little more. Your other big consideration with lens range is of course whether you think you will move to a full frame sensor camera at some point – if you think this is likely you need to be careful not to invest to much in lenses that only work on a crop sensor camera – or you will not only be having to change cameras but replacing all your lenses too! Brands - - Choosing a Camera You should all know that I am not loyal or bias towards any brand – I think it’s a personal choice and I know all camera’s, in the right hands, will produce quality images. All of the above considerations are what should dictate your choice of brand not whether it’s trendy, popular or anything else superficial. Having said that there are of course a few market leaders for a reason and therefore some benefits to owning one of those brands. Second-hand market it vast and therefore competitive, knowledge, online forums, guidance and user support/advice is extensive and finally of course, but not so much an issue with any brand these days, is customer service from that manufacturer and their ongoing development path. Prices - Choosing a Camera To give you some idea of price brackets then the following is a very rough guide: This is not an exhaustive list and by no means a recommendation, they are just examples and in fact you can easily find, for example, a brand new serious amateur range level model in the mid and even entry level price range when it’s more than two years since its release. Entry Level - <£350 Nikon D3100/3200, Canon EOS 100D, Sony SLT A58, Pentax K500, Mid-Range Level - <£650 Nikon D7000, Nikon D5100/D5200, Sony SLT A65/A37, Canon EOS 650D,700D Serious Amateur Level <£1000 Canon EOS 70D, Sony SLT A77, Nikon D7100/D600 Semi Pro Level £1500-£1800 Nikon D800, Canon EOS 6D, Sony SLT A99 Pro Level >£2000 Canon EOS 5D Mark III, Nikon D3/D4 So where to look? Other than hiring as mentioned earlier this website is very useful for selecting all sorts of criteria and then comparing side by side. A great resource that will have you spending hours of time drooling at the screen https://snapsort.com/ http://snapsort.com/recommend#! Please remember that these are not gospel but hopefully allow you become more aware about what you are buying and the pros and cons of each. Finally it is, of course, worth shopping around. My advice is to avoid oversees based sites that offer amazing prices until you find out it doesn’t include import and duty costs and customer service and even reliability is rarely worth the risk. As a general check on pricing this site: https://www.camerapricebuster.com/ is great for checking prices and importantly the market trend pricing for that item, you don’t want to be buying it at the peak of its high price! Note that some outlets offer you part-exchange too, though again be aware you may get stung both ends of the transaction! Please like and share this post if you found it useful using the share link below photography-tips, recommended-productsAlan Ranger0 Pinterest0",
  "wordCount": 1756,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/choosing-a-camera#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/choosing-a-camera#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}