{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/colour-theory-in-photography-practise-assignment#blogposting",
  "headline": "Colour Theory in Photography practise Assignment - Free",
  "alternativeHeadline": "Colour Theory in Photography practise Assignment - Free | Alan Ranger Photography",
  "description": "This assignment teaches students how to effectively utilise colour theory in photography by exploring the relationship with contrasting colours and their types.",
  "url": "https://www.alanranger.com/blog-on-photography/colour-theory-in-photography-practise-assignment",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "COLOUR THEORY IN PHOTOGRAPHY PRACTISE ASSIGNMENT - FREEhttps://www.alanranger.com/free-online-photography-courseCOLOUR THEORY IN PHOTOGRAPHYThis assignment teaches students how to effectively utilize colour theory in photography by exploring the relationship between contrasting colours and their impact on mood and visual storytelling. Students will practice capturing images that highlight both tonal and colour contrasts.LEARNING OBJECTIVES * Understand the role of colour contrast in enhancing visual appeal. * Identify and apply complementary colours to create dynamic compositions. * Experiment with tonal contrast to shape mood and depth in photographs.WANT FEEDBACK ON YOUR ASSIGNMENT?Join Foundation Plus and get personalised monthly critique plus full access to all assignments.Learn More & Join Download Assignment PDF BEFORE YOU SHOOT * Choose a location with varied colours and lighting conditions. * Gather a selection of objects or subjects that showcase different colours. * Set your camera to either aperture priority or shutter priority mode. * Fix your ISO at 200 to maintain consistent exposure. * Prepare to experiment with both warm and cool colour palettes.THE ASSIGNMENTTECHNICAL FOCUS * Use aperture priority mode to control depth o e different colours. * Set your camera to either aperture priority or shutter priority mode. * Fix your ISO at 200 to maintain consistent exposure. * Prepare to experiment with both warm and cool colour palettes.THE ASSIGNMENTTECHNICAL FOCUS * Use aperture priority mode to control depth of field while focusing on contrasting colours. * Experiment with different focal lengths to see how colour contrast changes with perspective. * Pay attention to natural light and how it affects colour perception. * Utilize backlighting to enhance the vibrancy of colours in your subjects. * Incorporate textures to add another layer of contrast to your images.CREATIVE FOCUS * Explore the use of complementary colours in your compositions for maximum impact. * Create a series of images that juxtapose warm and cool colours. * Look for opportunities to contrast soft and hard textures within your colour compositions. * Use colour to convey emotions; for example, use warm colours to evoke energy and cool colours for calmness. * Tell a story through colour by selecting subjects that represent different emotions or themes.ASSIGNMENT TASKS 1. Photograph a scene using aperture priority mode at f/4, ISO 200 fixed, focusing on contrasting warm and cool colours. 2. Capture a close-up of an object with a vibrant colour against a neutral background using aperture priority mode at f/2.8, ISO 200 fixed. 3. Create a diptych showcasing two images: one with high tonal contrast and the other with low tonal contrast, both shot in aperture priority mode with ISO 200. 4. Shoot an outdoor scene in the golden hour, focusing on the warm colours of the sunset using shutter priority mode at 1/250s, ISO 200 fixed. 5. Experiment with shadows and highlights in a black and white scene to emphasize tonal contrast, using aperture priority mode at f/5.6, ISO 200 fixed. 6. Capture a portrait that employs a contrasting colour background to highlight the subject’s features, using aperture priority mode at f/3.5, ISO 200 fixed.💡 Stretch Tasks * Create a photo series that explores a single colour in various contexts and lighting conditions, using both aperture and shutter priority modes. * Develop a conceptual portrait project that tells a story through contrasting colours and tones, focusing on both emotional and physical contrasts.DO / DON'TDO * ✓ Do experiment with different lighting conditions to see how they affect colour perception. * ✓ Do pay attention to the background and its impact on the subject's colour. * ✓ Do take multiple shots with varying colour contrasts to find the most effective composition. * ✓ Do use editing software to enhance the colour contrast in your images post-shoot. * ✓ Do practice shooting in different environments to gain a broader understanding of colour theory.DON'T * ✗ Don't use overly bright or saturated colours without considering their context. * ✗ Don't ignore the effect of shadows on your composition's colour balance. * ✗ Don't rely solely on post-processing to create colour contrast; focus on capturing it in-camera. * ✗ Don't use distracting elements that compete with your main subject's colour. * ✗ Don't forget to consider the emotional impact of the colours you choose to include.REFLECTION QUESTIONS * How did the use of contrasting colours affect the mood of your photographs? * What challenges did you face while trying to capture colour contrast in your images? * In what ways did differ on't forget to consider the emotional impact of the colours you choose to include.REFLECTION QUESTIONS * How did the use of contrasting colours affect the mood of your photographs? * What challenges did you face while trying to capture colour contrast in your images? * In what ways did different lighting conditions influence your perception of colour? * How can understanding colour theory enhance your overall photography skills?📚 RELATED READINGBefore you start, read these related blog posts to deepen your understanding: * → What Is Contrast In Photography * → How To Improve Your Photography Composition For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus.Alan Ranger 23 November 2025Composition & Creative LinkedIn0 Pinterest0",
  "wordCount": 873,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/colour-theory-in-photography-practise-assignment#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/colour-theory-in-photography-practise-assignment#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}