{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/composition-curiousness-part-1#blogposting",
  "headline": "Composition Curiousness - Part 1 | Professional Guide",
  "alternativeHeadline": "Composition Curiousness - Part 1 | Professional Guide | Alan Ranger Photography",
  "description": "Composition - Why it matters Undoubtedly the most common question I am asked as a photography tutor, and also the question that probably remains unanswered.",
  "url": "https://www.alanranger.com/blog-on-photography/composition-curiousness-part-1",
  "datePublished": "2025-09-08T00:00:00.000Z",
  "dateModified": "2025-09-08T00:00:00.000Z",
  "dateCreated": "2025-09-08T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Composition Curiousness - Part 1 | Professional Guide Composition - Why it matters Undoubtedly the most common question I am asked as a photography tutor, and also the question that probably remains unanswered satisfactorily throughout the life of a photographer is the one around composition. How to, what, why, when and so on... Unlike learning the technical aspects of camera operation and, to a limited extent, the digital dark-room processing operations, the question of composition has always been a topic that attracts debate, opinion and even argument because there is no such thing as definitive guide or instruction manual on how to frame a shot. Those facts therefore should confirm that it can be considered to be purely subjective, purely down to taste and purely down to one person's view over another's. Right? Well to some degree that is true but if it was 100% true then it wouldn't adequately explain why some artists (I include photographers in that label) seem to be able to produce consistently evocative images that seem original whereas others seem to only ever produce imitations of what has been done before or for many reasons produce something that for some reason doesn't quite work or work in the eyes of a judge, a so-called knowledgeable person or someone whose photographic opinion you respect. Given this conundrum, and the fact that a large proportion of my client base is \"beginner\" level I thought it might help to provide some of my own thoughts on the topic in a mini series of blog posts. I do not intend to write a how to guide, or my top ten tips but I will naturally point to what I think are good principles that can be applied by anyone, at any level with any camera. I will share my own thinking, and that of others too, and even use some terms and references that will feel like a framework or dare I say it some \"rules\", but they are not rules in reality, they are considerations, concerns, inquisitiveness, questioning and curiousness into what interpretation the photographer wants to portray in their image. So let's start with the simple truth that we record images for many different reasons, sometimes it's posterity, sometimes documenting an event and sometimes because we have a connection to the subject and want to portray how we feel about it. It's this latter that I want to concentrate this series of posts on. The relationship between the photographer and the subject is key! Some people grab shots as a commodity, a souvenir to take home, a pretty picture, often with themselves in it which I personally really struggle with. The narcissistic plague that we witness each time we go out to beautiful locations demonstrates that these people think they are more important, more significant and obviously more beautiful than the location itself to the extent they place themselves in the centre of the frame so we can be in no doubt that they are of course the center of attention and the main subject! The landscape and environment is there to support them and put them in the spotlight! As it says on the homepage on my website \"Images are the expression of the photographer; they reflect perception and individuality, portraying a journey through life\" Those types of images suggest to me that those people may be quite egotistical, vain and just possibly a little insecure too, but not likely to be on my Christmas card list (if i actually had one) The image reflects the personality of the photographer, their concerns, interests and relationship with the subject. So without wanting to make this into tips, rules or a how to post I think the first question any photographer should ask themselves before making an image is simply this; What is my relationship with the subject and how do I feel about the subject? If you can translate those thoughts and feelings into a single word, phrase or something succinct then this could be described as your \"intention\" for making the image. Your intention may be aimed to say something specific or just generally - there are no rights or wrongs in this context just levels of clarity and ambiguity. I am guilty of making many images that really are shots that I think have broad appeal that will work for marketing my business. I know when I make them that they are for that purpose but I still try to inject my own interpretation into them. On other occasions i am in a rare position to make an image that isn't about marketing a workshop, technique or demonstrating something to a client, on those unique moments it definitely feels more free flowing, more considered and even more frustrating and rewarding in equal measures. One example I have used in beginners photography classes is the child's birthday party. It's a situation that most people experience in life, definitely in childhood but hopefully also in adulthood too as a parent, grandparent, uncle/aunt or other relation. Naturally we want to make images that record moments on this special day and the usual ones are present opening, child enjoying a new toy, child and friends and so on but then of course we get to the formal shot of set moments like cake and candle time. We know it's coming and often when so there really is no excuse for you to be u prepared, caught out and not ready to make an image that captures the magic of that moment. So after several time so using this example to clients in my introductory classes I thought I should probably have an attempt at practising what i had been preaching for a few months. I had lectured about how important it was to close the frame down to the bare ingredients and avoid showing too much in the frame. The image should not show the whole room, every person who was in attendance, the brand or theme of the cake or anything else that may distract from the magic moment of blowing out the candles. My own daughter 7 at the time of this shot, still believed in the wish you got by blowing out the candles so I knew there would be an element of excitement, expectation and belief in her eyes when presented with the cake. On the technical side I knew given her birthday celebration was a day long affair it would be dark by the time we got to do the cake thing so was a little concerned that light would be an issue. (you know how I refuse to use flash). You can't control the waves but you can learn to surf them So the situation for the shot was; pretty much darkness, no flash, a moving subject and the desire to make an image where I could capture the light in her eyes from the candles and almost see her breath going through the frame onto the flames as they flickered out and she thought of her magic wish and I would only get one chance at the shot. I couldn't control many elements other than my own positioning and doing a few test shots for exposure beforehand. So hand-held, I set the camera to high ISO, continuous burst shooting, continuous focus and wide open aperture. Yep I know it's not perfect and I certainly would wish for less noise in the shot and sharper details on the lips/eyes etc. However, like I said it was a one chance opportunity and as her Dad I was also having to do the lighting and presenting at the same time! I hope I captured some of that magic moment in her eyes, breath as it flowed across the frame into the flickering light! On a subject I am know for more, landscapes, I think the challenges are actually harder to inject your own interpretation and relationship into the shot. We have been brain trained over decades to see and experience in a very literal sense and images generally portray that marked way of presenting a location unless we are prepared to go beyond what we see. \"The eye should learn to listen before it sees...\" Those that have attended my classes and workshops will be aware of my mantra about slowing down and spending more time observing than shooting. It's a practise that I just don't encourage but insist on at the start of my workshops. It's not easy to free the mind of the noise of thoughts and emotions that occupy you at any point in time so having made a journey to a location, at whatever distance we travelled, we naturally will have a head still full of stuff that acts as a distraction from being in a \"creative space\". Without wishing to turn this post into a \"mindfulness\" how to, the practise of just observing, clearing your thoughts and concentrating on your subject is really the point here. How well do you know what you are looking at, be it a birch tree or lump of rock? For me, part of the magic of making landscape images is my intimate relationship with it. This has come about by research, study, observation, appreciation and respect of the outdoors world and nature's cycle. That relationship I have with my subject guides how I want to portray it more than how it looks in a literal sense. \"The eye only sees what the mind is prepared to comprehend\" Once you learn and experience how the camera can portray what's in front of it differently to how your eyes experience it then you are armed with some knowledge and choices of how to use that broad range of settings to create an image that conveys your interpretation of the subject. That could be using exposure time to show motion in many forms, slow, frozen or totally unidentifiable subject details. It could be close-up macro with microscopic details or simple use of aperture to create contrasts of what's in focus and out of focus and that's before we get onto the subject of light, shadow, colour, form and texture. These attributes allow us to begin to think about how we use the camera to record our subject, the considerations and the techniques available to us to create the illusion that we have in our mind. Sign up to the blog update subscription to see the next post in this series where I will expand on composition curiousness and share my thoughts on some of the basic principles of space and framing subjects. Please feel welcome to comment and give your opinions and thoughts to this post by adding a comment below. photography-tipsAlan Ranger8 September 2025alan ranger photographycomposition-curiousness LinkedIn0 Pinterest0",
  "wordCount": 1792,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/composition-curiousness-part-1#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/composition-curiousness-part-1#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}