{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/composition-curiousness-part-2#blogposting",
  "headline": "Composition Curiousness - Part 2 | Professional Guide",
  "alternativeHeadline": "Composition Curiousness - Part 2 | Professional Guide | Alan Ranger Photography",
  "description": "Composition - Inspiration or Information “There will always be those who look only at technique, who ask ‘how’, while others of a more curious nature will.",
  "url": "https://www.alanranger.com/blog-on-photography/composition-curiousness-part-2",
  "datePublished": "2025-09-05T00:00:00.000Z",
  "dateModified": "2025-09-05T00:00:00.000Z",
  "dateCreated": "2025-09-05T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Composition Curiousness - Part 2 | Professional Guide composition - Inspiration or Information “There will always be those who look only at technique, who ask ‘how’, while others of a more curious nature will ask ‘why’. Personally, I have always preferred inspiration to information.” Man Ray In my last post on composition composition-curiousness-part-1 I talked about the importance of your relationship to the subject that you are photographing. Part 2 of this series is focused on the importance of the subject versus the technique and tools. It's been three months since I posted the first in this series of journals on composition and since then I have been busy running many workshops both in the UK and more recently in the UAE at the International Festival of Photography where I was commissioned to run a series of masterclasses on composition as well as the advanced camera operation techniques. Whether it was Batsford Arboretum in Gloucestershire or Sharjah in the UAE there was an overriding appetite from participants about \"what makes a good picture?\". Or \"what aperture should I use for this shot?\" and so on... View fullsize Peak District 1 day Photographic Workshop The need for information - composition It would be easy for me to dismiss these questions as irrelevant and simply tell you that it's simply a case of \"depends\" on what you want to capture, why and how, as I discussed in my last post on composition - however when you are starting your own journey into photography clearly you need some pointers and a steer in the right direction. I remember my own early attempts to take a \"serious\" photograph rather than a \"snap\" and I totally gravitated towards the technique and settings more than the subject and narrative. So I get it, I get why this is a real question for beginners and those trying to establish themselves as more than a snapper. So let's deal with that aspect first. Yes having a pointer towards the camera exposure settings will help reinforce your understanding of how to control movement and depth of field in the shot but of course you first need to know the outcome you want before you ask that question. Asking me what exposure settings I would use is of no use to you unless you want to simply replicate my own interpretation and technical execution. I can of course advise someone in terms of maximising sharpness from the lens and depth of field or shutter speed to freeze action or capture movement with blur but those things are easily learnt from a process of trial and error through experimentation by the individual. Which then begs the question are people just simply being lazy or not confident enough to try for themselves and work it out for themselves? Batsford Arboretum photographic workshop I'll let you decide what drives the need for having exact settings and processes called out but I have definitely become less inclined to simply give clients the straight forward answer they seek over the years, I prefer to throw back the question of \"what are you trying to achieve and portray in your image?\" \"The journey is more important than the destination ...\" It maybe a hackneyed phrase and the image you seek may also be on similar lines \"clichéd, stock, tired, common, stereotyped, pedestrian, played out, commonplace, worn-out, stale, overworked, banal, run-of-the-mill, threadbare, trite, unoriginal, timeworn and so on but I do understand that just because an image of a \"honeypot\" location has been done countless times or a composition of the same components - trees in mist, long exposure on water over rocks, mirror reflections of mountains on water or any other combination, doesn't mean you shouldn't make a similar image - afterall the reason they have become cliche\" is because they are popular and enjoyed by so many. It's perfectly natural and right, in my opinion, that you should seek and enjoy making those images as part of your journey to becoming a better photographer. At some point in your journey you will decide that those types of images are not enough to feed your appetite and whilst you won't stop making them you will look and explore beyond them. long exposure-howick \"First comes tools, second comes inspiration...\" These days that is the opposite way round to the way I work and think, but of course I have 15 years of the journey behind me so you might say that's easy for you to say! I certainly started out on this journey thinking I needed to have the right tools and subsequently acquired \"stuff\" as I went along which in turn motivated me to use it to understand it and get the best from it. However, in hindsight I now understand that those tools were just an enabler to help me realise what was possible rather than what was right. I, like many before me and no doubt after me, thought that a large part of photography was down to equipment and and technical execution but I have learnt since becoming a photography teacher that whilst I can't ignore the need to address the technical execution and tools question the more important and productive question is to ask and examine is the why what is the inspiration for making the image. Image for the tool or tool for the image? Naturally those that get \"into\" photography have a healthy appetite for knowledge and in time, like i did, acquire more equipment such as filters to control dynamic range or exposure time or lenses to photograph close-up (macro) or further away (wildlife and landscapes). Initially once acquired you will follow in the footsteps of all those before you and feel that you have to find a situation to make a shot that means you can use/justify that piece of equipment. The Lee Filters Big Stopper (10 Stop Neutral Density Filter) is a case in point. For a long period when that filter was released you saw image after image (including mine) that were made because someone was trying out their new bit of equipment. Yes, the effects were initially interesting but mainly because they were new, different and not widely seen. They had that instant wow impact and let's be honest here, when we start sharing our first attempts at photography beyond snaps we want to make a statement and impress. Lee Big Stopper Filter - Felixstowe The problem is that amongst \"unaware\" audiences these image have that WOW impact and of course they will shower you with praise and sometimes even bizarre comments of how you should give up your day job to do photography professionally! It's too easy to fall into that trap of believing that the number of likes on Facebook or the comments posted and said to you are a good indication of your photography skills - some will appreciate, and no doubt marvel at the sharpness or vividness of your images, and others may simply want to support your endeavours but ultimately the only judge and jury of an image is you and time. What is more important is that you learn you choose the right tool for the image rather than the choose the image to suit the tool. Composition is, or as i prefer to call it \"design\", a \"considered\" process of evaluating many things. It starts with your \"intention\" which put simply is the reason, concerns and objective for the image - the thing you want to convey - I refer to this as subject. Secondly, is the narrative that surrounds the subject - it could be the environment, situation at the time or just context of the experience of the photographer. Third is the use if light to create the emotional connection but importantly it's how the photographer uses and treats the light to emphasise their subject and narrative. For me, it's the expression and use of all three that culminates in the use of the tools rather than being led by the tools at our disposal. Autumn workshop at Batsford - \"Departed Friends\" My advice is always to choose the tools to suit the job rather than create an image to suit the tools. Referencing back to my first post in this series about relationship and the connection to the subject is what drives us to pick up the camera in the first place. We photograph what we connect to, beit landscapes, people, wildlife, sporting moments, family and friends and portraits, architecture or simply documenting life as we experience it. They are all valid reasons and nothing is cliche if its personal to you because it's your experience rather than someone else's. We all live in bubbles of context from the people around us that we associate with, they generally conform to our own way of thinking and perceiving or that simply exist as part of our daily work and social networks. Therefore it's natural that we will be influenced by them and may even be drawn to making images that fit in with that crowd - being unique is hard, it requires deeper thought and courage, but with it comes immense satisfaction that you are being true to how you interpret and convey your perspective of the subjects you make images of. Rock formations - Northumbria photography-tipsAlan Ranger5 September 2025Alan Ranger Photographycomposition-curiousness LinkedIn0 Pinterest0",
  "wordCount": 1558,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/composition-curiousness-part-2#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/composition-curiousness-part-2#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}