{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/dice-roll-serendipity-awareness-photography-assignment#blogposting",
  "headline": "Dice Roll Serendipity Awareness Photography Assignment",
  "alternativeHeadline": "Dice Roll Serendipity Awareness Photography Assignment | Alan Ranger Photography",
  "description": "Learning Objectives • Expand your definition of photogenic subjects through chance encounters.",
  "url": "https://www.alanranger.com/blog-on-photography/dice-roll-serendipity-awareness-photography-assignment",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Learning Objectives • Expand your definition of photogenic subjects through chance encounters. • Enhance your observational skills by focusing on unexpected details in your environment. • Develop technical proficiency by applying specific camera settings in various conditions. Want feedback on your assignment? Join Foundation Plus and get personalised monthly critique plus full access to all assignments. Learn More & Join Download Assignment PDF Before You Shoot • Gather a pair of dice and a compass app on your smartphone. • Prepare your camera with a fully charged battery and ample storage space. • Choose comfortable walking shoes to explore new locations. • Familiarize yourself with your camera settings before rolling the dice. • Plan for different weather conditions by checking the forecast. The Assignment Technical Focus • Set your camera to aperture priority mode (Av or A) with an aperture of f/4, shutter speed of 1/125s, and ISO 200 for well-lit environments. • For low-light conditions, switch to manual mode with settings of f/2.8, 1/60s, and ISO 800 to capture details without motion blur. • Utilize spot metering to ensure proper exposure on your subject when shooting in high-contrast environments. • Experiment with different white balance settings to match the lighting conditions you encounter during your exploration. • Use continuous autofocus (AI Servo or AF-C) to track moving subjects effectively while shooting. Creative Focus • Look for patterns in nature or architecture that emerge unexpectedly during your exploration. • Capture candid moments of people interacting with their environment to convey stories through your images. • Experiment with different angles and perspectives to create dynamic compositions that surprise the viewer. • Incorporate leading lines found in your surroundings to draw attention to your subject. • Utilize the rule of thirds to compose your shots, but feel free to break this rule when it enhances your image. Assignment Tasks • Roll the dice to determine your travel distance and direction. For example, if you roll a 4 (kilometers), 2 (miles), and 6 (east), set your camera to f/5.6, 1/250s, ISO 100 in aperture priority mode and travel 4 kilometers east, photographing anything that catches your eye. • Once at your destination, switch to f/8, 1/125s, ISO 400 in manual mode, and capture a series of 5 images focusing on textures and patterns you encounter within a 10-meter radius. • After completing the first round, roll the dice again and travel to a new location. Use f/2.8, 1/60s, ISO 800 in shutter priority mode to capture the ambiance of the new setting during golden hour. • Choose one of your photos from the previous tasks and create a diptych with another image taken from a different angle or perspective. Set your camera to f/4, 1/125s, ISO 200 in aperture priority mode to capture the second image in natural light. • Invite a friend to join you for the next round of dice rolling. Roll the dice together to determine your new destination and use f/5.6, 1/250s, ISO 400 in manual mode to capture candid moments of each other exploring the area. • Create a small photo essay (3-5 images) based on a theme discovered during your explorations. Use f/8, 1/125s, ISO 200 in aperture priority mode to maintain consistency across your images. 💡 Stretch Tasks • Explore a location at night and utilize long exposure techniques with settings of f/11, 10s, ISO 100 in manual mode to capture light trails or star patterns. • Create a collage of your favorite images from the assignment and present them in a digital format, ensuring each image has a consistent editing style. DO / DON'T DO • ✓ Do embrace spontaneity and allow the dice to guide your exploration. • ✓ Do take notes on your experiences and the settings used for each photograph. • ✓ Do share your images with others to gain feedback and insights. • ✓ Do experiment with different compositions and perspectives. • ✓ Do reflect on the emotions and stories conveyed in your photographs. DON'T • ✗ Don't limit yourself to traditional subjects; be open to capturing the mundane. • ✗ Don't rush through your shooting; take time to observe your surroundings. • ✗ Don't ignore the importance of lighting; adjust your settings accordingly. • ✗ Don't hesitate to revisit a location at different times for varied results. • ✗ Don't forget to have fun and enjoy the process of discovery. Reflection Questions • What unexpected subjects did you discover during your explorations? • How did chance influence your photographic outcomes? • What technical skills did you improve upon through this assignment? • How did the experience change your perception of photogenic subjects? 📚 Related Reading Before you start, read these related blog posts to deepen your understanding: • → Photography Is An Art Of Observation • → Composition In Photography For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus. Alan Ranger23 November 2025Composition & Creative LinkedIn0 Pinterest0",
  "wordCount": 844,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/dice-roll-serendipity-awareness-photography-assignment#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/dice-roll-serendipity-awareness-photography-assignment#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}