{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/expressive-photography-hard-often-frustrating#blogposting",
  "headline": "Expressive Photography-Hard, often frustrating but rewarding",
  "alternativeHeadline": "Expressive Photography-Hard, often frustrating but rewarding | Alan Ranger Photography",
  "description": "Expressive Photography I meet many clients who share the desire to create \"expressive\" images.",
  "url": "https://www.alanranger.com/blog-on-photography/expressive-photography-hard-often-frustrating",
  "datePublished": "2022-06-22T00:00:00.000Z",
  "dateModified": "2022-06-22T00:00:00.000Z",
  "dateCreated": "2022-06-22T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Expressive Photography-Hard, often frustrating but rewarding Expressive Photography I meet many clients who share the desire to create \"expressive\" images. I guess for any landscape/outdoor photographer; it's the panacea to being able to express what they see and feel inside a small rectangular frame. Of course, we see and feel much more than what we distil into that frame which is why we choose what we want to include and exclude, and it often becomes a personal battle between brain and heart. Blindly following all the rules of photography composition is bound to produce a \"well-crafted\" image and one that may become predictable. Understanding and applying the principles of the rules we learn but adapting them to any given situation is a much more complex challenge and one I enjoy teaching in the broadest sense of the verb. It's in the broad sense of the word because I don't want to tell or teach someone to shoot what I see and feel about a scene and subject and for them to make a composition based on my interpretation. I strive to help them create the best frame they can in the camera to take away to work on. This brings me to another stage of the photographic process. Before I do that, let's remind ourselves about some of the critical elements of a visceral image that creates that feeling of expression rather than recording and documenting just how something looks. As experienced photographers, we have learned how to recognise the play of light, the differences between shadows, mid-tones and highlights in a scene, the relationships between textures and colours, shapes and direction of flow in a frame, and the overall atmosphere sensed and created by how we frame the image. When it comes to the basic elements of composition and framing close up on details I don’t struggle most of the time and this approach to simplifying everything is relatively easy and generally pleasing. View fullsize Anglesey - Seaweed Anglesey Rock Formation We are not often conscious of the emotions and feelings that draw us to certain scenes (beyond the reactive obvious) that subconsciously we connect to without giving much thought. They manifest themselves through post-production to produce a final image that we quickly blast onto social media. If that's not your thing, they are confined to the \"finished\" images folder, only to see the light of day for some other random purpose. I did precisely that following my last workshop, quickly processing images I could use to put on IG and occasionally FB but not having an emotional attachment to most of them. It felt like \"On another photography workshop, another set of images created hurridly between supporting clients and being available as much as they wanted me to be.\" Unfortunately for everyone, the final day was the worst weather and often light conditions. The standard shots across the island were not achievable with a spray like rain in the wind blowing straight towards lenses. Fortunately for me, the clients were pretty experienced and, on the last day, were more than happy to work independently as we visited our final location. It provided me with a small window to explore the wooded area and route back to the car park rather than the usual exposed long beach walk back. As those that know me will confirm, I am at my happiest when and, probably naturally connected, when I am in woodlands and forests. As I meandered along the well-trodden route back to the car park, my head was permanently cocked to the left, where the deep pine forest mirrored glimpses of light and atmosphere with intriguing vistas and changes in colour and density. I was fascinated by the trees and how the light passed between them onto the forest floor. Unusually for me, I didn't take the tripod, so was able to move freely onto verges to reduce focal distances and frame things as I wanted without feeling restricted by terrain or time. Today, being a bank holiday meant, I had some time to revisit the Lightroom catalogue and relook at images from the last couple of months. The original image, you will see below, didn't make the first pass of photos to edit and publish quickly but I marked it a potential to return to. This one stood out straight away, but I knew instinctively from working images in post-production that it needed some work. It was a challenging image to work with, and it took me some time to work through the many problematic elements of bright foreground highlights and exposure to create the feeling and expression that I felt was in it. Getting back to the topic of this post. Expressive photography is hard, frustrating, but rewarding. It is hard because you have to join many dots together when on location, with the camera and finally with post-production. However, when you make an image in frustrating light and conditions and are able to create something more than it appears it’s so rewarding. Original out of camera Final Image Is my final image authentic? That's for you to apply your definition of authentic to the eye/brain or consider the heart's authenticity. I've always preferred images of the latter; hence I was satisfied that after 30-45 mins, I turned an initially dismissed image into something more personal and expressive. It embodies many personal circumstances; my process of suffering severe pain for months on end and being on stupid amounts of painkillers daily to deal with dental and osteoradionecrosis after-effects on a physical level. Then, the emotional and mental issues of two years of lockdown issues, relationship break-up, loneliness, wondering/considering what I want or can do next, etc. And then, you find out that a dear friend and client (formerly the other way round) has cancer and then surgery too; at the same time, I was waiting for the results of another cancer biopsy result. It's a lot to absorb! I think all of the emotions and thoughts are what we express, whether we choose to make it about \"happy pictures\" or something that reflects the honesty of how we feel deep inside that come through in our images are what makes them meaningful and personal. Ultimately, for me, that's what expressive photography is about. Not rules, techniques, equipment, location, date, time and weather conditions, but does the image convey how you see and feel at that moment in your life. It is your autobiography in pictures for you to disclose or not! For me, the image conveys light and dark the contrast between where we are, where we have been and where we might go. If an image makes you think beyond the literal and into the visceral, then for me, it works, as simple as that. news, a-journey, what's-behind-the-imageAlan Ranger22 June 2022Alan Ranger Photograohy LinkedIn0 Pinterest0",
  "wordCount": 1139,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/expressive-photography-hard-often-frustrating#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/expressive-photography-hard-often-frustrating#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    },
    {
      "@type": "Thing",
      "name": "Woodland photography"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}