{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/focus-modes-and-tracking#blogposting",
  "headline": "Focus Modes and Tracking Photography Practice Assignment",
  "alternativeHeadline": "Focus Modes and Tracking Photography Practice Assignment | Alan Ranger Photography",
  "description": "This assignment teaches you how to effectively use focus modes and tracking techniques in photography, emphasizing the importance of matching your autofocus.",
  "url": "https://www.alanranger.com/blog-on-photography/focus-modes-and-tracking",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "FOCUS MODES AND TRACKING PHOTOGRAPHY PRACTICE ASSIGNMENThttps://www.alanranger.com/free-online-photography-courseFOCUS MODES AND TRACKINGThis assignment teaches you how to effectively use focus modes and tracking techniques in photography, emphasizing the importance of matching your autofocus settings to your subject's movement. By practicing specific tasks, you'll gain confidence in capturing sharp images of both static and moving subjects.LEARNING OBJECTIVES * Understand the difference between autofocus modes and when to use them * Develop skills in tracking moving subjects with appropriate focus settings * Learn to prioritize focus points to achieve sharp images in various scenariosWANT FEEDBACK ON YOUR ASSIGNMENT?Join Foundation Plus and get personalised monthly critique plus full access to all assignments.Learn More & Join Download Assignment PDF BEFORE YOU SHOOT * Familiarize yourself with your camera's autofocus settings and modes * Select a suitable location with dynamic subjects (e.g., people, wildlife, sports) * Set your ISO to a fixed value of 200 for consistent exposure * Ensure your lens is clean to avoid distortion in your images * Practice locating and selecting focus points manually on your cameraTHE ASSIGNMENTTECHNI a suitable location with dynamic subjects (e.g., people, wildlife, sports) * Set your ISO to a fixed value of 200 for consistent exposure * Ensure your lens is clean to avoid distortion in your images * Practice locating and selecting focus points manually on your cameraTHE ASSIGNMENTTECHNICAL FOCUS * Use AF-C (Continuous AF) mode when photographing moving subjects * Select a single point focus area for precise control over your focus point * Utilize back-button focus for better timing and to avoid focus-recomposing errors * Maintain a shutter speed fast enough to freeze motion based on your focal length * Experiment with different focus area settings (e.g., zone, expanded) based on subject sizeCREATIVE FOCUS * Capture portraits by focusing on the subject's closest eye for sharpness * Try to anticipate the movement of your subject and pre-focus on expected points of action * Play with depth of field by using aperture priority to isolate your subject from the background * Use leading lines to direct attention towards your focused subject in the composition * Experiment with different angles and distances to find unique perspectives on your subjectsASSIGNMENT TASKS 1. Use shutter priority mode at 1/500s with ISO 200 fixed to capture a moving subject like a cyclist or a pet in action. 2. Set your camera to aperture priority mode at f/2.8 with ISO 200 fixed, and photograph a portrait, ensuring to focus on the nearest eye. 3. In a crowded area, use AF-C mode with a single point focus to track a moving child playing in the park. 4. Practice using back-button focus while shooting a bird in flight, utilizing shutter priority mode at 1/1000s with ISO 200 fixed. 5. Find a subject with repetitive movement (like a dancer) and use aperture priority at f/4 with ISO 200 to capture sharp images while blurring the background. 6. Set your camera to AF-C mode and photograph a car driving by using shutter priority at 1/250s with ISO 200 fixed, ensuring to keep the leading edge of the car in focus.💡 Stretch Tasks * Challenge yourself to capture a sports event using a zone focus area setting to track multiple players in motion. * Create a series of images with varying depth of field while focusing on the same subject, switching between different aperture settings.DO / DON'TDO * ✓ Do match your autofocus mode to your subject's movement (AF-C for moving subjects). * ✓ Do prioritize the eye as the focus point when photographing people. * ✓ Do practice using different focus areas to see which works best for various subjects. * ✓ Do keep your camera steady using a tripod or stabilizing techniques, especially at slower shutter speeds. * ✓ Do review your images after shooting to assess focus accuracy and make adjustments for next time.DON'T * ✗ Don't rely on focus-recompose techniques when using wide apertures, as this can lead to missed focus. * ✗ Don't use AF-S mode for subjects that are in motion, as it will not track them effectively. * ✗ Don't set your ISO to auto; keep it fixed at 200 for consistent exposure. * ✗ Don't forget to check your focus point before taking a shot, especially in crowded scenes. * ✗ Don't shoot without considering your shutter speed relative to your focal length to avoid motion blur.REFLECTION QUESTIONS * How did changing autofocus modes affect your ability to capture sharp images of moving subjects? * What challenges did you face when trying to focus on the nearest eye",
  "wordCount": 760,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/focus-modes-and-tracking#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/focus-modes-and-tracking#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}