{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/haiku-with-a-picture-shahai#blogposting",
  "headline": "the traditional pairing of a haiku with a picture - Shahai",
  "alternativeHeadline": "the traditional pairing of a haiku with a picture - Shahai | Alan Ranger Photography",
  "description": "Shahai is a less familiar term than haiga – the traditional pairing of a haiku with a picture, which dates to the times of early Japanese prints.",
  "url": "https://www.alanranger.com/blog-on-photography/haiku-with-a-picture-shahai",
  "datePublished": "2022-08-18T00:00:00.000Z",
  "dateModified": "2022-08-18T00:00:00.000Z",
  "dateCreated": "2022-08-18T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "the traditional pairing of a haiku with a picture - Shahai Shahai is a less familiar term than haiga – the traditional pairing of a haiku with a picture, which dates back to the times of early Japanese prints. Shahai is a haiga where the picture is a photographic image, and this modern interpretation creates striking and expressive work! HAIKU I am pleased to announce that I am working on a second collaboration with Karen and Alan, who run “Call of the Page” courses. I will provide the photographic critique for those enrolled on the six-assignment course starting 1st Sep 2022 and ending 1st Dec 2022. There are limited places left so if you fancy trying your hand at creating a short poem to overlay onto your own photograph, don’t delay. Course Description: Shahai is a less familiar term than haiga – the traditional pairing of a haiku with a picture. Shahai is a haiga where the picture is a photographic image. There are different ways and styles of making shahai, and in this course we concentrate on landscape photography, with the poems added onto the picture, or under it, in graphic text. It's a longer shahai course than we have run before, and that is because the aim is to make a small portfolio of six pieces of work. There is an optional pre-assignment to help guide you in making choices about how your work will come together. Format: Participants submit a shahai every two weeks. These are added to a dedicated online gallery, which is private to the course participants, where the poetry tutor and the photography tutor will add feedback notes in the intervening weeks. We will have an informal review at the end of the course, where participants can re-upload their work to show each other changes that they might have made after the feedback. More Course Information Marcie Wessels Shahai from the last course. newsAlan Ranger18 August 2022Alan Ranger Photographynews LinkedIn0 Pinterest0",
  "wordCount": 327,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/haiku-with-a-picture-shahai#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/haiku-with-a-picture-shahai#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}