{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/hartland-quay-devon-coastal-workshop#blogposting",
  "headline": "North Devon Coastal Workshop | Why I love Hartland Quay",
  "alternativeHeadline": "North Devon Coastal Workshop | Why I love Hartland Quay | Alan Ranger Photography",
  "description": "Hartland Quay in Devon has been one of my favourite coastal locations for photography.",
  "url": "https://www.alanranger.com/blog-on-photography/hartland-quay-devon-coastal-workshop",
  "datePublished": "2020-05-20T00:00:00.000Z",
  "dateModified": "2020-05-20T00:00:00.000Z",
  "dateCreated": "2020-05-20T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "North Devon Coastal Workshop | Why I love Hartland Quay Hartland Quay in Devon has been one of my favourite coastal locations for photography. Since my first visit there, 8 years ago, in 2011, I have returned nearly every year since to run workshops on this x-rated coastline. It has a special connection for me because it’s the location that two images were taken for my first, of three that year, award-winning entries into the Landscape Photographer of the Year competition back in 2013. Landscape Photographer of the Year - 2013 Hartland Quay certainly isn’t an easy terrain to access and it’s not suited to those who are a little unstable on their feet or are not able to walk and step across large boulders. However, for those who are reasonably confident the short scramble across the boulders and rocks rewards you with endless amazing composition opportunities and the chance to practise various exposure times to create wonderful water movement between the long sculptured rock formations. We normally try to include the Hartland Quay shoreline three or four times depending on weather and tide times, but there are also plenty of less hazardous areas on the beach and cliff faces if you prefer something more sedentary. View fullsize Rock Formations on the beach Or maybe you can focus on bigger vista shots looking over to Lundy Island or the cliff face from the safety of the beach or from the views from around the hotel where we stay. Sunrise and sunset light can be amazing at Hartland and it’s literally a roll out of bed to be on the beach to maximise the shooting time. If we get the right light and tide combined then Hartland is hard to beat for drama and coastal photography. I am still very proud that this image is used for the pub sign (my only pub sign to date) on the cliff edge “Wreckers Retreat” Pub Sign with my image taken in 2011 Whilst Hartland itself is a feature of the weekend workshop and will be our base we also explore other parts of the North Devon Coastline too. In between tide times, we visit nearby spots that provide a rest-bite from incoming tides and allow you to work under less time pressure and at a more relaxed pace. Sandymouth, for example, has some amazing shoreline and provides a different proposition of seaweed and rock; Croyde also has some great rocks that slither into the wash Sandymouth When the tide is out we work on using whatever light, contrast and style works for the shoreline Croyde Westward Ho Other locations are equally fruitful Heddons Mouth Places Small Groups - Maximum 3 x All Inclusive + 3 x Tuition Only - (minimum of 3 attendees) Suitability This particular seascape workshop is suitable for those who are comfortable with stepping over boulders and rocks or happy to work on other beach areas that don’t require that hazardous journey. It is suitable for any level of photographer and skill level as you will receive one to one tuition throughout the workshop. Workshop - Included in price £475 • Travel to and from locations and back to the rendezvous point (all inclusive only) B&B in a room with private bathroom or ensuite (all inclusive only) All photographic tuition and advice to help you make those shots One to one tuition throughout the event Image feedback and post-processing advice is given throughout the event Excluded in price Cancellation insurance Equipment insurance Lunches Evening Meals Drinks Typically we start the day at Hartland Quay and meet for breakfast at the Hartland Quay Hotel which resides on the cliff edge overlooking the spectacular shoreline. After some time working the rugged shoreline and beach we move onto a second location - this will depend on wishes of group, tide times and weather but Clovelly harbour is normally a favourite spot for lunch and some different shots. The afternoon we have more choices to shoot at several local beaches and can choose depending on whether you want rock formations or sand patterns... The Sunday we head part way back and can stop at Croyde, Heddon or any one of the great coastal spots depending on the requirements of the group - choices are sand dunes, large sweeping sandy beaches, large boulder and pebble beaches or rivers and waterfalls that join the sea. Seascape Photography Itinerary - Hartland Quay Likely locations include: (A detailed itinerary will be provided 5-7 days ahead of workshop that will take into account weather/tide times (if applicable) and any other local seasonal factors.) Hartland Quay Bude Clovelly Welcombe Bay Saunton Sands Coombesgate Woolacombe Day 1 - Hartland Quay Travel from Coventry rendezvous point at the specified time or Meet on location at the specified time Workshop introduction and briefing Location shoot Lunch Break Check-in Hotel/B&B Optional sunset shoot - depending on light/time of year/forecast Evening meal - optional picture reviews Day 2 Possible sunrise shoot - depending on light/time of year/forecast Breakfast Workshop briefing End of workshop/depart I also have spare filters that can be used to try out long exposure and balancing light to create better exposures and creative effects. Next dates for Hartland Quay - Hartland Quay North Devon Workshops Sat/Sun - 11th-12th May Sat/Sun - 31st Aug-1st Sep If you are interested in either of these photography workshops, please contact me to ask any questions. All my photography workshops cater for all levels of experience and personal support throughout the workshop forms part of the service. photography-workshopsAlan Ranger20 May 2020Alan Ranger Photography LinkedIn0 Pinterest0",
  "wordCount": 928,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/hartland-quay-devon-coastal-workshop#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/hartland-quay-devon-coastal-workshop#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    },
    {
      "@type": "Thing",
      "name": "Seascape photography"
    }
  ]
}