{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/help-portrait-uk-coventry-school-shoot#blogposting",
  "headline": "Help Portrait - UK-Coventry-School-Shoot | Giving Pictures  ",
  "alternativeHeadline": "Help Portrait - UK-Coventry-School-Shoot | Giving Pictures   | Alan Ranger Photography",
  "description": "Our first Help Portrait shoot in Coventry. My crew gave up their time, expertise and equipment to shoot 25 family portraits in a local school | Photography Blog.",
  "url": "https://www.alanranger.com/blog-on-photography/help-portrait-uk-coventry-school-shoot",
  "datePublished": "2017-07-07T00:00:00.000Z",
  "dateModified": "2017-07-07T00:00:00.000Z",
  "dateCreated": "2017-07-07T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "PORTRAIT - UK-COVENTRY-SCHOOL-SHOOT | GIVING PICTURESI'm really pleased to report on our first Help-Portrait shoot in Coventry. Last night, 4th July 2017, my crew gave up their time, expertise and equipment to shoot 25 family portraits in a local school.Help Portrait is a global movement of photographers, hairstylists and makeup artists using their time, tools and expertise to give back to those in need.Help-Portrait is about GIVING the pictures, not taking them. These portraits aren’t for a portfolio, website, or sale. It’s about giving people who otherwise couldn’t afford photography, a chance to capture a moment, a memory…and a whole lot more. Read more about Help-Portrait-UK-Coventry here: Although the International Help-Portrait day isn't until 2nd Dec 2017, my team was keen to hold an event before that date to test, hone their skills and most importantly use everyone's expertise to hold the first event for the school that is in a disadvantaged area of Coventry. ----------------------------------------View fullsize----------------------------------------The team, Joyce James, Chris Shaw, Kirsten Pearce, Nicholas Jones and Ellen Shaw came together to shoot 25 family portraits, edit, print and mount the images in a 2hr window so that the families could take their photo's home the same night after their sports award presentation evening event.BEHIND THE SCENESView fullsize2 identical s Pearce, Nicholas Jones and Ellen Shaw came together to shoot 25 family portraits, edit, print and mount the images in a 2hr window so that the families could take their photo's home the same night after their sports award presentation evening event.BEHIND THE SCENESView fullsize2 identical shooting rigsView fullsizeFamily viewing their photo before printingView fullsizeNick and Kirsten - SharpshootersView fullsizeTethered workstationsView fullsizeNick in actionView fullsizethe shooters eagerly waiting for a family----------------------------------------I can't honestly say that everything worked like clockwork but despite the odd technical glitch and challenge of framing large groups against a small backdrop, we managed to pull it off and made a professional portrait print from start to finish in 10mins for each family.Most importantly, of course, was the pleasure we all got from seeing the smiling faces of the families as they collected their printed photos.----------------------------------------FAMILIES COLLECTING THEIR PRINTSView fullsizeView fullsizeView fullsizeView fullsizeView fullsize----------------------------------------SELECTION OF PORTRAITS TAKEN ON THE NIGHTView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsizeView fullsize----------------------------------------THANK YOUI'd like to thank Jeanette, the Head Teacher, for allowing us to run the event at the school and for supporting us with her staff on the night, they all helped to make the night a great success.A special thank you to Simon Newton and the Xposure Photography Festival team in Sharjah for sponsoring us and contributing towards the kit. Your support is really appreciated by all those involved with the project and receiving the prints.Finally but of course not least, my shooting crew who all performed wonderfully to bring everything together for the event.If you would like to get involved in the Help-Portrait movement then please make contact with me. Our next event is on 2nd Dec 2017 where we will be shooting portraits with Crisis Skylight in Coventry at a centre for the homeless.We will need lots of volunteers for the 2nd Dec event as expect to run it over 12hrs so even if you can only spare a couple of hours to support please do let me know. We will need volunteers who can; * Make-up and hair * Shoot, Edit, Print & Mount Photos * Help with refreshments and organisation * Just give a smile and be there to chat and listenDetails for 2nd Dec 2017 Event can be found here: If you would like to make a donation to Crisis that would be appreciated. JustGiving Page ----------------------------------------news Alan Ranger 7 July 2017Alan Ranger Photography news , help-portrait LinkedIn0 news , help-portrait LinkedIn0 Pinterest0",
  "wordCount": 619,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/help-portrait-uk-coventry-school-shoot#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/help-portrait-uk-coventry-school-shoot#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Photography"
    }
  ]
}