{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/help-portrait-coventry-report#blogposting",
  "headline": "Help Portrait - Coventry Report | Giving Pictures Not Taking",
  "alternativeHeadline": "Help Portrait - Coventry Report | Giving Pictures Not Taking | Alan Ranger Photography",
  "description": "BackgroundJust over a year ago, whilst thinking about new year resolutions and things I wanted to do in 2017, I came across the Help Portrait movement.",
  "url": "https://www.alanranger.com/blog-on-photography/help-portrait-coventry-report",
  "datePublished": "2017-12-07T00:00:00.000Z",
  "dateModified": "2017-12-07T00:00:00.000Z",
  "dateCreated": "2017-12-07T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Help Portrait - Coventry Report | Giving Pictures Not Taking BackgroundJust over a year ago, whilst thinking about new year resolutions and things I wanted to do in 2017, I came across the Help Portrait movement. Help Portrait is a global movement of photographers, hairstylists and makeup artists using their time, tools and expertise to give back to those in need. Help Portrait is about GIVING the pictures, not taking them. These portraits aren’t for a portfolio, website, or sale. It’s about giving people who otherwise couldn’t afford photography, a chance to capture a moment, a memory…and a whole lot more. Photography has always been something that is an expression of individual perspective, values and interpretation for me. Images that don't convey a narrative or have a reason for personal connection simply don't resonate or hold my attention. I wanted to connect what I do for a living, in the community I live in with people I encounter and feel compassion for. The idea was simple if I cannot go and photograph refugees or victims of famine, war and other injustices then I should at least start at home and use my skills to raise awareness, inform and give photography back to those who could not afford it. In the process, I aimed to give people, volunteers and recipients, some dignity, respect and sense of how a photograph can make a difference on many levels. I proposed the idea to my Facebook Client Group (Alan Ranger Photography) and was delighted that there were a number of people who wanted to support the idea. What followed over the next six-nine months were many meetings and sometimes resistance to my insistence to plan methodically and set the bar high on execution. I'm pleased to say that despite my initial fears about who, how, when, why were largely academic. However, I am also confident in saying that the team, collectively, through my nagging and pushing did rise to the challenges I set and have produced the most wonderful outcome for the people we aimed to reach and support. Xpsoure Through my association with Xposure International Photography Festival, we managed to secure sponsorship that meant equipment and consumables were financed. Their support financially and ethically is so appreciated and we cannot thank them enough for everything they have provided that has ensured that a great idea didn't get beached due to financial resources to provide what we needed. Who to support? After the initial idea was hatched about photographers and others providing their skills, expertise and time to provide people in need with a special day, we had the task of identifying a group of people. Having previously worked with Crisis Skylight in Coventry on Christmas Day to provide homeless people a special day, it occurred to me that whilst my time on the day was helpful, my skills and experience were not really utilised by serving cups of squash and dinners. Don't get me wrong, I was and am happy to do whatever is needed to provide vulnerable people with what is needed. However, I felt that more could be done and I could be put to even better use. So Crisis Skylight in Coventry became our target group of people to provide a professional portrait print and whatever other services we could combine to make it a special day. Crisis Skylight Coventry Crisis Crisis Skylight Coventry and Warwickshire is an outreach service that works with homeless individuals and those at risk of homelessness.Based in the city centre, they deliver their services throughout Coventry in various venues including those provided by partners. Crisis Skylight come into contact with over 600 people a year in Coventry. Homelessness in all its guises is sad. Not everyone is a rough sleeper and many people find themselves with no fixed abode for many reasons: Individual Reasons: • Leaving an institution Relationship breakdown Substance misuse Physical or mental health problems Escaping a violent/abusive relationship Structural Reasons: Welfare reform and benefit cuts A low pay weakened job market Reduced access to affordable housing market Photographs - Document, Inform, Educate and Express It makes me really sad that anyone in this century ends up with such insecurity, judgement and resulting low self-esteem due to circumstances, government policy and the lack of support. My view may be simplistic, we are born equal as human beings and deserve to be given opportunities and most importantly self-respect whatever our personal circumstances and upbringing, but clearly today's society has become polarised between the haves and have-nots. Help Portrait Be it mental health, relationship issues/consequences, education, welfare state cuts and access to the support that each individual needs to make a better life, we all live in the same community, share the same streets, shops and services but most importantly all want an improved standard of living and life. I feel that it benefits society as a whole if everyone in it feels they are part of it and is contributing in any way they can and gets the support they need to progress themselves and their communities further. My thoughts were idealistic maybe but also heartfelt and I know those that supported the event shared the same feelings of outrage, compassion and wanting to do something that gave vulnerable people who had fallen on bad times some hope dignity and self-worth again through the power of a photograph. Quote from Crisis Team on the event Help-Portrait was one of our highest attended activities in the 4 and a half years we have been running in Coventry & Warwickshire. We managed to engage the most entrenched and hard to reach homeless people in the region and our team were amazed and overjoyed at the turnout. For further support:Rehab Recovery - a free helpline and advisory service for people experiencing issues with substance misuse. Telephone: 0800 088 6686 The event Saturday 2nd December - Help-Portrait, organised by Alan Ranger Photography, sponsored by Xposure and partnered by Crisis Skylight and The Salvation Army. The Stats: 30 Volunteers - made up of 10 Photographers, 3 Hair Stylists, 2 Make-up Artists, and 15 friends/supporters gave their time and skills to provide. 35 homeless people had haircuts/hair styling 23 homeless people had make-overs and makeup 58 homeless people with a professional portrait print and a digital version for download Homeless gender mix 22 Women (38%), 36 (62%) Men from the Coventry and Warwickshire area £945 raised (to date) for Crisis Services provided on the day: Sandwiches, soup, drinks and cakes Hairstyling and makeover Professional portrait print + digital download Clothes and gifts to take away (donated by team and public) Crisis registration/contact for further support A venue (Salvation Army) to host the event and provide homeless people a day to remember. A friendly reception, compassionate attitude and respect to their situation and needs. Feedback from Crisis The care, attention and dignity that Alan and his team of volunteers showed the guests was truly inspiring and the transformation and boost in their confidence is something we will never forget. The atmosphere throughout the day was electric and our members were so proud of their portraits that they can now go on to give as gifts, help them to find work or just keep with them as a memory of such a wonderful day. The feedback from the guests has demonstrated an increase in confidence, trust and relationships with others. These are some of the things that we work on improving with our members every day so the Help Portrait activity has really helped us in carrying out our aims with the individuals we support. Following the huge success of the day, we are hoping to provide ongoing support to the individuals who attended. Help Portrait has certainly done its bit in supporting us in our mission to end homelessness and we are very proud to have been a part of the event Feedback from Guests “(it has) lifted me up a lot, it has given me a boost” “being pampered, paying attention to myself, having my hair and beard groomed. Having a portrait photograph of myself was the ultimate” “Enjoyed the makeover and haircut (it) made me feel really good, thank you” “It’s been nice to have a haircut and get a photo for my mum. Really good morning” “well and truly enjoyed it today, would recommend to everyone” Feedback from Volunteers: \"It was a really special day Alan and I felt really lucky to be involved\" \"Such a privilege to be involved\" \"Really successful and worthwhile day, very happy to have taken part in it.\" \"loved it can't wait to see all the photos\" \"A lovely event and experience\" \"Thank you for asking me to be part of such a great day\" \"Great day. Proud to have been part of it\" \"Really good day - I’m so pleased to have been involved\" A selection of shots from the day behind the scenes - All shots available here What's Next... In the process of organising this event, we also set a target of raising £1000 for Crisis to support homeless people in their step to move on to something better, To date, we have raised £875 which is fantastic (thanks to all those who have already contributed) You don't need me to tell you that every penny makes a difference, so if you have read this post and something in it resonates please make a donation - www.justgiving.com/fundraising/help-portrait-uk-coventry Personally speaking, I will be giving my time and experience on Christmas Day to support Crisis Skylight - and the homeless in Coventry, so why don't you get in touch with your homeless support group in your area and discuss how you can support and provide invaluable expertise to help vulnerable community members move forward to a better life and more hope. What can you do to support? Please share this blog post on social media (Facebook, Instagram, Twitter, Google etc.) Make a donation yourself and ask others to make a donation Contact me if you want to get involved in the next event in Coventry Organise an event in your own community Use photography to inform, educate, document and express Thanks There are so many people to thank individually I'm afraid I'll miss someone by accident but the event could not have taken place without the efforts and support of so many people, not just on the day, but in the lead up to organise, manage issues and collect donations, gifts and be part of the whole thing even if not in person on the day. Photographers Joyce James Kirsten Pearce Laura Byrne Jacki Rosin Chris Shaw Nick Jones Rob Edwards Con McHugh Hair and Makeup Jill Shipway Rebecca Bloor Wayne Tapp Nicki Stobbs Carla Solvason Other Support Derryn Ciesla Dunstan Vavasour Rachel Pardner Stuart Berry Gemma Potter Kirsty Millard Philippa Holdroyd Melanie Goolding Charlotte Aldridge Plus all the others who contributed with providing cakes and clothing/books and support on the day from the Crisis Team and others. Disclaimer All photos published have the consent of individuals. Any reproductions/publishing of images of individuals identifiable cannot be shared or used without the express permission of Alan Ranger Photography, otherwise, the individual who is publishing will be liable in the event of sharing photos and any subsequent claim. Help-Portrait is about “give the photos, not to ask for anything in return, not to use the photos in portfolios” newsAlan Ranger7 December 2017Alan Ranger Photographyhelp-portrait LinkedIn0 Pinterest0",
  "wordCount": 1902,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/help-portrait-coventry-report#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/help-portrait-coventry-report#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Photography"
    }
  ]
}