{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/histogram-and-exposure-review#blogposting",
  "headline": "Histogram and Exposure Review Photography Assignment",
  "alternativeHeadline": "Histogram and Exposure Review Photography Assignment | Alan Ranger Photography",
  "description": "Learning Objectives • Understand how to read histograms to assess exposure levels in images.",
  "url": "https://www.alanranger.com/blog-on-photography/histogram-and-exposure-review",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Learning Objectives • Understand how to read histograms to assess exposure levels in images. • Learn to use aperture priority or shutter priority modes effectively to control exposure. • Practice evaluating and adjusting settings based on histogram feedback. Want feedback on your assignment? Join Foundation Plus and get personalised monthly critique plus full access to all assignments. Learn More & Join Download Assignment PDF Before You Shoot • Familiarize yourself with your camera's histogram display settings. • Set your camera to either aperture priority or shutter priority mode. • Fix your ISO at 200 to maintain consistent exposure across tasks. • Choose a location with varied lighting to test your exposure skills. • Bring a notebook to record your observations and histogram readings. The Assignment Technical Focus • Understand the shape and distribution of the histogram for optimal exposure. • Learn how to identify clipping in the histogram and its implications. • Practice adjusting exposure compensation based on histogram feedback. • Explore the differences in histograms between images with varied depth of field or motion. • Use the camera’s tools to overlay histogram data while shooting. Creative Focus • Experiment with different aperture settings to create varying depth of field while monitoring the histogram. • Use shutter priority mode to capture movement and analyze resulting histogram data. • Incorporate foreground elements to enhance compositional balance while observing exposure. • Try shooting during different times of day to observe how light affects histogram results. • Combine creative framing techniques with exposure adjustments to see their effect on the histogram. Assignment Tasks • Use aperture priority mode at f/4 with ISO 200 fixed, allowing the camera to adjust shutter speed. Capture a portrait and evaluate the histogram for highlights and shadows. • Use shutter priority mode at 1/1000s with ISO 200 fixed to freeze action. Photograph a moving subject and assess the histogram to ensure proper exposure. • Select a brightly lit outdoor scene and use aperture priority mode at f/2.8 with ISO 200. Observe the histogram and ensure you're not clipping highlights. • In a dimly lit environment, switch to shutter priority mode at 1/60s with ISO 200 fixed. Capture a still life and analyze the histogram for shadow details. • Experiment with a backlit subject using aperture priority mode at f/5.6 and ISO 200. Check the histogram to ensure the subject is properly exposed without losing background detail. • Take a series of photos in varying lighting conditions using shutter priority at 1/250s with ISO 200. Compare histograms to see how exposure changes with light. 💡 Stretch Tasks • Create a series of images focusing on different subjects (e.g., architecture, nature, people) using both priority modes. Analyze and compare how the histogram differs across subjects. • Conduct a low-light photography session using aperture priority mode at f/1.8 with ISO 200. Capture images and assess histograms to adjust your technique based on results. DO / DON'T DO • ✓ Do check your histogram after each shot to understand exposure. • ✓ Do experiment with different subject distances to see how depth of field affects histograms. • ✓ Do use the exposure compensation feature to adjust for tricky lighting situations. • ✓ Do take notes on your settings and histogram results for each shot to track your progress. • ✓ Do review your images on a computer screen to analyze histogram performance in detail. DON'T • ✗ Don't ignore clipping indicators on the histogram; they can lead to lost details. • ✗ Don't shoot in manual mode for this assignment; focus on priority modes. • ✗ Don't set your ISO to auto; keep it fixed at 200 for consistency. • ✗ Don't rush through your shots; take time to assess and adjust each image's exposure. • ✗ Don't rely solely on the camera's LCD for exposure feedback; always check the histogram. Reflection Questions • How did your understanding of exposure change after using the histogram? • What challenges did you encounter while trying to achieve proper exposure with priority modes? • In what scenarios did you find the histogram particularly helpful or confusing? • How might you apply the lessons learned about histograms in future photography projects? 📚 Related Reading Before you start, read these related blog posts to deepen your understanding: • → What Is Dynamic Range In Photography • → Exposure Bracketing A Guide For Photographers For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus. Alan Ranger23 November 2025Technical Foundations LinkedIn0 Pinterest0",
  "wordCount": 769,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/histogram-and-exposure-review#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/histogram-and-exposure-review#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}