{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/how-to-become-a-better-photographer#blogposting",
  "headline": "Seven Tips On How To Become A Better Photographer?",
  "alternativeHeadline": "Seven Tips On How To Become A Better Photographer? | Alan Ranger Photography",
  "description": "Seven Tips On How To Become A Better Photographer.",
  "url": "https://www.alanranger.com/blog-on-photography/how-to-become-a-better-photographer",
  "datePublished": "2021-06-01T00:00:00.000Z",
  "dateModified": "2021-06-01T00:00:00.000Z",
  "dateCreated": "2021-06-01T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Seven Tips On How To Become A Better Photographer? It’s time to break some myths and see an improvement in your photography. Try these simple, practical exercises to HOW TO BECOME A BETTER PHOTOGRAPHER. today. Want to become a better photographer? Discover simple exercises to improve your skills and debunk common photography myths. Start your journey today. Also, take a look at my 5-steps-to-improve-your-photography HOW TO BECOME A BETTER PHOTOGRAPHER? • Stop obsessing over settings and gear It’s natural when you’re learning a new skill to obsess about the technicalities, equipment and techniques. Whilst these are important elements in building know-how and confidence they can also become a barrier to your creativity if you over-think, over purchase and over obsess about your camera settings and gear. View fullsize Don’t Obsess Over Settings and Gear Will better a camera, lenses and other gear make me a better photographer? To a degree, all these things will help to produce better results, but with the limitation of the skill of the person behind the camera. It’s a balance between investing in the right gear and the right study. If you have money to spare then throwing it at gear, expensive foreign workshops in iconic locations may help you to build a portfolio of images. However, great photos are great because of the photographers awareness and skill not because they shot the image using any specific piece of equipment on a certain setting. 2. Practise - at least weeklyLearning any new skill, be it driving, playing an instrument or attending a weekly fitness class requires commitment and effort on your part to see improvements. Photography is no different, you have to practise on a regular basis in a disciplined way if you want to improve. Monthly Photography Study Plan Schedule time for your photography into your weekly routine. Your photographic study can take several forms. Actual shoot time, editing time, sharing and feedback time, research time, class time and so on. The key to see progress is to build the practice and participation into your busy life schedule. Study time can be as little as 15 mins to a few hours or more so try to plan time to address different areas of your photographic development. See | Design | Shoot | Enhance | Share 3. Ask for feedbackGetting constructive feedback from photographers you respect and whose work you connect with is an invaluable way to improve. We all have blind spots, technically and creatively, other people’s observations can often reveal and spot something that wasn’t obvious to us. This is essential feedback on how to become a better photographer. Critique is better than praise The number of social media likes doesn’t determine the quality of your photo. It’s very easy to feel good about a photo shared on social media when you receive lots of likes and lovely comments of praise. However, these signals don’t really add much value, other than to the ego, and certainly don’t help you improve. There are plenty of online sites that you can post photos to where constructive feedback is given if asked for. I’d advise engaging with those groups where this is the aim rather than a popularity contest. The best feedback I ever receive is when someone, I respect, posts balanced and constructive feedback on my image, In fact, the observations from peers and masters has caused me to reconsider, adjust and learn from their inputs in a way I just wouldn’t have been receptive to if my mindset was closed. 4. Read your camera manualIf you’re obsessing about how your camera operates and finding settings then your cognitive capacity is being diverted away from your subject and creativity. How much time do you burn in the moment trying to find a setting, a button and option in the menu system? Get to know your camera system inside out if you want to learn how to become a better photographer. Operating Guides are never easy reading You need to tackle it systematically Camera manuals concentrate on what rather than why. I remember the feeling of confusion and frustration when I first attempted to read a camera manual. The jargon, this button does this but no explanation of why you would use a setting. It is a bit of a chicken and egg scenario because unless you understand what “aperture is and does” (as an example) then knowing how to change it doesn’t really help when you’re a beginner. The good news is that these days there are plenty of easy to follow books and on-line guides and videos to help you understand and learn about your camera inside out. It might take you a little research to find the right medium and tutorial for you and your camera model but it will be worth every minute and pound spent if it means you get the most from your camera’s ability and features. 5. Shoot with other photographersIf you are one of those who only takes the camera out when with the family or non-photography friends then you will know the scenario… “how long does it take to take a photo?” It’s frustrating for you and them so make time to pursue your hobby and interest in photography with those who share your passion. Learning with like-minded people is essential on how to become a better photographer. Don’t miss the shots you should have got Going out with other photographers is educational and fun. When you meet up with other photographers, either formally on an organised photography workshop or informally through a social group, network or friend, the opportunity to learn from others and have the time to consider every shot without the pressure of a clock ticking and rolling eyes of a family member targeted at your creative activity. Taking photos, which is what non-photographers do, is very different from making photos. Making a photo is about considering many elements of light, settings, composition and having a clear intention for the photo. Working alongside other photographers creates an environment where everyone is working individually with time and patience but also with the option to collaborate and share with like-minded people. 6. Learn from your mistakesIt’s easy to look for excuses about why you took the shot with those settings or that composition and so on. All those reasons maybe genuine and unavoidable at that moment in time. However, recognising the opportunities to improve and not repeat the errors that could have been dealt with are the golden nuggets of improvement. This was one of my biggest but game-changing elements to how to become a better photographer. Learning from mistakes Make problem solving a habit. I have lost count of the amount of times I have come back from a shoot and reviewed images from the day/weekend and culled a large proportion of them. It still happens today, despite my experience, but less often than previously, which is the important point. Digital photography undoubtedly means we take/make more photos than ever before, but how many of us spend the time on the mistakes (those we chose to delete) analysing the why rather than just saying to ourselves “it doesn’t cut the mustard” but why not? Often the answers are for obvious reasons, focus point, depth of field, camera shake or subject movement, flat lighting and and array of reasons, but ultimately we decided to press the shutter at that moment in time so, presumably, had some level of control an input into the photo making process. Right? Well, yes that’s how it’s supposed to work but we often chance things and see how it turns out. That’s great in my view, as photography should be free from to many rules and text-book settings. However, it shouldn’t be about shooting hundreds of frames randomly in hope that one might be good, instead of the spray approach I have found that opening up the mind to some simple principles of keeping some discipline but not restricting creativity usually yields the best returns. When i get home and review the results I always want to look and examine and analyse the failed shots as much as I want to relish the good shots. 7. Get professional tuitionThere are lots of individuals and “companies” offering photography training, just search online and you will see the array of options offering you classes, workshops and courses claiming to address all your needs. Of course, I am one of those listings, but with a difference! I am not just a professional photographer with awards and accolades, I have also invested in training to become a qualified photography tutor. Professional Photography Tuition Learn from a professional, not amateur. Being a great photographer doesn’t necessarily mean you are a good teacher. When I started out as a photography tuition business six years ago I thought it was simply a case of showing my work and inspiring other to join me. It wasn’t long before I realised I needed to be more than just a “decent” photographer to inspire and educate others. Over the last six years I have made education my focus. Creating structured courses, workshops outcomes and running a photography tuition business has forced me to re-evaluate how I share my knowledge and experience in a formal and repeatable way. Enrolling on a course or workshop is a commitment for the student and tutor, so ensure both objectives are aligned before you part with your cash.Just look at my customer reviews and feedback to see the evidence on how to become a better photographer. Remember to visit my photography blog page for free tips, information, advice and the latest offers. More Free Photography Tips Take the free online colour test - how good is your vision? Find out how good your vision is with the free online colour test. Take the Munsell 100 Hue Test and discover if you have any colour vision deficiencies. Read More → What Are LEADING LINES in Photography: A How-To-Guide What Are Leading Lines In Photography: Do/don’ts and a 15-minute field exercise. Download the 1-page checklist or book a 30-min composition clinic for feedback What do CAMERA LENS FILTERS DO: A Guide for Beginners What do camera lens filters do? This guide walks you through UV filters, ND Filters, Polariser Filters and Graduated filter systems and my best suggestions 11 What is WHITE BALANCE in photography: A Beginners Guide Learn What is WHITE BALANCE in photography, how Kelvin and Tint fix colour casts, handle mixed light, and grab the free 1-page checklist for skin tones. What is CONTRAST in Photography: A Guide for Beginners What is Contrast in Photography?: Explore the use of contrasts and how to use contrast in photography. Light, Colour, texture and essential contrasts for impact Unlocking the Art of MACRO PHOTOGRAPHY: Techniques and Tips Unlocking Macro Photography: Techniques & Tips: Discover the art of macro photography with tips for sharp focus, lighting mastery, and creative exploration. Finding Your Compositional Balance: A Guide For Beginner's Master Compositional Balance with a free 1-page checklist. Learn symmetry, asymmetry, golden ratio and visual weight to create stronger, harmonious photos. 10 What is DYNAMIC RANGE in photography: A Beginners Guide Struggling with highlights and shadows? Discover What is DYNAMIC RANGE in photography and grab the free 1-page PDF checklist with field tips and HDR help. photography-tipsAlan Ranger1 June 2021Alan Ranger Photographytips LinkedIn0 Pinterest0",
  "wordCount": 1893,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/how-to-become-a-better-photographer#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/how-to-become-a-better-photographer#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}