{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/how-to-find-your-photography-style#blogposting",
  "headline": "How to find your Photography Style: Identify and Develop it",
  "alternativeHeadline": "How to find your Photography Style: Identify and Develop it | Alan Ranger Photography",
  "description": "This guide explains how to uncover your personal style by analysing your work, experimenting, and refining a consistent visual voice.",
  "url": "https://www.alanranger.com/blog-on-photography/how-to-find-your-photography-style",
  "datePublished": "2025-07-06T00:00:00.000Z",
  "dateModified": "2025-07-06T00:00:00.000Z",
  "dateCreated": "2025-07-06T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "This guide explains how to uncover your personal style by analysing your work, experimenting, and refining a consistent visual voice. 3 key takeaways • Understand: Spot recurring themes in your favourite images and identify what draws you to them. • Experiment: Try new genres, techniques, and edits to explore different creative directions. • Refine: Build a cohesive portfolio and editing style that communicates your unique vision. Table of Contents Show Discover Your Default Photography Style Take a short, no-pressure quiz to see which styles you naturally gravitate toward, plus quick tips to improve your next shoot. Sample Questions • Which equipment are you most likely to reach for? A) Portrait lens B) Fast street lens C) Wide-angle D) Telephoto E) Macro • What scene are you most drawn to? A) Candid city moment B) Mountain vista C) Portrait with story D) Delicate flower E) Wildlife in action • What matters most in a great photo? A) Emotion/story B) Light and composition C) Scale of the scene D) Sharp detail E) Unobtrusive capture Take the test Your Results Your Photography Style Is: Portrait Photographer You enjoy telling stories through expression and light. You notice small gestures and work well with people. Other Interests • Still Life: 33% • Street: 17% • Landscape: 0% 3 Tips to Improve • Master eye focus and catchlights. • Shape light with a reflector or large modifier. • Guide micro-posing: hands, shoulders, chin. Example preview — actual quiz will tailor results and links. Take the Photography Style Quiz Introduction - how to find Your photography style In photography, developing a unique style is a transformative journey that sets photographers apart. Finding one's photography style goes beyond mastering technical skills; it's about discovering a visual language that resonates with personal creativity and connects with viewers on an emotional level. As photographers explore different genres, experiment with composition, and refine their editing techniques, they begin to craft a distinctive visual narrative that reflects their artistic vision. This article delves into the essential steps on how to find your photography style and develop your own style. From analysing favourite photos and exploring various genres to creating a cohesive portfolio and embracing feedback, readers will learn valuable techniques to enhance their creative vision. The guide also covers the importance of consistent editing, defining a unique photographic perspective, and allowing one's style to evolve over time. By following these insights, photographers can embark on a rewarding journey to find their style and create images that truly showcase their artistic voice. Analyse Your Favourite Photos Quick Tips — Analyse Your Favourite Photos • Identify common elements: Gather 30–40 cherished images and look for recurring themes, moods, or subjects. • Note composition techniques: Spot patterns like use of negative space, rule of thirds, or filling the frame. • Examine lighting & mood: Analyse quality, direction, and colour of light to understand the atmosphere you prefer. To identify and develop a unique photography style, photographers should start by examining their favourite images. This process involves a deep dive into personal preferences and artistic choices. Here's how to approach this analysis: Identify common elements Photographers should gather a collection of their most cherished images, ideally 3 to 4 dozen. They need to look for similarities and patterns across these photos. This could include recurring themes, subjects, or visual elements. By brain-dumping words or phrases that come to mind when viewing these images, photographers can begin to articulate their style. For instance, words like romantic, feminine, strong, nostalgic, colourful, contrasty, soft, or dreamy might emerge repeatedly. Note composition techniques Examining the composition of favourite photos has an influence on understanding one's preferred visual language. Photographers should pay attention to how they frame subjects, use negative space, or employ techniques like the rule of thirds. They might notice a tendency to fill the frame or a preference for minimalist compositions. Understanding these choices helps to refine and replicate successful compositional strategies in future shoots. Examine lighting and mood The interplay of light and shadow in favourite photos often defines the photographer's style. They should analyse the quality, direction, and colour of light used in their best work. Some may prefer soft, diffused lighting for a calm atmosphere, while others might gravitate towards harsh, direct light for drama. The manipulation of shadows and highlights to create depth and texture is also crucial to note. By understanding their lighting preferences, photographers can consistently recreate the mood and emotional impact that resonates with their artistic vision. Getting Started: Experiment with Different Genres Quick Tips — Getting Started with Genres • Explore genres: Test different types of photography—portraits, landscapes, street, product, or fashion—to learn their unique qualities. • Push your boundaries: Step outside your comfort zone with stretch goals and unfamiliar subjects to spark creativity and growth. • Notice what resonates: Pay attention to the styles and subjects that feel authentic and rewarding; use this to guide your evolving portfolio. Try various photography styles Photography genres serve as categories that classify the diverse world of image-making. From portraiture to photojournalism to product photography, there's a vast array of styles to explore. Each genre has its unique characteristics and techniques, encompassing composition, lighting, and post-processing methods. Photographers should learn about their options before selecting a style to focus on. Whether one's interest lies in people, animals, nature, food, or fashion, there's a type of photography geared towards that specific subject matter. Push your creative boundaries To develop a unique style, photographers need to challenge their assumptions and venture into unfamiliar territory. This approach can lead to innovative ideas and personal growth. By setting 'stretch' goals, such as aiming for a higher daily word count or experimenting with new mediums, photographers can expand their creative horizons. Embracing discomfort is crucial, as it often indicates that one is venturing into unknown territory where true growth happens. Find what resonates with you As photographers experiment with different genres and push their boundaries, they should pay attention to what truly resonates with them. This process of self-discovery involves analysing favourite photos, identifying patterns, and understanding personal preferences. By practising consistently and mixing up their approach - sometimes shooting spontaneously, other times planning meticulously - photographers can hone their skills and develop their unique style. It's important to remember that defining one's style takes time and isn't always easy, but it's crucial for building a portfolio that accurately reflects the kind of work one loves doing the most. Develop a Consistent Editing Style Quick Tips — Develop a Consistent Editing Style Create a Signature Look • Experiment with presets, lenses, and unconventional techniques. • Master editing tools like curves, layers, and blending modes. • Adjust tools to suit your own process for a unique visual voice. Refine Post-Processing • Balance exposure, contrast, and colour to enhance images. • Avoid over-editing — keep results natural and impactful. • Calibrate your display for accurate colour adjustments. Maintain Visual Cohesion • Keep lighting conditions consistent where possible. • Use a uniform editing approach across your portfolio. • Build a cohesive colour palette with HSL adjustments. • Stick to preferred shooting angles for recognisable style. • Limit equipment changes — consistency helps unify results. Developing a unique editing style has an influence on setting photographers apart in a competitive industry. This process involves experimenting with various techniques, such as using unusual lenses, custom presets, or unconventional post-processing methods. To create a signature look, photographers should explore different editing tools and techniques, adjusting elements like curves, layers, and blending modes. By mastering these tools, they can bend them to work for their specific process and achieve a distinctive visual aesthetic. Refine your post-processing techniques To refine post-processing techniques, photographers should focus on key aspects of image editing. This includes adjusting exposure, contrast, and colour balance to enhance the overall quality and impact of their images. It's crucial to maintain a balanced approach and avoid over-editing, which can make photos appear unnatural. Photographers should also pay attention to their display settings, ensuring accurate colour reproduction for precise adjustments. By consistently practising and fine-tuning these techniques, they can develop a unique editing style that becomes synonymous with their name. Maintaining visual cohesion across a portfolio is essential to establishing a strong visual identity. To achieve this, photographers should consider several factors: • Consistent lighting: Shoot in similar lighting conditions where possible. Uniform editing approach: Apply similar adjustments across images. Colour palette: Use HSL sliders to create a cohesive colour scheme. Consistent angles: Stick to preferred shooting angles. Equipment consistency: Use the same lens or camera when possible. By adhering to these principles, photographers can create a unified look that showcases their creative vision and makes their work instantly recognisable. Define Your Photographic Vision Quick Tips — Define Your Photographic Vision Identify Core Interests • Explore genres, subjects, and styles to find what excites you most. • Focus on areas that bring joy and fulfilment to your work. • Build authenticity by aligning projects with your passions. Set Artistic Goals • Define goals that combine creative expression and skill growth. • Decide whether to master techniques, shape a style, or pursue projects. • Make goals precise and measurable to track progress. Craft a Mission Statement • Clarify your purpose, values, and long-term vision. • Identify your target audience and the value you bring. • Use it to guide decisions and communicate your identity clearly. Identify your core interests Photographers should delve deep into their motivations and passions to discover what truly excites them about photography. This process involves exploring various genres, subjects, and styles to determine which ones resonate most strongly. By understanding their core interests, photographers can focus their efforts on areas that bring them joy and fulfilment, leading to more authentic and impactful work. Determine your artistic goals Setting clear artistic goals has an influence on shaping a photographer's career path. These goals should encompass both creative expression and technical skill development. Photographers need to consider what they want to achieve through their art, whether it's mastering specific techniques, developing a unique style, or exploring personal projects. By setting precise and measurable goals, photographers can create a roadmap for their artistic growth and professional development. Craft a personal mission statement A personal mission statement serves as a guiding light for photographers, encapsulating their purpose, approach, and commitment to their craft. To create an effective mission statement, photographers should reflect on their values, artistic vision, and long-term objectives. This statement should address the following questions: What is the purpose behind their photography? Who is their target audience? What unique value do they bring to their work? By crafting a well-defined mission statement, photographers can align their actions with their purpose, make informed decisions, and navigate their careers with intention and authenticity. This process not only clarifies their direction but also helps them stand out in a competitive industry by communicating their unique vision to potential clients and audiences. Curate a Cohesive Portfolio Quick Tips — Curate a Cohesive Portfolio Select Your Best Work • Choose images that reflect your vision and distinctive style. • Ask: “Why do I like this photo?” or “Is this better than that one?” • Be selective — only include the most compelling work. Organise Thematically • Group by themes or projects, not just subject or location. • Keep each theme to 5–20 strong images for depth and quality. • Avoid mixing aspect ratios, colour with B&W, or clashing styles. Present a Unified Story • Think in terms of narrative: beginning, middle, and end. • Vary shots to maintain engagement while keeping cohesion. • Use colour, composition, and sequencing to evoke emotion. Photographers should carefully choose images that embody their vision and distinctive style. This process involves asking critical questions such as \"Why do I like this photo?\" or \"Is this photo better than that one?\" Such self-reflection helps in healthy self-criticism and ensures only the most compelling work is included. The selection should reflect the photographer's artistic voice and leave a lasting impression on viewers. Organise images thematically Rather than arranging photos by subject or location, it's more effective to organise them into themes and projects. This approach encourages photographers to think about the underlying ideas and motivations behind their work. Each theme should contain at least five photos to demonstrate depth, but no more than 20 to maintain quality. It's crucial to avoid mixing aspect ratios, colour, and black and white images within a project to ensure consistency. Present a unified visual story A cohesive portfolio tells a story through images. Photographers should consider the narrative elements such as characters, plot, climax, and resolution in their selection. The portfolio should have a clear beginning, middle, and end, much like a chronological narrative structure. It's important to include a variety of shots to challenge viewers' imagination and keep them engaged. The colour scheme and composition should be carefully considered to evoke specific emotions and create memorable images. By presenting a unified visual story, photographers can effectively showcase their unique storytelling style and captivate their audience. Embrace Constructive Feedback Quick Tips — Embrace Constructive Feedback Participate in Critiques • Join critique sessions to gain new perspectives on your work. • Identify strengths and weaknesses in technique and composition. • Engage in dialogue with peers and instructors for mutual growth. Use Feedback to Refine • Analyse critiques objectively — separate skill notes from opinion. • Apply feedback to sharpen your editing, composition, and lighting. • Maintain confidence in your vision while evolving your style. Grow Through Reflection • See feedback as opportunity, not failure — build resilience. • Embrace challenges to continuously improve your craft. • Develop the confidence to handle client and peer critiques professionally. Embracing feedback has a significant influence on a photographer's growth and development. By actively participating in critiques, photographers open doors to personal and artistic advancement. This process allows them to view their work from different perspectives, identifying areas for improvement and fostering continuous development. Critiques provide valuable insights into strengths and weaknesses, guiding photographers to refine their techniques, composition, and lighting skills. Engaging in constructive dialogue with fellow students and instructors creates a supportive environment where everyone can learn from each other's experiences and insights. This fosters a sense of community and collaboration within the photography course. Moreover, critique sessions introduce photographers to diverse viewpoints and techniques, broadening their perspective and encouraging experimentation with new styles and approaches. Use feedback to refine your style Feedback serves as a catalyst for self-reflection, enabling photographers to evaluate their work and artistic choices critically. Through constructive criticism, they learn to analyse their photographs objectively and understand how to communicate their intended message more effectively. This process enhances their artistic vision and helps refine their unique style. Incorporating feedback into their practice allows photographers to continuously evolve and produce increasingly impactful and meaningful images. It's crucial to focus on feedback that targets techniques and editing while maintaining confidence in one's artistic vision. By embracing useful critiques that enhance skills without compromising personal style, photographers can improve their craft while preserving their unique touch. Learning to accept feedback gracefully builds resilience and confidence. It teaches photographers to embrace challenges as opportunities for improvement rather than personal failures. This mindset is invaluable in the professional realm, where clients, editors, and peers will provide feedback on their work. Develop a Unique Visual NarrativeCreate series or projects Developing photography projects helps photographers explore subjects more deeply and find creative ways to see them. Personal projects provide enjoyment and satisfaction, regardless of skill level. They give focus, encourage learning, and remind photographers why they picked up a camera in the first place. When creating a series, it's crucial to establish a clear narrative pattern from the first photograph to the last. Varying shot types, including portraits, landscapes, abstract images, and action shots, helps deliver a more complete photo essay. Evolve Your Style Over Time Quick Tips — Evolve Your Style Over Time Embrace Change & Growth • Recognise that style evolves with life experience and interests. • Use change as fuel for resilience and self-discovery. • Allow your artistic voice to adapt while reflecting your journey. Continuously Refine • Get it right in the field — exposure, focus, and composition. • Eliminate distractions and avoid awkward cut-offs in framing. • Make small adjustments that create big improvements overall. Stay True to Your Vision • Follow your own path instead of imitating admired artists. • Use critique and challenges to stretch creativity and confidence. • Focus on creating emotional connections with subjects and viewers. Embrace change and growth A photographer's style is not a static entity but a dynamic process that evolves over time. Embracing change allows for personal growth and adaptability to new circumstances. As photographers navigate through life's ups and downs, they develop resilience and gain a deeper understanding of themselves and their potential. This self-discovery is intertwined with the evolution of their artistic voice, reflecting their changing interests and preferences. Continuously refine your approach To refine their approach, photographers should focus on getting it right in the field rather than relying on post-processing. This involves ensuring proper exposure, careful focusing and making small refinements to composition. When refining compositions, photographers should consider factors such as subject placement, avoiding awkward cut-offs, eliminating distractions, and preventing unintended merging of elements. These small adjustments can significantly improve the overall success of a photograph. Stay true to your artistic vision While evolving, it's crucial for photographers to stay true to their creative vision. The most important aspect is to remain authentic, regardless of external opinions. Although it's tempting to emulate admired artists, true artistic success comes from following one's own path. Embracing challenges and criticism can help photographers grow, pushing them to explore new ideas and stretch their creative boundaries. By focusing on creating an emotional connection between themselves, their subjects, and the viewer, photographers can overcome any fear or doubt associated with presenting their work. Conclusion Style Roadmap — 6 Steps • Analyse favourites: spot recurring subjects, light, mood, and compositions. • Experiment with genres: try new subjects/approaches and note what feels authentic. • Edit consistently: build a signature look; balance exposure/colour; avoid over-editing. • Define your vision: clarify interests, set measurable goals, write a mission line. • Curate a portfolio: 5–20 images per theme, cohesive colour/ratios, narrative flow. • Seek & apply feedback: join critiques, refine objectively, evolve while staying true. Keep iterating — small field refinements (exposure, focus, framing) compound into a distinctive voice. The journey to discover and refine a unique photography style is a rewarding and ongoing process. By analysing favourite photos, experimenting with different genres, and developing a consistent editing approach, photographers can create a distinctive visual narrative that reflects their artistic vision. Embracing feedback, curating a cohesive portfolio, and staying true to one's creative goals are key steps to stand out in the competitive world of photography. As photographers evolve their style over time, it's crucial to remain open to change while staying true to their artistic vision. By continuously refining their approach and embracing new challenges, photographers can create emotionally resonant work that connects with viewers on a deeper level. Remember, the most important aspect is to stay authentic and follow your own path, as true artistic success comes from creating a genuine connexion between yourself, your subjects, and your audience. Find and Refine Your Photography Style Download the 1-page field checklist or book live support. Download Photography Style Checklist (PDF) Image Reviews Clinic (Zoom, £29) 1-to-1 Mentoring (Zoom) Prefer a text link? Download the checklist here FAQs - how to find Your photography style How can I discover my own photography style?To find your personal photography and editing style, start by examining your home decor and wardrobe for consistent themes or colours. Explore your Pinterest boards for patterns in your image preferences. Gather the photographs you are most proud of into a portfolio. Embrace your unique style and focus on making consistent edits. Temporarily step away from social media influences. Remember, you can repeat these steps in any order as needed to refine your style. What steps can I take to develop my own photography style?Developing a unique photography style can be achieved by setting small, daily challenges and experiments. For instance, use just one lens for a day, or aim to capture one compelling image daily. Explore a new photography style each week, venture out in adverse weather conditions, experiment with midday photography, or use long exposure techniques to achieve distinctive effects. How can I define my identity as a photographer?To establish your identity as a photographer, concentrate on your strengths and define your specific niche. Market yourself within this niche to attract clients who are looking for your unique style and the specific qualities you offer in your photography. How do you recognise a photography form?In photography, form refers to the perceived or actual dimensions—length, height, and width—of geometric shapes within an image. Techniques such as selective focus and chiaroscuro (the use of strong contrasts between light and dark) can enhance the sense of form. Additionally, capturing the shape of water or other elements can also contribute to the form in photographs. 📚 Continue Learning • Next lesson: → Mastering Composition Rules → What Is Contrast in Photography? → The Art of Storytelling in Photography • Personal support: → Image Reviews Clinic (30-min, £29) photography-tips, online photography courseAlan Ranger6 July 2025Alan Ranger Photographycomposition guide LinkedIn0 Pinterest0",
  "wordCount": 3561,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/how-to-find-your-photography-style#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/how-to-find-your-photography-style#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}