{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/ireland-photography-workshop-recce-report#blogposting",
  "headline": "Ireland Photography Workshop Recce Report | Dingle to Kerry",
  "alternativeHeadline": "Ireland Photography Workshop Recce Report | Dingle to Kerry | Alan Ranger Photography",
  "description": "Ireland Photography Ireland is famous for many things but not many of them beat the beautiful landscapes and coastline (IMO).",
  "url": "https://www.alanranger.com/blog-on-photography/ireland-photography-workshop-recce-report",
  "datePublished": "2019-09-21T00:00:00.000Z",
  "dateModified": "2019-09-21T00:00:00.000Z",
  "dateCreated": "2019-09-21T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Ireland Photography Workshop Recce Report | Dingle to Kerry Ireland Photography Ireland is famous for many things but not many of them beat the beautiful landscapes and coastline (IMO). I was asked by some of my regular clients last November to organise a trip to Southern Ireland, at first, I thought could be tricky because any workshop lasting more than 3 days can play havoc with my schedule of evening class courses. However, I love Ireland and haven’t gone there for photography before so it seemed like I should just bite the bullet and put something together. It could work out or not but regardless I knew I would enjoy the experience of going and discovering new places. I scheduled a 4 day (3 night) workshop for March 2020 so the only thing left to decide was where and exactly where to take clients. That was the difficult part because southern Ireland has so many great locations. Dingle Peninsula, Killarney National Park and areas around County Kerry had been mentioned to me a few times over the years, so it seemed a good starting point. Furthermore, I have an acquaintance from the area that I felt sure would be able to help out with his local knowledge. After an email or two, we were set to do a recce and scouting trip in Sep 2019 over five days. The recce covered over 50 locations with 1000 KM of driving between points but made better/worse (depending on your taste) of fitting in a Damien Rice concert in Cork in the middle of the trip. (BTW it was worth the effort and drive/time to see him and not many dry eyes in the theatre by the end of the night) What I hadn’t anticipated when planning the Ireland Photography recce trip was: • How slow people drive in Ireland ( guaranteed that they will drive at least 25 KM slower than the limit for the road) How many American tourists are there; how they can’t drive and how annoyingly loud they are. Why so many B&B’s, Guesthouses, Hotels don’t include breakfast in the price or have a bar! When the fog comes in, it really comes in! See the gallery of shots - no fog/low cloud forecast the night before! A few random things; why so many bungalows? Why so expensive to drink and eat out? Why do slow drivers always look so happy? Why are the people so friendly and chatty? Not too mention that it happened to be a weekend of fierce rivalry between Dublin and Kerry for the cup in Gaelic Football - so every house and car was decked in green and yellow flags! I could go on and on but you get the idea - an English bloke trying to explain Brexit madness to random Irish people! But you gotta love the music if you find a proper Irish pub without the tourist trap! All that aside, the locations, countryside, views, quality of the roads, the local people, cleanliness of the streets and overall experience makes you wonder why you would live in England. So it’s fair to say that my romantic, idealist view of Ireland has increased as a result of this trip. Getting back to the point of the trip and the workshop scheduled for next March (hopefully more dates to follow) there really is an abundance of locations, types of photographic opportunities (vista’s, reflections, beaches, mountains, lakes, woodlands, waterfalls, castles, long exposure, short exposure, layby shoots, rock and cliff formations, sandy beaches, rocky beaches, buildings and much more…) around County Kerry. So if tide times are calculated and drive times don’t restrict, you can cram a lot in a short space of time. I visited many locations over the five days and built up a prioritised list of options covering different types of landscape and seascape photography. Due to time constraints, most of the photos I took were done (unashamedly) with my phone so I had specific GPS coordinate to plot and plan the final itinerary. After 5 days of visiting Ireland Photography locations, grabbing sample shots and working out logistics, I have a good feel for what will be an action packed but amazing variety of photographic opportunities. I will wittel down the list closer to the time based on tide and weather in March 2020 but can sya, with confidence, that this will be an amazing photography experience for any level of photographer. KERRY - Southern Ireland Photography Workshop - Mar 2026 £1,595.00 Photograph amazing areas in South Kerry, Dingle, and Killarney National Park on this 5-day Ireland photography workshopSummary Location: Dingle and Killarney - Kerry Southern Ireland Dates: Thu 5th - Mon 10th Mar 2026 - 5 Days/4 Nights Participants: Max 4 Fitness: 2. Easy-Moderate Experience Level: Beginner to Advanced Equipment Needed: DSLR or Mirrorless Camera and Tripod Photography Workshop Event Details: Dingle Description: We will be based near Dingle and visit some of the top spots around the Dingle Peninsula, South Kerry (Skellig Ring) and finally Killarney National Park. There is a wide variety of subjects: Mountains, Lakes, Waterfalls, Trees/woodlands, Coastline, Rock Formations to name a few. All set in stunning scenery to wow any visitor and photographer. We will visit several locations in a day, some are short 10-15 min stops (layby shoots) others will require more time to perfectly capturing the perfect moment with tides and light. Book Now Only 3 available If you would like to join us please book immediately as places are already taken. If you have any questions before booking call me - 0781 701 7994.Ireland PhotographySee Gallery for example shots from workshop recce (note most were taken with a phone so excuse resolution and treatment)South Kerry - 1 Day Skellig Ring - Amazing cliff formations, beaches, estuaries, Lighthouse, castle, big Vista’s. The Dingle Peninsula - 1 Day Slea Head Drive, multiple beaches, big vistas, mountains and lake locations. Killarney National Park - 1 Day Castle, Waterfalls, Lakes, Mountains and plenty of Vista locations Location Shots ( Examples) ireland photography workshop Lough Leane - Ross.jpg Minard Castle 2.jpg Slea Head Viewing Point - Dingle.jpg The Sleeping Giant.jpg Valentia Lighthouse - Cromwell Point 4.jpg Barfinnihy Lough.jpg Bula Upper Lake - Ring of Kerry.jpg Clogher Strand 2.jpg Conor Pass 2.jpg Coppagh Beach 3.jpg Coumeenoole Strand 2.jpg Coumeenoole Strand 3.jpg photography-workshopsAlan Ranger21 September 2019Alan Ranger Photography LinkedIn0 Pinterest0",
  "wordCount": 1061,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/ireland-photography-workshop-recce-report#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/ireland-photography-workshop-recce-report#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    },
    {
      "@type": "Thing",
      "name": "Woodland photography"
    },
    {
      "@type": "Thing",
      "name": "Seascape photography"
    }
  ]
}