{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/jacki-rosin-arps-rhs-exhibition#blogposting",
  "headline": "Jacki Rosin ARPS - RHS exhibition at the Saatchi Gallery",
  "alternativeHeadline": "Jacki Rosin ARPS - RHS exhibition at the Saatchi Gallery | Alan Ranger Photography",
  "description": "RHS Exhibition Guest Post by Jacki Rosin Browsing through my emails a few weeks ago, I came across some correspondence from the Royal Horticultural Society.",
  "url": "https://www.alanranger.com/blog-on-photography/jacki-rosin-arps-rhs-exhibition",
  "datePublished": "2022-03-07T00:00:00.000Z",
  "dateModified": "2022-03-07T00:00:00.000Z",
  "dateCreated": "2022-03-07T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Jacki Rosin ARPS - RHS exhibition at the Saatchi Gallery RHS Exhibition Guest Post by Jacki Rosin ARPS Browsing through my emails a few weeks ago, I came across some correspondence from the Royal Horticultural Society about their photographic competition. Further investigation showed there were several photographic categories that could be entered, including a Portfolio for a RHS Exhibition This category is for a compilation of six images in a series or on a common theme, with 'stylistic integrity throughout the display' and is judged for RHS Medals at the Botanical Art and Photography Show. I still had the images that I submitted or shortlisted for my ARPS on my hard drive and thought I had nothing to lose by submitting six of them. It was very much a spur of the moment decision! Three weeks later I received an email to say that the images had been shortlisted out of over a 100 entries and I would be taking part in the RHS exhibition at the Saatchi Gallery in London. Since then, I’ve had to fill in a lot of paperwork and forms. The images are now with One Vision Imaging for printing and mounting and will soon be on their way to the gallery. The RHS exhibition runs from the 9th -29th April at the Saatchi Gallery, Kings Road, London https://www.saatchigallery.com/exhibition/rhs2022#_ Couldn’t have done it without Alan’s help for my ARPS so thank you! Jacki Rosin. Well done, Jacki; I am very proud of this great achievement, and I hope it spurs you on to more accolades like this and maybe a new project soon! Alan R Images selected for exhibition. Click on an image to view full screen View fullsize student-photosGuest Blogger7 March 2022Alan Ranger Photographynews LinkedIn0 Pinterest0",
  "wordCount": 291,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/jacki-rosin-arps-rhs-exhibition#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/jacki-rosin-arps-rhs-exhibition#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Associate of the Royal Photographic Society (ARPS)"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "ARPS"
    }
  ]
}