{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/john-simpson-rps-distinctions#blogposting",
  "headline": "Case Study - John Simpson - LRPS | RPS Distinctions Panel",
  "alternativeHeadline": "Case Study - John Simpson - LRPS | RPS Distinctions Panel | Alan Ranger Photography",
  "description": "View fullsize John Simpson Hanging Plan RPS Distinctions John first got in touch in the summer of 2025, feeling more than a little battle-worn after two.",
  "url": "https://www.alanranger.com/blog-on-photography/john-simpson-rps-distinctions",
  "datePublished": "2025-10-12T00:00:00.000Z",
  "dateModified": "2025-10-12T00:00:00.000Z",
  "dateCreated": "2025-10-12T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Case Study - John Simpson - LRPS | RPS Distinctions Panel View fullsize John Simpson LRPS Hanging Plan RPS Distinctions John first got in touch in the summer of 2025, feeling more than a little battle-worn after two unsuccessful attempts at his RPS Licentiate distinction. Understandably, he was frustrated with the process — and the feedback — so he reached out for some honest mentoring and a fresh set of eyes on his failed panel before making one last, all-or-nothing attempt. It didn’t take long to spot the culprits. Many of the images were over-processed, showing halos, noise, and other tell-tale signs that would make any assessor twitch. Technically, that meant the panel was never going to pass — but the raw material was there. John’s visual awareness and range of genres were solid; the problem was more about cohesion. As a set, the images weren’t quite singing from the same hymn sheet. Over three intensive one-hour Zoom sessions, we pulled the whole thing apart and rebuilt it. Re-edits, replacements, and a fair bit of straight-talking later, John emerged with a brand-new panel — this time balanced, polished, and technically tight from corner to corner. The result? Success! John passed his LRPS distinction and gained a deeper understanding of the editing workflow that will no doubt strengthen his already impressive list of photographic accolades.Well done, John — a great result, and a reminder that sometimes less clarity really does bring more clarity. 😉! Interview with John Simpson — RPS Distinction Success Story Distinction Achieved: LRPSMentor: Alan RangerInterview Date: 12 October 2025 Why did you want to gain a distinction with the Royal Photographic Society (RPS)? I was keen to have recognition of my work from a prestigious photography body. Why did you choose Alan to mentor you for a distinction, and had you worked with him before? I had not worked with Alan previously. I heard of his reputation by word of mouth and then researched his website and read other people’s reviews. Describe how you found the RPS Mentoring Classes The format Alan used was very easy to understand and follow. Each session lasted an hour and was very constructive.The pace was adapted to my level as required. Alan was very patient and answered every question on each aspect of the LRPS criteria.We carefully worked through my panel in detail together so that some images were replaced and others were altered.Alan was always at the end of the phone when needed. Did you feel you got the right level of support from the sessions? Yes, definitely. Did you feel you were already good enough to gain a distinction before starting the mentoring course? I felt I was good enough to gain the LRPS but had failed on two previous occasions.It seemed to me that I had not got the right level of post-processing and presentation skills for this award.Alan advised me to go back to the raw files and re-process them, as my previous panels had been over-processed.He also recommended re-arranging the images in my panel and changing several.Going forward, I continue to use Alan’s workflow advice, which I’m enjoying. My images are a lot better for these changes. What distinction did you apply for, and were you successful? I applied for the LRPS — and yes, I was successful. What was your experience like on the RPS Assessment Day? I had two RPS assessment days. I didn’t find either very helpful and failed after both, despite following their advice to the letter.I would not recommend these to anyone. Both sessions lacked detail and depth and were far too superficial. Did you seek independent advice, feedback or input elsewhere before your panel assessment? I had two sessions with the RPS assessors and failed.I had three sessions with Alan — and passed. Having completed the course and distinction assessment, what advice would you share with others? Before starting your journey, submit several images to Alan.He’ll advise whether they’re good enough, how to approach post-processing, and how to design your panel layout. What was the hardest part of gaining a distinction with the RPS — and why? The hardest part was trying to unpack what was actually required from the detailed criteria.It was difficult to understand how some successful panels had met all of them.I had many award-winning images from other photographic organisations that the RPS assessors were highly critical of — which added to my confusion. Has working towards a distinction helped you progress as a photographer? Yes, but only because of Alan’s input.The feedback from the RPS after each failed assessment was inconsistent and contradictory — which only increased my confusion. Any other comments you’d like to add? I cannot recommend Alan highly enough — his patience and knowledge are exceptional.I’m looking forward to working with him again when I consider the ARPS.Thank you, Alan. I’m very grateful and thrilled to have finally succeeded — I would not have tried again without your guidance. John Simpson EFIAP, CPAGB, BPE4, LRPS Click on images to see full screen If you are interested in attaining an RPS distinction I can support you with my RPS Courses for distinctions RPS Mentoring Course Summary- Produce a panel of images for an RPS Distinctions Qualification • Zoom - Online • Evening Class - 19:00 - 21:00. Six classes, you choose dates, within a twelve-month period to suit • From £395 Or also available as a series of 1hr 1-2-1 Zoom Sessions Having supported many clients through a journey of development and improvement, with their photography, over the past few years, this mentoring course is for those who are already technically competent (or at least are on the path to mastering it) and are able to demonstrate good design and composition in their photography. You are not expected to be a master or even polished to attend. This RPS Distinctions course is to help support you in improving in all three areas of image production: • Technical - The mechanics of it Creativity - The reason for it Output - The editing and publication of it You will be expected to understand and demonstrate or be willing to learn; Good exposure of photographs Good compositional awareness A range of techniques and styles (L) or specific themed body of work (A) Ability to edit images to a \"reasonable\" standard. Over the course of 12 months, where you will attend six RPS Distinctions classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS Successful Client Panels Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.com photography-courses, student-photosAlan Ranger12 October 2025Alan Ranger Photographyrps-panel, rps distinctions LinkedIn0 Pinterest0",
  "wordCount": 1222,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/john-simpson-rps-distinctions#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/john-simpson-rps-distinctions#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "Associate of the Royal Photographic Society (ARPS)"
    },
    {
      "@type": "Thing",
      "name": "RPS Distinctions"
    },
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "ARPS"
    }
  ]
}