{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/kase-filters-and-lightroom-queen-deals#blogposting",
  "headline": "Kase Filters and Adobe Lightroom Queen Partner Deals |",
  "alternativeHeadline": "Kase Filters and Adobe Lightroom Queen Partner Deals | | Alan Ranger Photography",
  "description": "Kase Filters and Adobe Lightroom Queen Partner Deals |.",
  "url": "https://www.alanranger.com/blog-on-photography/kase-filters-and-lightroom-queen-deals",
  "datePublished": "2023-05-14T00:00:00.000Z",
  "dateModified": "2023-05-14T00:00:00.000Z",
  "dateCreated": "2023-05-14T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Kase Filters and Adobe Lightroom Queen Partner Deals | Hi everyone. I am excited to announce that I have two new great offers for my clients with new affiliate deals with Kase Filters and The Lightroom Queen More details are below, but first, to remind you to enter your three spring images into the free photo contest by 31st May. Details are below The Lightroom Queen - Lightroom Classic FAQ - Offer 20% off and free to new LR Course Attendees As many of you know, I have been running a beginner’s Lightroom (for desktop/laptop) course for over ten years. During that time, the burden of keeping comprehensive course guides updated with the latest changes in Lightroom has led me to look for alternative solutions. My existing document, now nearly 200 pages, is outdated the minute I updated it, and Adobe released further enhancements to Lightroom Classic. The Lightroom Queen has always been an excellent online resource with its forum and ability to search for answers without going through the frustrations of watching YouTube videos that take ten times longer than required to explain something or are simply out of date too. Julia’s writing style is concise but has enough detail to give readers a better understanding. If you want a sample of the format, writing style, and explanatory images, then register on the Lightroom Queen website and download this Free Quick Start eBook - Adobe Lightroom Classic https://www.lightroomqueen.com/shop/classic-quickstart/ From the author’s site:Description When you have a Lightroom Classic question, where do you look? Do you spend hours searching the web? From now on, you look right here. Unique Feature – stay up-to-date Most books on Lightroom are out-of-date within a couple of months, when the next version is released. Adobe Lightroom Classic – The Missing FAQ is different – the eBooks are updated every time Adobe updates the software, so you can always have the latest information! Included in your book purchase is one year’s Classic Premium Membership which gives you access to the eBook updates, email assistance and more – see below for the details and terms. About the Book As the name suggests, Adobe Lightroom Classic – The Missing FAQ is primarily designed as a conversational FAQ-style reference book, giving you the detailed information you need to make informed choices, whether you’ve been using Lightroom for a few months or a few years. No more pressing buttons without understanding the repercussions! Unlike most other Lightroom books, this isn’t just the theory of how Lightroom’s supposed to work, but also the workarounds and solutions for the times when it doesn’t behave the way you’d expect. Who’s the book written for? For less experienced users, the Fast Track weaves its way through the book, with short tutorials that guide you through a simple workflow, allowing you to gain confidence before diving into the more advanced questions. The book also includes a chapter on the concepts behind editing photos and how these translate into Lightroom adjustments, ideal for anyone new to photo editing. Download our free Quick Start eBook to get a feel for the style. The book then switches to a conversational question & answer format, going into greater detail for intermediate and advanced users. There are questions ranging from simple ones like how to import photos, to the much more in-depth details about how the previews are used and how to create your own camera profiles. Check the Table of Contents and download the first couple of chapters to sample the format. Offers for my clientsLightroom Classic - The Missing FAQ - Free one-year subscription to updates included with my Lightroom Course Anyone who signs up for my four-week Beginners Lightroom Course will now receive a gift certificate for a free one-year subscription to the Missing FAQ eBook. This will enable me to provide a thorough resource that stays up-to-date and can be easily accessed from any phone, iPad, kindle or computer. 20% Off a one-year subscription - £19.95 for Any of my previous Lightroom Course Clients - Offer expires 5th June 2023 I am pleased that Julia has agreed to a 20% discount on the Missing FAQ eBook for those of you who have already completed my Lightroom Course. If you are interested in taking this offer up, please contact me for the coupon code so I can validate that you are my client and attended the course. Link to the Missing FAQ eBook https://www.lightroomqueen.com/shop/adobe-lightroom-classic-missing-faq/ View fullsize The Missing FAQ Sample from contents The case for Kase Filters? And a 10% discount for my clients - Affiliated Partner Filters in landscape photography have been a standard part of the kit bag. NDs, Graduated NDs, and polariser filters have allowed us to improve the dynamic range and exposure tonal range and create those long exposure on moving subjects (water/sky). I have always taught my clients why and how we use the three filters to improve the in-camera image. See this previous blog post for explanations on filters. For years I have recommended the Lee Filter system, and I still do for certain types of images; however, over the last few years, I have rarely used the graduated filters that are required to control difficult lighting situations with bright highlights (e.g. the sky) versus darker shadows (e.g. underneath trees or shaded areas). Why not, you may ask? Well, the simple answer is two-fold. • I have found that the dynamic range of sensors in the new camera models has improved so much over the last five years that even if I have the dreaded U-shaped histogram with a lack of mid-tone tonal range, there has been enough data recorded to adjust without too much downside in post-production. If I need an insurance policy, it’s effortless and quick to take a three-bracketed exposure from minus two to plus two and then blend in post. Maybe it’s my ageing body and mind, but the energy required to get out the filter kit, ensure the filters are clean, position them all and so on meant that I don’t mind admitting laziness or not having enough time or just that the fact that it may be damp/drizzly and so on. In those situations, I ended up just taking bracketed exposures. At the back end of last year, I looked at alternative options because NDs are still required for long exposures and, without question, a polarising filter for most of my outdoor photography, especially for woodlands. I wanted something to use that was simple, quick and easy to access and use. My search coincided with the launch of the already highly rated Kase Wolverine system that many pro togs and tutors use with Kase’s new update to that system with the “ Revolution - Kase Magnetic Circular Filters.” Verdict I purchased the new Kase Revolution Pro Kit with various step-up rings, a hood and adapters. I was ready to put everything to the test across three different lenses and reduce the space taken up, in my camera bag, by my Lee filter system to about 25% of the size and 70% of the weight. Yes, okay, it meant an expenditure of approximately £450. Still, after taking the kit out on various workshops and using it, I was delighted with how easy it was to use clean and interchange filters. Cleaning may seem minor, but trust my experience of working on coastlines, drizzle and rain and having to spend too long to clear rain-drops, smudges, and so on the glass and coating on the Kase filters far outweighs my experience of trying to clean Lee filters. Colour cast/glass quality was vital, and the colour-coded filters made it so much easier for my failing eyes to identify which filter strength to pull out of the 12cmx12cm pouch. From Kase’s site:Key Features Colour coded filters Backwards compatible with existing Magnetic Circular filters, adapters, hoods and step rings New Inlaid ring to help prevent vignetting on a wide-angle lens Magnetic Stackable Mounting Toughened Pro HD Optical Glass No Discernible Colour Cast Scratch Resistant Metallic Nano Coatings Water and Dust/Dirt Repellent Easy Clean In the Box Magnetic Lens Adapter ( 77mm, 82mm and 95mm Options) You need to go one size bigger than your lens to avoid vignetting White colour-coded Magnetic Circular Polariser Blue colour-coded ND8 (3 stop) Neutral Density Filter Yellow colour-coded ND64 (6 stop) Neutral Density Filter Red colour-coded ND1000 (10 stop) Neutral Density Filter 77mm, 82mm or 95m Inlaid Ring - Depending on your lens diameters. FREE Magnetic Lens Cap Carry Pouch Offers for my clientsKits From £230 - Kase Filter systems My Existing Clients Receive 10% Off - Please email me so I can verify you are my client and provide you with the discount code for any Kase products as an affiliated partner. Free consultation with me on what sizes and adapters/kit works best across your lenses. Kase Filters Kase Revolution Circular Filter System Colour Coded for ease of identification and magnetic news, photography-offers, recommended-products, tip-of-the-day, lightroomAlan Ranger14 May 2023Alan Ranger Photographynews, filters LinkedIn0 Pinterest0",
  "wordCount": 1501,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/kase-filters-and-lightroom-queen-deals#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/kase-filters-and-lightroom-queen-deals#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    },
    {
      "@type": "Thing",
      "name": "Woodland photography"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}