{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/kentfaith-concept-square-filter-system#blogposting",
  "headline": "Review of Kent Faith CONCEPT Square Filter System Pro Kit",
  "alternativeHeadline": "Review of Kent Faith CONCEPT Square Filter System Pro Kit | Alan Ranger Photography",
  "description": "Table of Contents Show Introduction - K&F (Kent Faith) Square Filter System Pro Kit When it comes to landscape photography and creative long-exposure shots,.",
  "url": "https://www.alanranger.com/blog-on-photography/kentfaith-concept-square-filter-system",
  "datePublished": "2024-10-27T00:00:00.000Z",
  "dateModified": "2024-10-27T00:00:00.000Z",
  "dateCreated": "2024-10-27T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Review of Kent Faith CONCEPT Square Filter System Pro Kit Table of Contents Show Introduction - K&F (Kent Faith) CONCEPT Square Filter System Pro Kit When it comes to landscape photography and creative long-exposure shots, filters play a critical role in controlling light, reducing reflections, and enhancing colours. If you're looking for the best filter kits for landscape photography, the Kent Faith (K&F) Concept Square Filter System Pro Kit is a versatile solution designed for photographers seeking flexibility and high performance. This review will cover everything included in the kit, the function of each filter, and how it can help elevate your landscape photography. What's Included in the K&F Concept Square Filter System Pro Kit? The K&F Concept Square Filter System Pro Kit includes the following key items: • 95mm Circular Polariser (CPL) ND1000 Filter (10-stop) ND64 Filter (6-stop) ND8 Filter (3-stop) Four adapter rings (67mm, 72mm, 77mm, and 82mm) Filter holder Leather filter pouches Dimensions of the filter pouch: 120mm x 120mm x 40mm Overall weight of the kit: Approximately 450g, making it lightweight and easy to carry on location shoots. Each of these elements serves a specific purpose in the kit, which we will explore in detail. The variety of filters included makes this one of the best filter kits for landscape photography, offering flexibility whether you’re shooting a sunrise, waterfall, or long-exposure seascape. The 95mm Circular Polariser (CPL) One of the essential filters in this kit is the Circular Polariser (CPL). This filter is widely regarded as a must-have for landscape photography because it reduces reflections from non-metallic surfaces such as water and glass, making skies more vibrant by deepening the blues and adding contrast to clouds. When to Use the CPL For landscape photographers, a CPL filter is invaluable. When shooting a reflective lake, this filter will allow you to cut through the glare, revealing details below the water’s surface. Similarly, it will enhance the colours of a dramatic sky, helping you capture stunning shots during golden hour. The ND1000 filter, which reduces light by 10 stops, is perfect for long-exposure shots. If you’re a landscape photographer aiming to capture the smooth motion of water or clouds, this filter is a game-changer. It allows you to extend your shutter speed in bright daylight, producing a silky effect in moving water. When to Use the ND1000 A classic example is shooting a waterfall on a sunny day. The ND1000 filter will help you slow down your shutter speed to create the ethereal, flowing effect that’s so popular in landscape photography. The ND64 filter offers a 6-stop reduction in light, providing more balance between light control and retaining detail. It’s less extreme than the ND1000, making it ideal for overcast days or when you want to maintain some movement detail in clouds or water. The ND8 filter is the lightest of the filters included, offering a 3-stop light reduction. It’s perfect for low-light scenarios like dawn or dusk, where only minor light reduction is necessary. Build Quality and Design A key feature of the Kent Faith (K&F) Concept Square Filter System Pro Kit is its build quality. All filters are made from Japanese AGC glass, renowned for its clarity and durability. The multi-layer nano-coating on each filter reduces reflections and enhances image clarity, making it one of the best filter kits for landscape photography. One feature that many users appreciate is the plastic trim around the edge of each filter. This trim makes handling the filters easier by allowing you to avoid touching the glass directly, helping to prevent fingerprints on the filter surface. The trim also provides a degree of protection against small knocks and bumps, adding durability to the edges of the filters and making them more user-friendly, especially in outdoor environments. While the leather filter pouch included in the kit is of excellent quality, some users may find it to be quite large. The square filters themselves, along with their mounts, are bigger compared to other systems like the Kase Revolution magnetic kits. As a result, the pouch takes up considerable space in your camera bag. If you're already carrying a lot of gear, this might require you to either switch to a larger bag or reconsider what you bring along for shoots. The filter holder is crafted from aluminium alloy, which is both lightweight and sturdy. It ensures that there is no vignetting, even when using wide-angle lenses—a common issue in landscape photography. In-field Testing and Experience of Using the K&F Concept Square Filter System Pro Kit Having tested the Kent Faith (K&F) Concept Square Filter System Pro Kit in various field conditions, its performance stands out for landscape photographers who require versatility and durability. Whether it was sunrise shoots, long-exposure seascapes, or shooting under challenging lighting conditions, the kit proved to be reliable but not without some usability challenges. Ease of Use in Field Conditions Switching between filters in the field was not always straightforward. Attaching the field holder adapter to the adapter ring proved difficult, requiring multiple attempts to lock it securely. Even when it was attached, there were times when it didn't feel entirely secure, leaving a sense of uncertainty. Additionally, inserting and removing filters was challenging due to the tight slots, necessitating the use of two hands—one to support the lens and adapter holder, and the other to manage the filter. This made quick changes difficult, especially in fast-paced shooting environments. Performance in Long Exposure Photography During long-exposure photography, the ND1000 filter performed exceptionally well, providing consistent results without introducing any noticeable colour casts, which can be a concern with lower-quality filters. Even in bright conditions, the ND filters allowed for extended exposure times, creating silky smooth water effects and beautifully blurred clouds, showcasing the true potential of high-quality glass filters. Polariser Effectiveness The Circular Polariser (CPL) significantly reduced glare and reflections in water and glass surfaces while enhancing the colours of the landscape. When used on sunny days, it improved the depth of the sky and provided greater contrast between clouds and the blue horizon. The polarising filter is embedded into the adapter holder and includes a small cogged wheel, allowing you to rotate the polariser to the correct position quickly and easily, without the need to touch the filter itself. This feature makes polariser adjustment faster and more convenient in the field. View fullsize Kase Polariser Left - Kent Faith Polariser Right - No noticeable differences other than minor colour shifts between the two filters, and a small shift in darker shadows on the K&F CPL - both on maximum polarisation strength for testing purposes Durability and Cleaning Given the outdoor nature of landscape photography, filters often come into contact with dust, water, and other elements. The K&F Concept Square Filter System Pro Kit performed well in harsh environments, with the AGC glass and nano-coatings ensuring that the filters were easy to clean and resistant to scratches, water, and oil. The plastic trim around the filters also provided additional protection, helping to absorb minor bumps and making the filters easier to handle in rough conditions. This durability was a major advantage during a coastal shoot where exposure to saltwater and sand was unavoidable. Summary of In-field Testing Ease of Filter Changes: Quick and smooth filter transitions were challenging due to tight slots and adapter attachment issues. Long Exposure Performance: Consistent results with no noticeable colour cast, though usability could be improved. Polariser Effectiveness: Significant reduction of glare and enhanced colours, performing well in outdoor environments. The embedded cogged wheel for adjusting the polariser adds convenience. Durability: Resistant to scratches, water, and oil; easy to clean in challenging environments. The plastic trim around the filters helps prevent fingerprints and adds protection. Adaptability Across Lenses: Seamless use across multiple focal lengths with provided adapter rings, though attachment was sometimes tricky. Filter Pouch Size: The high-quality leather pouch offers great protection for the filters, but its large size may require a larger camera bag or necessitate leaving out other gear. Price Comparison and Value for Money This kit offers incredible value for money when compared to other filter kits for landscape photography. Below is a price comparison for this and alternative filter kits: K&F Concept Square System Pro Kit£225CPL, ND1000, ND64, ND8, Adapter RingsK&F20% Off Any K&F Product - Alan20Kase Revolution Magnetic System£250 - £375Magnetic CPL, ND8, ND64, ND1000, Toughened Optical GlassKase FiltersContact Alan for 10% OffLee Filters Starter Kit£225 - £500Resin CPL, ND and Soft GND, Extensive Accessory RangeLee FiltersContact Alan for 15% Off Considering the wide range of filters included and the quality of materials used, the K&F Concept Square Filter System Pro Kit provides excellent value, making it a top contender for the best filter kits for landscape photography. Pros and Cons: K&F CONCEPT Square Filter System Pro Kit vs CompetitorsKent Faith (K&F) CONCEPT Square Filter System Pro Kit Pros: Affordable: At around £225, it is one of the more budget-friendly options available. High-Quality Glass: The filters are made from Japanese AGC glass, known for its durability and image clarity. Plastic Trim: The plastic edges on each filter prevent fingerprints and provide some protection against minor bumps. Versatility: Comes with four adapter rings for different lens sizes, making it flexible across various lenses. Easy Polariser Adjustment: The polarising filter is embedded into the adapter holder with a small cogged wheel, allowing you to rotate the polariser to the correct position quickly and easily without needing to touch the filter itself. Cons: Challenging Usability: Attaching the filter holder adapter to the ring can be tricky, and tight slots make filter changes difficult. Filter Pouch Size: The large leather pouch may require a bigger camera bag or necessitate leaving out other gear. Limited Filter Range: While it covers the essentials, the range of filters is less comprehensive compared to high-end competitors like Lee Filters. Kase Revolution Magnetic System: Fast filter changes with a secure magnetic design. Durable Glass: Toughened optical glass offers scratch resistance. High Price: More expensive, priced around £275. Lee Filters Industry Standard: Highly regarded for their graduated ND filters. Modular System: Allows for a wide range of filter additions. Costly: Starter kits begin around £225. Cost closer to £500 for equivalent filters in the kase and K&F Kits Fragile: Glass filters are more prone to breaking than their competitors. Frequently Asked Questions (FAQs) - K&F CONCEPT Square Filter System 1. Can I use the K&F Concept Square Filter System Pro Kit on any lens? Yes, the kit includes adapter rings for 67mm, 72mm, 77mm, and 82mm lens threads. For other sizes, you can use step-up or step-down rings. 2. Will these filters affect image quality? The filters are made from high-quality Japanese AGC glass, which maintains sharpness and clarity without introducing colour casts or distortion. 3. Do these filters cause vignetting? No, the slim profile of the filters and the holder prevents vignetting, even when using ultra-wide-angle lenses. 4. What is the difference between the ND8, ND64, and ND1000 filters? The ND8 reduces light by 3 stops, the ND64 by 6 stops, and the ND1000 by 10 stops. The higher the number, the more light is reduced, allowing for longer exposure times. 5. Can I stack filters in this system? Yes, the Kent Faith Concept Square Filter System allows you to stack up to three filters, such as combining the CPL with the ND1000 for creative effects. With a combination of affordability, versatility, and build quality, the K&F Concept Square Filter System Pro Kit is undoubtedly one of the best entry-level or budget filter kits for landscape photography. However, while it delivers solid performance for the price, its usability—particularly around attaching the filter holder and changing filters—could be improved. Additionally, the large size of the filters and their leather pouch may require more space in your camera bag compared to more compact systems like the Kase Revolution. The plastic trim around the filters adds a welcome layer of protection and ease of handling. For budget-conscious photographers, it's an excellent option, though it doesn’t match the premium quality and ease of use offered by higher-end brands like Kase and Lee Filters. recommended-productsAlan Ranger27 October 2024Alan Ranger Photographyessential gear guides LinkedIn0 Pinterest0",
  "wordCount": 2023,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/kentfaith-concept-square-filter-system#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/kentfaith-concept-square-filter-system#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    },
    {
      "@type": "Thing",
      "name": "Seascape photography"
    }
  ]
}