{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/know-your-camera-filters#blogposting",
  "headline": "Do You Know Your Camera Filters? | Professional Guide",
  "alternativeHeadline": "Do You Know Your Camera Filters? | Professional Guide | Alan Ranger Photography",
  "description": "Do You Know Your Camera Filters.",
  "url": "https://www.alanranger.com/blog-on-photography/know-your-camera-filters",
  "datePublished": "2024-10-16T00:00:00.000Z",
  "dateModified": "2024-10-16T00:00:00.000Z",
  "dateCreated": "2024-10-16T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Do You Know Your Camera Filters? | Professional Guide Know Your Camera Filters If you haven’t been taking part in photography for long, you may not know what kind of camera lens filters are available and what exactly it is they do. Depending on what kind of shots you want you create, you’ll need different types of filters. Polarising Filters These type camera filters are perfect if you’re plagued by unexpected reflections in water or glass. These work by reducing the amount of reflected light that passes through to your camera’s sensor and helps remove glare from reflective surfaces in your photos. You’ll notice when you use a polarising filter that the colours are far richer and intense; giving your photos greater depth and impact. Just be careful when using polarising filters in photography; with less light reaching your camera, the shutter speed will be reduced resulting longer exposures that may result in camera shake if hand-holding your camera. View fullsize Polariser used to removed some of the bright reflective light on the surface of the sea Neutral Density Camera Filters A neutral density filter will reduce light uniformly over the whole frame. They are primarily used to help extend the exposure time to show a greater sense of movement in a shot, e.g., water or moving clouds. You may find that if you’re coming along to one of my outdoor photography workshops over the summer, bringing a neutral density filter will greatly aid you in your photography and experimentation of affects. Take a look a previous blog post on using Neutral Density Filters a 10 Stop Neutral Density Filter (Lee Big Stopper) to slow the exposure time and remove detail from the sea Graduated Filters Graduated density camera filters are there to help you balance the exposure between the brightest and darkest areas in the scene. We call this range of brightness values the \"dynamic range\" and the camera is limited to how big a range it can capture in a single exposure. These filters help you to reduce that range by placing a darkened filter over the brightest part of the scene. Looking at these filters, you’ll be able to see that half of the filter is clear and half is darkened. You’ll most likely be using these filters in landscape photography if you haven’t already. These are just three camera filters that can be utilised in photography to help bring that extra bit of life to your shots. If you think you’re ready to continue your photography journey, I’m running a number of intermediate’s photography courses throughout the year that you can get involved in. Filter come in many shapes and of course sizes to fit your specific lens diameter. If you would like to get some advice please contact me about which filters you need and where would be a good place to start. I have also arranged a special discount for my customers with Linhof Studios so you can purchase a discounted beginner's pack or opt for one of the more advanced kits that I have put together just for my students.. Full details here: If you’ve already experimented with a few filters, perhaps you could enter those photos into my summer photography competition? Whether you use filters or not in your photography, I can’t wait to see what kinds of photos you create! photography-tips, recommended-productsAlan Ranger16 October 2024filters, lee-filters, recommended-products, uv-filters, NIK LinkedIn0 Pinterest0",
  "wordCount": 570,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/know-your-camera-filters#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/know-your-camera-filters#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}