{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/landscapes-photography-practise-assignment#blogposting",
  "headline": "Landscapes Photography Practise Assignment - Free Lesson",
  "alternativeHeadline": "Landscapes Photography Practise Assignment - Free Lesson | Alan Ranger Photography",
  "description": "Landscapes. This assignment focuses on mastering landscape photography through careful consideration of light, composition, and location. Students will learn.",
  "url": "https://www.alanranger.com/blog-on-photography/landscapes-photography-practise-assignment",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "LANDSCAPES PHOTOGRAPHY PRACTISE ASSIGNMENT - FREE LESSONhttps://www.alanranger.com/free-online-photography-courseLANDSCAPESThis assignment focuses on mastering landscape photography through careful consideration of light, composition, and location. Students will learn to effectively capture the beauty of natural environments while employing specific techniques to enhance their images.LEARNING OBJECTIVES * Understand the importance of light in landscape photography and how to use it to create mood. * Develop compositional skills that emphasize the natural environment and tell a story. * Practice using camera settings effectively in priority modes to achieve desired artistic effects.WANT FEEDBACK ON YOUR ASSIGNMENT?Join Foundation Plus and get personalised monthly critique plus full access to all assignments.Learn More & Join Download Assignment PDF BEFORE YOU SHOOT * Choose a natural landscape location that inspires you, such as a park, beach, or mountain. * Check the weather forecast to identify optimal lighting conditions (golden hour or blue hour). * Plan your shoot time to coincide with the best light conditions. * Pack essential gear including a tripod, wide-angle lens, and filters. * Charge your camera batteries and ensure you have enough memory cards for the s forecast to identify optimal lighting conditions (golden hour or blue hour). * Plan your shoot time to coincide with the best light conditions. * Pack essential gear including a tripod, wide-angle lens, and filters. * Charge your camera batteries and ensure you have enough memory cards for the session.THE ASSIGNMENTTECHNICAL FOCUS * Use aperture priority mode to control depth of field, setting it at f/8 for sharpness across the landscape. * Utilize fixed ISO 200 to minimize noise while letting the camera adjust shutter speed as needed. * Experiment with long exposures for water or cloud movement by using a tripod and a neutral density filter. * Bracketing exposures can help capture a range of highlights and shadows in dynamic lighting. * Consider using a polarizing filter to enhance colors and reduce glare in your landscape shots.CREATIVE FOCUS * Incorporate leading lines in your composition to guide the viewer's eye through the image. * Use foreground elements to add depth and scale to your landscape photographs. * Anchor your composition with a clear focal point that draws attention. * Experiment with different angles and perspectives to find unique compositions. * Capture the landscape at various times of day to explore how light changes the scene.ASSIGNMENT TASKS 1. Visit a local natural park during golden hour, using aperture priority mode set at f/8 with ISO 200 fixed, and capture at least three different compositions focusing on leading lines. 2. Choose a water body, use shutter priority mode set at 1/4s with ISO 200 fixed, and create a long exposure shot to capture the smooth movement of the water. 3. Find a viewpoint that showcases a vast landscape, using aperture priority mode set at f/11 with ISO 200 fixed, to ensure maximum depth of field. 4. Take a series of images at different times of day in the same location to observe how the light affects the landscape, using aperture priority mode throughout. 5. Select a scene with dramatic clouds and use shutter priority mode set at 1/500s with ISO 200 fixed to freeze the motion of the clouds. 6. Create a composition that includes both a foreground element and a distant background, using aperture priority mode set at f/5.6 with ISO 200 fixed to balance focus throughout the scene.💡 Stretch Tasks * Create a high dynamic range (HDR) image by taking multiple exposures at different settings, using a tripod to maintain composition. * Shoot a panorama of a wide landscape scene, ensuring to overlap images by about a third for a seamless blend.DO / DON'TDO * ✓ Do plan your shoots around the best lighting conditions for landscape photography. * ✓ Do use a tripod to stabilize your camera for longer exposures. * ✓ Do experiment with different compositions and perspectives to find your unique style. * ✓ Do keep the natural environment as the main focus of your landscape images. * ✓ Do shoot in RAW format to retain maximum detail for post-processing.DON'T * ✗ Don't rush your shots; take time to compose your images carefully. * ✗ Don't ignore the weather conditions as they can dramatically change the mood of your photographs. * ✗ Don't forget to check your camera settings before starting to shoot. * ✗ Don't include man-made objects in your landscape images if they distract from the natural scene. * ✗ Don't rely solely on the camera's auto mode; practice using priority modes for better creative control.REFLECTION QUESTIONS * How did check your camera settings before starting to shoot. * ✗ Don't include man-made objects in your landscape images if they distract from the natural scene. * ✗ Don't rely solely on the camera's auto mode; practice using priority modes for better creative control.REFLECTION QUESTIONS * How did the natural light conditions influence your landscape photographs? * What compositional techniques worked best in your images, and why? * Reflect on a challenging shot: what did you learn about your approach to landscape photography? * How does the use of foreground elements change the perception of depth in your photos?📚 RELATED READINGBefore you start, read these related blog posts to deepen your understanding: * → Mastering Landscape Photography Tips And Techniques * → Finding Your Compositional Balance For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus.Alan Ranger 0 Pinterest0",
  "wordCount": 919,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/landscapes-photography-practise-assignment#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/landscapes-photography-practise-assignment#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}