{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/learn-how-to-use-lightroom#blogposting",
  "headline": "Learn how to use Lightroom to edit  | Professional Guide",
  "alternativeHeadline": "Learn how to use Lightroom to edit  | Professional Guide | Alan Ranger Photography",
  "description": "Learn how to set-up and use Lightroom to edit images on my Lightroom photography course or beginners introductory class | Coventry or Online | Open to All.",
  "url": "https://www.alanranger.com/blog-on-photography/learn-how-to-use-lightroom",
  "datePublished": "2016-09-09T00:00:00.000Z",
  "dateModified": "2016-09-09T00:00:00.000Z",
  "dateCreated": "2016-09-09T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Which Photography Courses Are Best For Me? Course Calendar Beginners Photography Course Free Online Photography Course Beginners Lightroom Course RPS Mentoring photography-lessons-online-1-2-1 Private 1-2-1 Lessons Monthly Mentoring Assignments Intentions Course 2.5hr - 4hr Workshops One-day Workshops Residential Workshops Gift Vouchers 1-2-1 Zoom Support Private 1-2-1 Lessons Gear Checks & Services Fine Art Prints Pick N Mix - Payment Plans Products, Services & Property Photography Portrait Photography Staff Training on Photography Blog Academy Recommended Products LEARN HOW TO USE LIGHTROOM TO EDIT | PROFESSIONAL GUIDELEARN HOW TO SET-UP AND USE LIGHTROOM TO EDIT IMAGESEditing photos is a necessary part of the photography workflow and can make the difference between an ordinary looking shot and a great looking shot.Take a look at this example of a photo that student, Aled, brought to me recently for review. The transformation between before and after took just 10 seconds using Adobe Lightroom.I am sure you’ll agree with Aled who said, “I can’t believe how much better it looks and how quickly you transformed it!”View fullsizeLIGHTROOM COURSE – 4 WEEKLY EVENING CLASSES,19TH SEP TO 3RD OCT 7PM – 9:45PM – SOLIHULL £250 * Mondays- Sep 19th, 26th, Oct 3rd & 10th * Max 8 Places * Suitable for any level * Laptop required * Basic computer literacy required (Navigation, copying, saving and usual standard commands) Lightroom Course details * Use Adobe Lightroom on a laptop computer * Learn how to organise, catalogue, keyword and rate your photos * Learn how to implement an efficient workflow to photo management and editing * Learn what the Lightroom modules do and how to configure them * Learn what the various editing options are and how to use them to create the best results * Learn how to keep your original intention intact so photo editing remains the polish rather than surgery on your photos * Learn when and how to use special affects plug-ins to give a profession e them * Learn what the various editing options are and how to use them to create the best results * Learn how to keep your original intention intact so photo editing remains the polish rather than surgery on your photos * Learn when and how to use special affects plug-ins to give a professional finish to your photos. * Learn how to create a slideshow, print and publish your photos on-lineSign up today news , lightroom , photography-tips , student-photos Alan Ranger 9 September 2016Alan Ranger Photography LinkedIn0 Pinterest0",
  "wordCount": 409,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/learn-how-to-use-lightroom#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/learn-how-to-use-lightroom#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}