{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/learn-how-to-use-lightroom#blogposting",
  "headline": "Learn how to use Lightroom to edit  | Professional Guide",
  "alternativeHeadline": "Learn how to use Lightroom to edit  | Professional Guide | Alan Ranger Photography",
  "description": "Learn how to use Lightroom to edit | Professional Guide Learn how to set-up and use Lightroom to edit images Editing photos is a necessary part of the.",
  "url": "https://www.alanranger.com/blog-on-photography/learn-how-to-use-lightroom",
  "datePublished": "2016-09-09T00:00:00.000Z",
  "dateModified": "2016-09-09T00:00:00.000Z",
  "dateCreated": "2016-09-09T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Learn how to use Lightroom to edit | Professional Guide Learn how to set-up and use Lightroom to edit images Editing photos is a necessary part of the photography workflow and can make the difference between an ordinary looking shot and a great looking shot.Take a look at this example of a photo that student, Aled, brought to me recently for review. The transformation between before and after took just 10 seconds using Adobe Lightroom.I am sure you’ll agree with Aled who said, “I can’t believe how much better it looks and how quickly you transformed it!” View fullsize Lightroom Course – 4 weekly evening classes,19th Sep to 3rd Oct 7pm – 9:45pm – Solihull £250 • Mondays- Sep 19th, 26th, Oct 3rd & 10th Max 8 Places Suitable for any level Laptop required Basic computer literacy required (Navigation, copying, saving and usual standard commands) Lightroom Course details Use Adobe Lightroom on a laptop computer Learn how to organise, catalogue, keyword and rate your photos Learn how to implement an efficient workflow to photo management and editing Learn what the Lightroom modules do and how to configure them Learn what the various editing options are and how to use them to create the best results Learn how to keep your original intention intact so photo editing remains the polish rather than surgery on your photos Learn when and how to use special affects plug-ins to give a professional finish to your photos. Learn how to create a slideshow, print and publish your photos on-line Sign up today news, lightroom, photography-tips, student-photosAlan Ranger9 September 2016Alan Ranger Photography LinkedIn0 Pinterest0",
  "wordCount": 268,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/learn-how-to-use-lightroom#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/learn-how-to-use-lightroom#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}