{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/learn-photography-how#blogposting",
  "headline": "Learn Photography - How? - 10,000 Hours of Practice",
  "alternativeHeadline": "Learn Photography - How? - 10,000 Hours of Practice | Alan Ranger Photography",
  "description": "More random mumblings on why and how to learn photography - will 10,000 hours make a difference? It might if you practise the right things, not the wrong things.",
  "url": "https://www.alanranger.com/blog-on-photography/learn-photography-how",
  "datePublished": "2021-07-05T00:00:00.000Z",
  "dateModified": "2021-07-05T00:00:00.000Z",
  "dateCreated": "2021-07-05T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "LEARN PHOTOGRAPHY - HOW? - 10,000 HOURS OF PRACTICELEARN PHOTOGRAPHY - 10,000 HOURS OF PRACTICEI am sure you know the meme from Malcolm Gladwell, about the 10,000 hour rule?Gladwell explains that reaching the 10,000-Hour Rule, which he considers the key to success in any field, is simply a matter of practicing a specific task that can be accomplished with 20 hours of work a week for 10 yearsI have also made the point, in lectures and classes, that If you practice something incorrectly for 10,000 hours you will be a master at doing it incorrectly.Sanjay Srivastava, made interesting points in his paper in “The Hardest Science” that apart from simply practice there has to be an innate talent to start with and goes on to point out that “luck” and “privilege” also play an important part in becoming successful. In layman's terms, these debates about what makes someone become ultra successful/good at what they do have been propagated and simplified to provide a way of conveying that all you need to do is practice and work hard and the results will come. The article goes on to make the case that there may be at least four elements involved in very successful outcomes, of course this largely depends on your measurement of success. * Talent - there is such a thing as talent and that it matters for success * Preparation - that practicing for 10,000 hours will goes on to make the case that there may be at least four elements involved in very successful outcomes, of course this largely depends on your measurement of success. * Talent - there is such a thing as talent and that it matters for success * Preparation - that practicing for 10,000 hours will make you better * Luck - being in the right place at the right time * Privilege - having the means (resources) to access the opportunityThis reminds me of a project I worked on as a management consultant twenty years or so ago. The organisation was attempting to change culture and bring about change in the way individuals worked to be better, as part of the sum of the digits, to produce momentum and create a swing in positive “outcomes”. I worked with a fellow external consultant, Howard, who worked with the British Rugby Team, prior to their world cup win in 2003, as a sports psychologist.The “simplified” philosophy became P=CxA2P= PerformanceC= CapabilityA2= Attitude SquaredMeaning, your performance is based on your innate capability multiplied by your attitude squared. This translates to whatever your capability is, your attitude has a larger factor to produce a better performance than your innate ability. Or in even simpler terms, loads of capability but poor attitude produces a piss poor performance and even a little little capability with a great attitude produces a great performance. PERFORMANCEYou only need to compare the performances and outcomes of the last two English World Cup Football teams. Consider the difference in how well England performed and progressed in 2014, with arguably a better squad of players but went out in qualifying rounds, verses 2018, where England reached the semi-finals with (arguably) less capability but a better attitude. An additional factor of leadership (tutor) may be brought into the equation too.I don’t have any major objection to the simplification of a narrative if it helps to inform and focus the reader's/receivers mind on the bigger picture rather than the details and problems of everything else.However the oversimplification of some things, (consider how the Brexit campaign was portrayed to the British Public as an example. Both sides made arguments that oversimplified what is clearly a very complex subject and one, in my opinion, that should not have been put to a referendum) can create a false paradigm. In the pursuit of becoming a better photographer, whether it’s for personal pleasure and hobby, professionally or any other purpose. It’s too easy to think that you just need buy the right gear, go to the right places, get enough social media likes and attention, sell a print, offer a portrait/wedding shoot or just practice lots to consider yourself successful or good.We all strive, aim and want to become better at whatever we do in life, whether it’s fitness, health, diet, a hobby, relationships, our career and so on. Suggesting that there are a set of simple steps, rules, guidelines or memes that we can adopt to achieve these goals is just a way of helping us focus our efforts and renew our motivation to improve. I am always hesitant, and even uncomfortable, about writing and proposing “10 Steps to…” becau on. Suggesting that there are a set of simple steps, rules, guidelines or memes that we can adopt to achieve these goals is just a way of helping us focus our efforts and renew our motivation to improve. I am always hesitant, and even uncomfortable, about writing and proposing “10 Steps to…” because they are in some way a false paradigm too. Despite the fact that I have written and sell “Pocket Guides - My Top Tips”However, having taught and met thousands of photographers at the novice and beginners level, I know they need a simplification of information, so they can see a way forwards and have a framework to work on a progress with. Ten step guides are useful for beginners learning about shutter speed, white balance, depth of field, rule of thirds, focusing, lighting and composition, metering and other aspects to learn the basics.I have been providing photography courses for beginners for the last six years on digital photography to help novices take what they feel are good photos and using editing software to become better photos through post production. Most don’t aspire to be a professional photographer, most just want to improve their photography skills for personal satisfaction and enjoyment of their hobby and subjects/places they photograph and experience.Not many have an innate creative and technical talent to take it a step further, so proposing that 10,000 hrs will make you successful, is of course false, if you don’t possess the raw ingredients that are required to meet your criteria of “success”. If you add the ingredients of Luck - (to be in the right place at the right time) and Privilege (the means to access) to the mix then it’s understandable to see how few can achieve panicea. STAGES OF DEVELOPMENT - LEARN PHOTOGRAPHYIMITATEHowever, for most people I meet, fortunately, panicea is based on a different model and criteria of success. Most just want to end the frustration of not understanding terminology, science and technicalities of the camera - The Mechanics. Using the camera to maximise its potential and help capture and record what they see and where they are. This is often based on a criteria of imitating shots they have seen of a subject or location and trying to put their own spin on it which of course will rely on circumstance (luck and privilege) of when they are there with what talent and preparation they have.Learning to use the instrument correctly, in this case the camera, is largely a technical exercise, coupled with practical experience and objective evaluation of the results. The objective evaluation can be achieved in many ways depending on your assessment of what’s valuable and insightful verses the extreme of what strokes your ego.For my own part, entering competitions, exhibitions, gaining accreditations and being part of the photographic communities ways of acknowledgement played a big part of getting external feedback on my work and progress. Whether it’s through camera clubs, the RPS, BPE or some other form and society, external feedback and formal recognition plays an important part of giving us targets, milestones and a way of motivating us to strive for improvement. I didn’t, and often don’t agree, with those assessments, outcomes and criteria but those are the ways and rules of those bodies so you have to play by them or vote with your feet and ignore them.ASSIMILATEOnce we have achieved a certain standard and have the confidence to execute technically, we sta n’t, and often don’t agree, with those assessments, outcomes and criteria but those are the ways and rules of those bodies so you have to play by them or vote with your feet and ignore them.ASSIMILATEOnce we have achieved a certain standard and have the confidence to execute technically, we start to face some difficult challenges. Assimilation - Making choices about what and how we photograph, applying our “personal” style to it through more considered compositions and skillful post-production. This part of the process becomes more difficult because it relies on having some talent, awareness and attitude and one could argue that luck and privilege play a part too.Creating images that speak to the reason for it, the intention, conveying the photographers interpretation and skillful presentation of their subject matter rely on being a master (or at least proficient) of the mechanics. Having a clear personal style and way of seeing and connecting to the subject matter is an ongoing journey that will mean a return to some new mechanics. You may imitate the work of others with more skill than before, and have less external confirmation as the pool of external credible assessors becomes shallower and therefore sometimes easier to ignore. However this stage is often a tipping point too.Gladwell defines a tipping point as \"the moment of critical mass” The idea, appetite, motivation, commitment reaches a tipping point for many, whose interest in photography is enjoyment and recreation rather than a passion and way of expression through the medium of a camera. Very few go on to strive for something beyond this point and, understandably, are fulfilled with what they have achieved and can produce when motivated to do so.INNOVATEThe personal execution of photography is a much sought after ideal. Is it possible to innovate and be original and unique in a field where literally hundreds of millions of people take literally billions of photos on a daily basis? We visit the same places, see similar things but somehow some people manage to see, capture and express the same thing we experience in a way that speaks a different language.Innovation is the direct result of hours upon hours of imitation and assimilation. It’s the result of travelling that road of learning every lesson, putting it into regular practice with confidence and reason and then taking it to another level. Of course there are different stages and levels within this and some people seem create something completely unique, others variations of uniqueness. What’s most important is it doesn’t have to be 100% unique - It has to be 100% authentically YOU, and you have to be fulfilled with the work regardless of external opinion.WHERE DOES THIS LEAVE US? - LEARN PHOTOGRAPHYNot everyone wants to become a professional, achieve formal accreditations or qualifications. Most people I meet simply enjoy photography as a hobby and means of getting out and exploring new places and environments. Naturally some want more or less input, guidance and challenges.I will write something soon to share my insights of the photography lessons I feel will benefit any level of photographer with any level of ambition. It will be based on my fifteen plus years of being passionate about this craft and my own journey of development. It will cover the intellectual, emotional and physical steps required to improve year on year.The most important advice I can give and best less otographer with any level of ambition. It will be based on my fifteen plus years of being passionate about this craft and my own journey of development. It will cover the intellectual, emotional and physical steps required to improve year on year.The most important advice I can give and best lesson is, to only do what you enjoy and get some sense of satisfaction from. It’s about having fun and enjoying the experience more than other outcomes.a-journey , photography-tips Alan Ranger 5 July 2021Alan Ranger Photography LinkedIn0 Pinterest0",
  "wordCount": 1996,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/learn-photography-how#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/learn-photography-how#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    }
  ]
}