{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/lightroom-classic-latest-version-whats-new#blogposting",
  "headline": "Lightroom Classic Latest Version 13.3 - What's New",
  "alternativeHeadline": "Lightroom Classic Latest Version 13.3 - What's New | Alan Ranger Photography",
  "description": "Table of Contents Show.",
  "url": "https://www.alanranger.com/blog-on-photography/lightroom-classic-latest-version-whats-new",
  "datePublished": "2024-05-17T00:00:00.000Z",
  "dateModified": "2024-05-17T00:00:00.000Z",
  "dateCreated": "2024-05-17T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Lightroom Classic Latest Version 13.3 - What's New Table of Contents Show Lightroom Classic Latest Version 13.3 - What's New? Adobe Lightroom remains at the forefront of digital photography management and image conversion, continuously evolving to meet the needs of modern photographers. With each Lightroom update, Adobe demonstrates a commitment to innovation, enhancing the capabilities of its photography suite to help creatives achieve their visions with greater precision and ease. Adobe Lightroom Classic Latest Version is no exception, introducing powerful new features and improvements designed to streamline workflow, enhance image quality, and expand creative possibilities. This update underscores the importance of staying updated with the latest advancements in digital imaging software to maintain a competitive edge in the photography industry. The newest enhancements in Adobe Lightroom Classic have sparked interest among photography professionals and enthusiasts alike, eager to explore the generative AI tools, new tethering and lens support, AI-based depth blur, and point colour editing features. This update includes significant performance improvements, expanded camera and lens support, HDR display and editing capabilities, and other enhancements pushing photographic editing and organisation boundaries. As we delve into the specifics of these Lightroom updates, photographers can look forward to detailed discussions on how each feature can enhance their creative workflow, hone their skills, and express their unique vision through photography. Adobe Lightroom Classic Latest Version: A Closer Look at What's New for Photographers Generative AI Tools Lightroom Classic Latest Version has introduced the Generative Remove tool, leveraging Adobe Firefly's generative AI This technology tool allows photographers to effortlessly eliminate ample distractions or unwanted objects from their photos, such as tourists, trash cans, or signs, enhancing the overall composition and focus of the image. How to Use Generative Remove • Accessing the Tool To begin using Generative Remove, photographers can select the Remove tool in Lightroom Classic. By default, generative AI is off, allowing the use of traditional removal methods. However, activating the Generative AI option transforms the tool's capabilities, enabling it to tackle more complex removal tasks. Removing Distractions After enabling Generative AI, users can paint over the object or area they wish to remove. Lightroom Classic then displays a red overlay of the masked area, offering mask refinement options. By applying the changes, Lightroom generates multiple variations of the area without the unwanted object, using Adobe Firefly's generative AI. Choosing the Best Outcome Once the variations are generated, users can review and select the one that best fits their vision. If unsatisfied with the options, they can refresh to create additional variations. This feature is handy for achieving a seamless blend with the surrounding image areas. Limitations and Best Practices While the Generative Remove tool offers significant advantages, there are a few considerations to keep in mind: Internet Requirement: The tool requires an internet connection to perform computations in the cloud. This dependency may affect its usability in environments without stable internet access. Resolution Differences: Areas retouched with Generative AI may exhibit lower resolution Compared to surrounding areas, which might be noticeable in large prints or regions with significant detail. It's advisable to use this tool judiciously, especially for images intended for high-resolution outputs. Efficiency Tips: standard Heal and Clone tools are recommended for smaller areas or less complex retouching tasks. These tools are more suited for quick edits like removing sensor spots or minor blemishes, ensuring efficient workflow without compromising image quality. Early Access Label: As the Generative Remove feature is labelled 'Early Access,' it's still undergoing development and improvements. Adobe encourages users to provide feedback to enhance the tool's performance and functionality over time. By understanding the Generative Remove tool's capabilities and limitations, photographers can effectively incorporate this advanced technology into their editing workflow, pushing the boundaries of creative expression and efficiency in digital photography. New Tethering and Lens Support Adobe Lightroom Classic Latest Version continues to enhance the photography experience with its latest update, focusing on new tethering and lens support that broadens the scope for photographers in terms of equipment compatibility and functionality. This section delves into the specifics of supported camera models and lens profiles, showcasing Adobe Lightroom Classic's commitment to providing comprehensive camera support for a wide range of photography equipment in line with the latest Lightroom versions. Supported Camera Models Adobe Lightroom Classic Latest Version have extended their tethered capture support to include a variety of camera models, enhancing the versatility of Lightroom 6 and keeping up with the evolving lightroom versions. across different manufacturers This feature allows photographers to connect their cameras directly to their computers, enabling immediate image transfer, viewing, and editing within Lightroom Classic. The supported camera brands include Canon, Nikon, Sony, and other manufacturers, ensuring a broad spectrum of photographers can benefit from this functionality. For Canon and Nikon cameras, Lightroom Classic also supports Live View, enhancing the tethering experience by allowing photographers to view their shots live on their computer screens as they shoot, a testament to the evolving Lightroom versions. With the May 2024 release of Lightroom Classic (version 13.3), tether capture support has been notably expanded for Sony cameras. Photographers using Sony cameras can now connect their devices to their computers, select PC remote mode, and start tethered capture directly from Lightroom Classic, marking a significant update in the Adobe Lightroom Classic Latest Version. several Sony camera models. Such as Alpha 1, Alpha 9 series, Alpha 7S III, Alpha 7R IV, and more, marking a significant enhancement in the software's compatibility with Sony equipment. Supported Lens Profiles Lightroom Classic Latest Version also introduces new lens profiles, facilitating automatic correction of common lens aberrations like geometric distortion and vignetting. These profiles are included with Adobe Photoshop, Lightroom, and the Camera Raw plug-in, aligning with the updates in the Lightroom Classic latest version.covering a wide array of lenses From manufacturers such as Hasselblad, Leica, SIGMA, and Xiaomi. Adding these profiles in the May 2024 update (ACR version 16.3) further exemplifies Adobe's dedication to providing photographers with the tools they need to achieve high-quality image correction and enhancement. This table represents a snapshot of the latest lens profiles added, underlining the continuous effort to support a growing list of lenses and camera equipment. It's important to note that some lens correction profiles are available for raw formats only and not for JPEGs, PNGs, or TIFFs, emphasizing the focus on high-quality raw image processing. Lightroom Classic Latest Version tethering functionality and lens profile support, key features in its various Lightroom versions, are integral components of its comprehensive RAW processing and photo management capabilities. By facilitating direct access to many of the camera's settings from the computer, along with instant viewing, zooming, rating, and tagging of shots, Lightroom Classic enhances the photography workflow, making it more efficient and productive. For the most up-to-date information regarding camera and lens compatibility, photographers are encouraged to refer to the manufacturer's website or Adobe's published list of Lightroom Tethering Support. AI-Based Depth Blur Lightroom Classic Latest Version introduces an innovative feature known as AI-based Depth Blur, which significantly enhances the depth of field in digital photographs using artificial intelligence. This feature, a highlight of the latest Lightroom version, mimics the optical blur effects that photographers achieve with different aperture settings on their cameras, offering a range of creative possibilities without needing to reshoot or adjust hardware settings. What is Depth Blur? Depth Blur in Adobe Lightroom Classic applies a depth-based blur effect akin to the blur produced by real-world optical lenses. It utilises AI-generated or device-captured depth data to simulate the effect, automatically prioritising focus on the detected subject while allowing for interactive focus distance adjustments. Users can customise the bokeh shapes, highlight boosts, and make depth map refinements, providing a comprehensive toolset for achieving the desired aesthetic in their images. Steps to Apply Depth Blur Activating Lens Blur To use the Lens Blur feature, users click beside the word 'Apply' in Lightroom Classic. The software then employs its AI engine to identify the photo's subject and apply a suitable background blur. Adjusting Blur Strength The blur amount slider allows users to control the intensity of the blur effect. Adjusting this slider helps achieve a more realistic look, with recommendations to avoid setting it too high to prevent the image from appearing artificial. Visualizing Depth and Focal Range: users can view a depth map of focus areas in cool and warm tones by selecting the Visualize Depth checkbox. This feature aids in understanding the spatial relationship of objects in the photo and adjusting the focal range accordingly. Refining Focus and Blur Areas: The Brush Refinement tool The Depth Blur feature enables precise adjustments within the image. Users can select Focus to specify areas to remain sharp or Blur to indicate areas to soften. The Amount, Size, Feather, and Flow sliders offer further control over the effect's intensity and spread. Utilising Presets and Depth Data For images with existing depth data, such as those in .HEIC format, Lens Blur supports seamless integration, streamlining the process.Device Depth Additionally, Blur Background Adaptive Presets automatically identify the subject and scan the scene to apply the blur effect intelligently. This table outlines the key steps and features in applying Depth Blur in Adobe Lightroom Classic, showcasing the blend of AI technology with traditional photography techniques to enhance the creative process. Point Colour EditingUsing the Eyedropper Tool Lightroom Classic Latest Version Point Colour feature introduces a transformative approach to colour editing, allowing photographers to manipulate specific colours within their images with precision. To begin, users can utilise the Eyedropper tool to select the exact colour they wish to adjust. This selection is made easy by creating a mask over the desired area, after which the Eyedropper tool is used within the mask to pick the target colour. Once a colour is selected, the right-hand panel provides sliders for adjusting Hue, Saturation, and Luminance. This enables photographers to enhance or modify the colour to their liking, whether it’s making greens more vibrant or adjusting skin tones to appear more natural. The flexibility of this tool extends to adjusting colors in layers, allowing for multiple adjustments on the same selection without affecting the overall image. Fine-Tuning Colors After selecting the color with the Eyedropper tool, photographers have the ability to fine-tune their colors using the provided sliders. For instance, if the initial selection captures areas of similar brightness, the mask can be adjusted to refine the area of effect. This is done by manipulating the feather, size, and light within the selection, ensuring that the adjustments are precise and only affect the intended areas. Furthermore, for images requiring adjustments beyond basic colour changes Additionally, the HSL Panel offers advanced options. Here, users can individually adjust the Hue, Saturation, and Luminance of specific colour ranges. This is particularly useful when needing to tone down overly vivid colours or when aiming for a specific mood by altering the visual temperature of the scene. This structured approach to color editing not only enhances the workflow but also empowers photographers to achieve their creative vision with high precision and flexibility. Enhanced Performance Lightroom Classic Latest Version updates have significantly enhanced overall performance, particularly in image conversion and metadata handling. These improvements ensure a more efficient workflow for photographers, allowing them to manage and edit their images with greater speed and less friction, showcasing the improved Lightroom performance in the Lightroom Classic latest version. Faster Image Conversion Lightroom Classic Latest Version has incorporated several features under its Enhance module to boost image quality during conversion. The Denoise function uses artificial intelligence to reduce image noise without compromising fine details, essential for maintaining image clarity. The Raw Details feature, previously known as Enhance Details, is designed to produce crisp detail and improved colour rendering, significantly benefiting large print outputs. Additionally, the Super Resolution tool doubles the linear resolution and increases the width and height of images by 2x, which is particularly useful for enhancing the resolution of cropped images. These features leverage the GPU intensively and can also utilise an external GPU to improve performance further, ensuring that photographers can process high-quality images swiftly. With the integration of Apple Neural Engine in the latest updates, Adobe Lightroom Classic continues to push the boundaries of image processing technology. AI Denoise has been optimised for Mac users with Apple Silicon, providing substantial speed enhancements in image processing. Improved Metadata Handling The metadata handling in Adobe Lightroom Classic has seen considerable improvements, making it easier for photographers to organise and manage their image files effectively. Metadata standards supported include those from the International Press Telecommunications Council (IPTC), which covers a wide range of information, such as descriptions, keywords, and credits. This metadata is synchronised across various formats like EXIF, IPTC (IIM), and TIFF, using the Extensible Metadata Platform (XMP) to ensure consistency and ease of management. These enhancements in Lightroom metadata management significantly streamline the workflow for photographers. Recent updates have modified the frequency of XMP data writing in the Develop module. Now, XMP files are created post-import and updated based on specific user actions.reducing the frequency of disk writes Lightroom Classic also allows users to customise the metadata fields displayed in the Metadata panel, which can be arranged according to preference to streamline the workflow further. By optimising image conversion and metadata handling, Adobe Lightroom Classic ensures photographers can focus more on creative aspects while spending less time on technical processes. These enhancements improve the user experience and bolster the software's capability to handle large volumes of high-quality images efficiently. Expanded Camera and Lens SupportNewly Supported Cameras Lightroom Classic latest version has expanded its compatibility with a range of new camera models, ensuring that photographers have more tools at their disposal for capturing high-quality images. The newly supported cameras include the Fujifilm X100VI, which offers four camera-matching profiles, enhancing the photographer's ability to achieve desired colour and detail directly in post-processing. The Fujifilm X-T50 and the Leica Leitz Phone 3 are also newly supported, broadening the scope for photographers who utilise these devices. These new cameras provide more options for achieving professional-grade results. Additionally, Nikon enthusiasts will be pleased with the new Z8 and Z9 camera matching profiles in the Lightroom Classic latest version, which are designed to maximise the potential of these high-end cameras, for those using Ricoh cameras, the GR III HDF and GR IIIx HDF models are now supported, providing more options for compact camera users. Sony’s ILX-LR1, along with several Xiaomi models including the Xiaomi Civi 4 Pro with its various camera options, are also included in the latest update, ensuring support across a diverse range of technology and camera types. Newly Supported Lenses Lightroom Classic Latest Version includes an extensive addition of new lens profiles in the, which are crucial for correcting common lens aberrations such as geometric distortion and vignetting. The update includes profiles for various lenses from Hasselblad, Leica, SIGMA, and Xiaomi. The Hasselblad XCD 2,5/25V is now supported for Hasselblad users, ensuring that images captured with this lens are automatically corrected for any optical flaws. Leica has added support for the Leitz Phone 3’s front and rear cameras, enhancing the quality of images taken with this unique device. In this update, SIGMA has introduced several new lenses, including the 15mm F1.4 DG DN Diagonal Fisheye A024 and the 50mm F1.2 DG DN A024, both of which are available for SIGMA L and Sony FE mounts. Additionally, the 24-70mm F2.8 DG DN II A024 and the 500mm F5.6 DG DN OS S024, along with its teleconverters TC-1411 and TC-2011, are now supported, offering a wide range of options for photographers specialising in everything from wide-angle landscapes to detailed wildlife shots. Xiaomi’s latest models, such as the Xiaomi 14 Ultra and Xiaomi Civi 4 Pro, have also seen an expansion in supported lens profiles. This includes the Xiaomi 14 Ultra’s front camera, super telephoto, telephoto, ultrawide, and wide cameras, as well as the Xiaomi Civi 4 Pro’s front ultrawide and wide cameras, ensuring that users of these devices can achieve the best possible image quality. This table provides a concise overview of the latest lenses added to Adobe Lightroom Classic, highlighting the ongoing commitment to enhancing the photographic workflow through comprehensive support for a variety of camera and lens combinations. HDR Display and EditingActivating HDR Mode Lightroom Classic latest version has enhanced its capabilities with the introduction of High Dynamic Range (HDR) Output, allowing photographers to view and edit HDR photos on compatible HDR displays.HDR Output, users should navigate to Develop > Basics > HDR Selecting HDR in Lightroom Classic enables all related options across various editing tools, histograms, and sliders, optimising images for HDR screens. For convenience, HDR editing can be set as the default mode for HDR photos by selecting the appropriate settings. Edit > Preferences > Presets and enabling HDR editing by default. Supported Image Types for HDR Editing When HDR editing is enabled by default, certain image types are automatically set for HDR editing: DNG files created using Merge to HDR in Camera Raw or Lightroom apps Apple HEIC and JPEG files from iPhone 12 or later JPEG images exported from Camera Raw or Lightroom apps with HDR enabled Canon and Sony HDR HEIF files It is important to note that the Lightroom Classic Develop module only supports HDR content display in the Develop loupe view, including side-by-side and split views. However, HDR display is not supported in the Library module, Slideshow module, Full-screen view, Filmstrip thumbnails, or other dialogues that display photo content. Exporting HDR Images Once editing in HDR mode is complete, exporting the images is straightforward. Users should select the appropriate Lightroom export settings. File > Export > File Settings Choose the desired file format from the drop-down menu, enable the HDR Output checkbox, and then select Export. Lightroom Classic supports several non-Raw formats.HDR file formats for various purposes: Supported Non-Raw HDR File Formats AVIF and JPEG XL: Recommended for sharing and web applications, such as online web galleries TIFF and PSD: Suitable for workflows where additional HDR work is required, such as compositing When saving HDR images in JPEG format, Lightroom Classic reads the screen used and renders SDR or HDR images accordingly, ensuring optimal display quality. By utilising the HDR Display and Editing features in Adobe Lightroom Classic, photographers can significantly enhance their images' dynamic range and visual impact, catering to both professional and high-quality presentation needs. Additional EnhancementsEdit History Preview Lightroom Classic latest version has significantly improved the user experience by enhancing the edit history functionality. Unlike its cloud-based counterpart, Lightroom Classic offers a comprehensive history panel that allows users to view each step taken during the photo editing process. This feature is crucial for professionals who need to track changes or revert to earlier versions of their work. The history panel displays all the steps from the moment the image was imported, and users can click on any step to revert to that specific state in the editing process. Additionally, users can clear their history at any time, which does not alter the current settings of the image but simply removes the visual record of the editing steps. Improved Import Options The import process in Adobe Lightroom Classic latest version has been refined to offer more control and flexibility. Users can now specify options for handling files during the import process, including the ability to create a backup copy of the original photo files. This is particularly useful for ensuring data integrity and managing file storage effectively. Additionally, Lightroom Classic can automatically detect and ignore suspected duplicate files based on criteria such as filename, Exif capture date and time, and file size, which helps in maintaining an organised and clutter-free catalog. Customising File Handling and Preview Generation During import, photographers can choose how their files are named and how previews are built, which enhances workflow efficiency. The File Renaming panel allows for custom file naming using templates, and users can type a custom name if needed. Regarding preview generation, Lightroom Classic offers options to display a photo's embedded preview immediately or to generate higher-quality previews that are color-managed. This flexibility allows photographers to choose between faster browsing or more accurate colour representation depending on their immediate needs. Applying Develop Settings and Keywords To streamline the editing process, users can apply any Develop settings preset to photos as they are imported. This feature is especially beneficial when working with photos from a camera for which a user has created specific Lightroom presets. Moreover, photographers can add keywords during the import process, which aids in categorising and retrieving images more efficiently. Keywords can be typed directly into the Keywords text box, and multiple entries can be separated by commas. This table summarises the key enhancements in the import functionality of Adobe Lightroom Classic, highlighting the added flexibility and control available to photographers to optimize their initial workflow steps. Conclusion - Lightroom Classic Latest Version Through this comprehensive analysis, Adobe Lightroom Classic latest version emerges as an indispensable tool for photographers seeking to leverage advanced technology for their art. By integrating powerful features such as Generative AI Tools, expanded tethering and lens support, AI-based depth blur, and point colour editing, Adobe facilitates a more streamlined workflow and broadens the horizons for creative expression. The enhancements in the Lightroom latest version are designed to meet the evolving needs of modern photographers, underpinning Adobe's commitment to pushing the boundaries of digital imaging software.solidifying Lightroom Classic's position at the pinnacle of photo editing and management solutions. Moreover, with the addition of improved performance metrics, expanded camera and lens support, and the introduction of HDR display and editing capabilities, Lightroom Classic stands out as a comprehensive suite that caters to a wide spectrum of photography professionals and enthusiasts. These updates underscore the importance of constant evolution in the rapidly advancing field of photography, encouraging users to explore new artistic possibilities while ensuring their workflow remains efficient and cutting-edge. As the digital landscape continues to shift, Adobe Lightroom Classic's adherence to innovation and user-centered improvements keeps it a step ahead in terms of Lightroom compatibility.offering tools that not only enhance the quality of photographic work but also enrich the creative journey. Please feel welcome to reach out to me with your questions and photo editing queries or sign up for my Lightroom Classic Classes and photography lessons FAQs - Lightroom Classic Latest Version 1. What is the most recent release of Adobe Lightroom Classic?The latest version of Adobe Lightroom Classic is version 13, released in 2024. 2. What are the new features in Adobe Lightroom Classic 2024?Adobe Lightroom Classic 2024 introduces an AI-based depth Blur feature that enhances your creative options. This tool allows photographers to create a realistic depth-of-field effect by generating an artificial depth map for the image. The map is then used to apply a corresponding blur, making Lightroom editing even more versatile. 3. Which version of Lightroom is recommended for professional photographers?Lightroom Classic is recommended for professional and advanced photographers. It includes specialised tools such as Smart Collections, Import options, Range Masking, and Soft Proofing that cater to more experienced users. For those looking to master these features, Lightroom Classic tutorials can be incredibly beneficial. 4. How can I update Adobe Lightroom Classic to the latest version?To update Adobe Lightroom Classic to the latest version, open Lightroom and navigate to Help > Updates. If you would like more detailed instructions, you can refer to the 'Update Creative Cloud apps' section on Adobe's website. Following these Lightroom update instructions ensures you have access to the latest features and improvements. recommended-productsAlan Ranger17 May 2024Alan Ranger Photography LinkedIn0 Pinterest0",
  "wordCount": 3916,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/lightroom-classic-latest-version-whats-new#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/lightroom-classic-latest-version-whats-new#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}