{
  "@context": "https://schema.org",
  "@graph": [
    {
      "@type": "WebPage",
      "@id": "https://www.alanranger.com/blog-on-photography/lightroom-classic-latest-version-whats-new#webpage",
      "url": "https://www.alanranger.com/blog-on-photography/lightroom-classic-latest-version-whats-new",
      "name": "Lightroom Classic Latest Version 13.3 - What's New",
      "description": "Table of Contents Show?Adobe Lightroom remains at the forefront of digital photography management and image conversion, continuously evolving to meet the.",
      "inLanguage": "en-GB",
      "isPartOf": {
        "@id": "https://www.alanranger.com#website"
      },
      "primaryImageOfPage": {
        "@id": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1716541561477-4IDUA8JMVAP8I1Q05IIZ/lightroom+classic+latest+version.jpg"
      }
    },
    {
      "@type": "BreadcrumbList",
      "@id": "https://www.alanranger.com/blog-on-photography/lightroom-classic-latest-version-whats-new#breadcrumb",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://www.alanranger.com"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Blog",
          "item": "https://www.alanranger.com/blog-on-photography"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Lightroom Classic Latest Version 13.3 - What's New",
          "item": "https://www.alanranger.com/blog-on-photography/lightroom-classic-latest-version-whats-new"
        }
      ]
    },
    {
      "@type": "BlogPosting",
      "@id": "https://www.alanranger.com/blog-on-photography/lightroom-classic-latest-version-whats-new#blogposting",
      "headline": "Lightroom Classic Latest Version 13.3 - What's New",
      "alternativeHeadline": "Lightroom Classic Latest Version 13.3 - What's New | Alan Ranger Photography",
      "description": "Table of Contents Show?Adobe Lightroom remains at the forefront of digital photography management and image conversion, continuously evolving to meet the.",
      "url": "https://www.alanranger.com/blog-on-photography/lightroom-classic-latest-version-whats-new",
      "mainEntityOfPage": {
        "@type": "WebPage",
        "@id": "https://www.alanranger.com/blog-on-photography/lightroom-classic-latest-version-whats-new#webpage"
      },
      "datePublished": "2024-05-17T00:00:00+00:00",
      "dateCreated": "2024-05-17T00:00:00+00:00",
      "dateModified": "2024-05-17T00:00:00+00:00",
      "inLanguage": "en-GB",
      "articleBody": "LIGHTROOM CLASSIC LATEST VERSION 13.3 - WHAT'S NEWTable of Contents ShowLIGHTROOM CLASSIC LATEST VERSION 13.3 - WHAT'S NEW?Adobe Lightroom remains at the forefront of digital photography management and image conversion, continuously evolving to meet the needs of modern photographers. With each Lightroom update, Adobe demonstrates a commitment to innovation, enhancing the capabilities of its photography suite to help creatives achieve their visions with greater precision and ease. Adobe Lightroom Classic Latest Version is no exception, introducing powerful new features and improvements designed to streamline workflow, enhance image quality, and expand creative possibilities. This update underscores the importance of staying updated with the latest advancements in digital imaging software to maintain a competitive edge in the photography industry.The newest enhancements in Adobe Lightroom Classic have sparked interest among photography professionals and enthusiasts alike, eager to explore the generative AI tools, new tethering and lens support, AI-based depth blur, and point colour editing features. This update includes significant performance improvements, expanded camera and lens support, HDR display and editing capabilities, and other enhancements pushing photographic editing and organisation boundaries. As we delve into the specifics of these Lightroom updates, photographers can look forward to detailed discussions on how each feature can enhance their creati mera and lens support, HDR display and editing capabilities, and other enhancements pushing photographic editing and organisation boundaries. As we delve into the specifics of these Lightroom updates, photographers can look forward to detailed discussions on how each feature can enhance their creative workflow, hone their skills, and express their unique vision through photography.ADOBE LIGHTROOM CLASSIC LATEST VERSION: A CLOSER LOOK AT WHAT'S NEW FOR PHOTOGRAPHERSGENERATIVE AI TOOLSLightroom Classic Latest Version has introduced the Generative Remove tool, leveraging Adobe Firefly's generative AI This technology tool allows photographers to effortlessly eliminate ample distractions or unwanted objects from their photos, such as tourists, trash cans, or signs, enhancing the overall composition and focus of the image.HOW TO USE GENERATIVE REMOVE 1. Accessing the Tool To begin using Generative Remove, photographers can select the Remove tool in Lightroom Classic. By default, generative AI is off, allowing the use of traditional removal methods. However, activating the Generative AI option transforms the tool's capabilities, enabling it to tackle more complex removal tasks. 2. Removing Distractions After enabling Generative AI, users can paint over the object or area they wish to remove. Lightroom Classic then displays a red overlay of the masked area, offering mask refinement options. By applying the changes, Lightroom generates multiple variations of the area without the unwanted object, using Adobe Firefly's generative AI. 3. Choosing the Best Outcome Once the variations are generated, users can review and select the one that best fits their vision. If unsatisfied with the options, they can refresh to create additional variations. This feature is handy for achieving a seamless blend with the surrounding image areas.LIMITATIONS AND BEST PRACTICESWhile the Generative Remove tool offers significant advantages, there are a few considerations to keep in mind: * Internet Requirement: The tool requires an internet connection to perform computations in the cloud. This dependency may affect its usability in environments without stable internet access. * Resolution Differences: Areas retouched with Generative AI may exhibit lower resolution Compared to surrounding areas, which might be noticeable in large prints or regions with significant detail. It's advisable to use this tool judiciously, especially for images intended for high-resolution outputs. * Efficiency Tips: standard Heal and Clone tools are recommended for smaller areas or less complex retouching tasks. These tools are more suited for quick edits like removing sensor spots or minor blemishes, ensuring efficient workflow without compromising image quality. * Early Access Label: As the Generative Remove feature is labelled 'Early Access,' it's still undergoing development and improvements. Adobe encourages users to provide feedback to enhance the tool's performance and functionality over time.By understanding the Generative Remove tool's capabilities and limitations, photographers can effectively incorporate this advanced technology into their editing workflow, pushing the boundaries of creative expression and efficiency in digital photography.NEW TETHERING AND LENS SUPPORTAdobe Lightroom Classic Latest Version continues to enhance the photography experience with it hers can effectively incorporate this advanced technology into their editing workflow, pushing the boundaries of creative expression and efficiency in digital photography.NEW TETHERING AND LENS SUPPORTAdobe Lightroom Classic Latest Version continues to enhance the photography experience with its latest update, focusing on new tethering and lens support that broadens the scope for photographers in terms of equipment compatibility and functionality. This section delves into the specifics of supported camera models and lens profiles, showcasing Adobe Lightroom Classic's commitment to providing comprehensive camera support for a wide range of photography equipment in line with the latest Lightroom versions.SUPPORTED CAMERA MODELSAdobe Lightroom Classic Latest Version have extended their tethered capture support to include a variety of camera models, enhancing the versatility of Lightroom 6 and keeping up with the evolving lightroom versions. across different manufacturers This feature allows photographers to connect their cameras directly to their computers, enabling immediate image transfer, viewing, and editing within Lightroom Classic. The supported camera brands include Canon, Nikon, Sony, and other manufacturers, ensuring a broad spectrum of photographers can benefit from this functionality. For Canon and Nikon cameras, Lightroom Classic also supports Live View, enhancing the tethering experience by allowing photographers to view their shots live on their computer screens as they shoot, a testament to the evolving Lightroom versions.With the May 2024 release of Lightroom Classic (version 13.3), tether capture support has been notably expanded for Sony cameras. Photographers using Sony cameras can now connect their devices to their computers, select PC remote mode, and start tethered capture directly from Lightroom Classic, marking a significant update in the Adobe Lightroom Classic Latest Version. several Sony camera models. Such as Alpha 1, Alpha 9 series, Alpha 7S III, Alpha 7R IV, and more, marking a significant enhancement in the software's compatibility with Sony equipment.SUPPORTED LENS PROFILESLightroom Classic Latest Version also introduces new lens profiles, facilitating automatic correction of common lens aberrations like geometric distortion and vignetting. These profiles are included with Adobe Photoshop, Lightroom, and the Camera Raw plug-in, aligning with the updates in the Lightroom Classic latest version.covering a wide array of lenses From manufacturers such as Hasselblad, Leica, SIGMA, and Xiaomi. Adding these profiles in the May 2024 update (ACR version 16.3) further exemplifies Adobe's dedication to providing photographers with the tools they need to achieve high-quality image correction and enhancement.This table represents a snapshot of the latest lens profiles added, underlining the continuous effort to support a growing list of lenses and camera equipment. It's important to note that some lens correction profiles are available for raw formats only and not for JPEGs, PNGs, or TIFFs, emphasizing the focus on high-quality raw image processing.Lightroom Classic Latest Version tethering functionality and lens profile support, key features in its various Lightroom versions, are integral components of its comprehensive RAW processing and photo management capabilities. By facilitating direct access to many of the camera's settings from the computer, along with instant viewing, zooming, rating, and and lens profile support, key features in its various Lightroom versions, are integral components of its comprehensive RAW processing and photo management capabilities. By facilitating direct access to many of the camera's settings from the computer, along with instant viewing, zooming, rating, and tagging of shots, Lightroom Classic enhances the photography workflow, making it more efficient and productive. For the most up-to-date information regarding camera and lens compatibility, photographers are encouraged to refer to the manufacturer's website or Adobe's published list of Lightroom Tethering Support.AI-BASED DEPTH BLURLightroom Classic Latest Version introduces an innovative feature known as AI-based Depth Blur, which significantly enhances the depth of field in digital photographs using artificial intelligence. This feature, a highlight of the latest Lightroom version, mimics the optical blur effects that photographers achieve with different aperture settings on their cameras, offering a range of creative possibilities without needing to reshoot or adjust hardware settings.WHAT IS DEPTH BLUR?Depth Blur in Adobe Lightroom Classic applies a depth-based blur effect akin to the blur produced by real-world optical lenses. It utilises AI-generated or device-captured depth data to simulate the effect, automatically prioritising focus on the detected subject while allowing for interactive focus distance adjustments. Users can customise the bokeh shapes, highlight boosts, and make depth map refinements, providing a comprehensive toolset for achieving the desired aesthetic in their images.STEPS TO APPLY DEPTH BLUR 1. Activating Lens Blur To use the Lens Blur feature, users click beside the word 'Apply' in Lightroom Classic. The software then employs its AI engine to identify the photo's subject and apply a suitable background blur. 2. Adjusting Blur Strength The blur amount slider allows users to control the intensity of the blur effect. Adjusting this slider helps achieve a more realistic look, with recommendations to avoid setting it too high to prevent the image from appearing artificial. 3. Visualizing Depth and Focal Range: users can view a depth map of focus areas in cool and warm tones by selecting the Visualize Depth checkbox. This feature aids in understanding the spatial relationship of objects in the photo and adjusting the focal range accordingly. 4. Refining Focus and Blur Areas: The Brush Refinement tool The Depth Blur feature enables precise adjustments within the image. Users can select Focus to specify areas to remain sharp or Blur to indicate areas to soften. The Amount, Size, Feather, and Flow sliders offer further control over the effect's intensity and spread. 5. Utilising Presets and Depth Data For images with existing depth data, such as those in .HEIC format, Lens Blur supports seamless integration, streamlining the process.Device Depth Additionally, Blur Background Adaptive Presets automatically identify the subject and scan the scene to apply the blur effect intelligently.This table outlines the key steps and features in applying Depth Blur in Adobe Lightroom Classic, showcasing the blend of AI technology with traditional photography techniques to enhance the creative process.POINT COLOUR EDITINGUSING THE EYEDROPPER TOOLLightroom Classic Latest Version Point Colour feature introduces a transformative approach to colour editing, allowing photographers to manipulate specific col f AI technology with traditional photography techniques to enhance the creative process.POINT COLOUR EDITINGUSING THE EYEDROPPER TOOLLightroom Classic Latest Version Point Colour feature introduces a transformative approach to colour editing, allowing photographers to manipulate specific colours within their images with precision. To begin, users can utilise the Eyedropper tool to select the exact colour they wish to adjust. This selection is made easy by creating a mask over the desired area, after which the Eyedropper tool is used within the mask to pick the target colour.Once a colour is selected, the right-hand panel provides sliders for adjusting Hue, Saturation, and Luminance. This enables photographers to enhance or modify the colour to their liking, whether it’s making greens more vibrant or adjusting skin tones to appear more natural. The flexibility of this tool extends to adjusting colors in layers, allowing for multiple adjustments on the same selection without affecting the overall image.FINE-TUNING COLORSAfter selecting the color with the Eyedropper tool, photographers have the ability to fine-tune their colors using the provided sliders. For instance, if the initial selection captures areas of similar brightness, the mask can be adjusted to refine the area of effect. This is done by manipulating the feather, size, and light within the selection, ensuring that the adjustments are precise and only affect the intended areas.Furthermore, for images requiring adjustments beyond basic colour changes Additionally, the HSL Panel offers advanced options. Here, users can individually adjust the Hue, Saturation, and Luminance of specific colour ranges. This is particularly useful when needing to tone down overly vivid colours or when aiming for a specific mood by altering the visual temperature of the scene.This structured approach to color editing not only enhances the workflow but also empowers photographers to achieve their creative vision with high precision and flexibility.ENHANCED PERFORMANCELightroom Classic Latest Version updates have significantly enhanced overall performance, particularly in image conversion and metadata handling. These improvements ensure a more efficient workflow for photographers, allowing them to manage and edit their images with greater speed and less friction, showcasing the improved Lightroom performance in the Lightroom Classic latest version.FASTER IMAGE CONVERSIONLightroom Classic Latest Version has incorporated several features under its Enhance module to boost image quality during conversion. The Denoise function uses artificial intelligence to reduce image noise without compromising fine details, essential for maintaining image clarity. The Raw Details feature, previously known as Enhance Details, is designed to produce crisp detail and improved colour rendering, significantly benefiting large print outputs. Additionally, the Super Resolution tool doubles the linear resolution and increases the width and height of images by 2x, which is particularly useful for enhancing the resolution of cropped images.These features leverage the GPU intensively and can also utilise an external GPU to improve performance further, ensuring that photographers can process high-quality images swiftly. With the integration of Apple Neural Engine in the latest updates, Adobe Lightroom Classic continues to push the boundaries of image processing technology. AI Denoise has been optimis",
      "wordCount": 2164,
      "timeRequired": "PT11M",
      "readingTime": "PT11M",
      "genre": "Photography Guide",
      "articleSection": "Photography Tips",
      "keywords": [
        "Lightroom",
        "Classic",
        "Latest",
        "Photography"
      ],
      "learningResourceType": "Article",
      "educationalLevel": "Advanced",
      "proficiencyLevel": "Advanced",
      "typicalAgeRange": "18-99",
      "educationalUse": "Learning",
      "estimatedCost": {
        "@type": "MonetaryAmount",
        "currency": "GBP",
        "value": "0"
      },
      "audience": {
        "@type": "EducationalAudience",
        "educationalRole": "Photographer",
        "audienceType": "Student"
      },
      "educationalAlignment": {
        "@type": "AlignmentObject",
        "alignmentType": "educationalFramework",
        "educationalFramework": "Photography Skills",
        "targetName": "Advanced"
      },
      "about": [
        {
          "@type": "Thing",
          "name": "Aperture (photography)"
        },
        {
          "@type": "Thing",
          "name": "Photographic composition"
        },
        {
          "@type": "Thing",
          "name": "Adobe Lightroom"
        }
      ],
      "mentions": [
        {
          "@type": "Thing",
          "name": "Lightroom"
        }
      ],
      "hasPart": [],
      "image": {
        "@type": "ImageObject",
        "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1716541561477-4IDUA8JMVAP8I1Q05IIZ/lightroom+classic+latest+version.jpg",
        "width": 1500,
        "height": 1000,
        "caption": "Lightroom Classic Latest Version 13.3 - What's New"
      },
      "thumbnailUrl": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1716541561477-4IDUA8JMVAP8I1Q05IIZ/lightroom+classic+latest+version.jpg",
      "primaryImageOfPage": {
        "@id": "https://www.alanranger.com/blog-on-photography/lightroom-classic-latest-version-whats-new#webpage"
      },
      "speakable": {
        "@type": "SpeakableSpecification",
        "xpath": [
          "/html/head/title",
          "//h1"
        ],
        "cssSelector": [
          "h1",
          ".intro"
        ]
      },
      "discussionUrl": "https://www.alanranger.com/blog-on-photography/lightroom-classic-latest-version-whats-new#comments",
      "author": {
        "@type": "Person",
        "@id": "https://www.alanranger.com/#alanranger",
        "name": "Alan Ranger",
        "url": "https://www.alanranger.com/about-alan-ranger",
        "jobTitle": "Photographer & Photography Educator",
        "sameAs": [
          "https://www.alanranger.com",
          "https://www.linkedin.com/in/alanrangerphotography"
        ]
      },
      "publisher": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography",
        "url": "https://www.alanranger.com",
        "logo": {
          "@type": "ImageObject",
          "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/b859ad2b-1442-4595-b9a4-410c32299bf8/ALAN+RANGER+photography+LOGO+BLACK.+switched+small.png?format=1500w",
          "width": 300,
          "height": 100
        }
      },
      "isPartOf": {
        "@type": "WebSite",
        "@id": "https://www.alanranger.com/#website"
      },
      "copyrightHolder": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography"
      },
      "copyrightYear": 2024,
      "sameAs": [
        "https://www.alanranger.com/blog-on-photography"
      ],
      "relatedLink": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "subjectOf": {
        "@type": "Blog",
        "@id": "https://www.alanranger.com/blog-on-photography#blog"
      },
      "isRelatedTo": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "funding": {
        "@type": "MonetaryGrant",
        "funder": {
          "@type": "Organization",
          "name": "Alan Ranger Photography"
        }
      },
      "interactionStatistic": {
        "@type": "InteractionCounter",
        "interactionType": "https://schema.org/CommentAction",
        "userInteractionCount": 0
      },
      "commentCount": 0
    }
  ]
}