{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/movement-and-intentional-blur-photography-assignment#blogposting",
  "headline": "Movement and Intentional Blur Photography Assignment",
  "alternativeHeadline": "Movement and Intentional Blur Photography Assignment | Alan Ranger Photography",
  "description": "Learning Objectives • Understand the principles of movement and intentional blur in photography.",
  "url": "https://www.alanranger.com/blog-on-photography/movement-and-intentional-blur-photography-assignment",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Learning Objectives • Understand the principles of movement and intentional blur in photography. • Master the technique of using long exposure to capture dynamic scenes. • Experiment with different methods of camera movement to create artistic effects. Want feedback on your assignment? Join Foundation Plus and get personalised monthly critique plus full access to all assignments. Learn More & Join Download Assignment PDF Before You Shoot • Choose a location with sufficient light and movement, such as a busy street or a flowing river. • Gather necessary equipment including a tripod, ND filters, and a remote shutter release. • Plan the time of day for shooting, ideally during golden hour or twilight for softer light. • Familiarize yourself with your camera settings, especially priority modes. • Set your ISO to a fixed value of 200 to maintain consistency during the shoot. The Assignment Technical Focus • Use shutter priority mode to control shutter speed while allowing ISO and aperture to adjust automatically. • Experiment with different shutter speeds to see how they affect the motion captured in your images. • Ensure the camera is stable on a tripod to prevent unintended camera shake. • Use ND filters to extend exposure times even in bright conditions. • Lock focus on a stationary object to maintain clarity in parts of your frame. Creative Focus • Try intentional camera movement (ICM) techniques by moving the camera in different directions while the shutter is open. • Capture light trails by panning the camera horizontally during exposure. • Experiment with zooming in and out while the shutter is open to create dynamic effects. • Incorporate foreground elements that remain static while capturing motion in the background. • Use the blur to convey a sense of speed or emotion in your photographs. Assignment Tasks • Use shutter priority mode at 1/2s with ISO 200 fixed, allowing the camera to adjust aperture, and capture flowing water to create smooth blur effects. • Set up a scene with moving traffic, use shutter priority mode at 1/30s with ISO 200 fixed, and capture the streaks of light from cars to illustrate motion. • Choose a busy public space and practice ICM by moving the camera vertically while using shutter priority mode at 1/4s with ISO 200 fixed. • Use shutter priority mode at 1/15s with ISO 200 fixed to capture people walking through a park, creating a ghosting effect. • At sunset, set your camera to shutter priority mode at 1s with ISO 200 fixed, and photograph clouds moving across the sky to create dramatic streaks. • Set up your camera on a tripod at a busy intersection, use shutter priority mode at 1/8s with ISO 200 fixed, and pan with a moving subject like a cyclist. 💡 Stretch Tasks • Experiment with shooting multiple long exposures and layering them in post-processing to create complex movement compositions. • Create a time-lapse sequence by combining multiple long exposure shots taken in succession to showcase movement over time. DO / DON'T DO • ✓ Do use ND filters to enable longer exposures in bright conditions. • ✓ Do practice panning techniques to achieve intentional blur with moving subjects. • ✓ Do experiment with different shutter speeds to find the best effect for your scene. • ✓ Do maintain a stable setup with a tripod to ensure clarity in static elements. • ✓ Do review your histogram to ensure proper exposure while using long exposure techniques. DON'T • ✗ Don't hold the camera by hand when using long exposure; always use a tripod. • ✗ Don't forget to lock focus on a stationary element to contrast with motion. • ✗ Don't use automatic mode; always use priority settings to maintain control over exposure. • ✗ Don't rush your shots; take the time to experiment with different movements. • ✗ Don't ignore the effects of light; consider the time of day and weather conditions before shooting. Reflection Questions • How did different shutter speeds affect the perception of movement in your images? • What challenges did you face while attempting intentional camera movement, and how did you overcome them? • In what ways did using ND filters enhance your ability to capture movement? • How do you think the sense of motion in your photos impacts the viewer's emotional response? 📚 Related Reading Before you start, read these related blog posts to deepen your understanding: • → How To Take Long Exposure Photos For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus. Alan Ranger23 November 2025Composition & Creative LinkedIn0 Pinterest0",
  "wordCount": 784,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/movement-and-intentional-blur-photography-assignment#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/movement-and-intentional-blur-photography-assignment#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}