{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/my-rps-distinctions-journey-mike-ford#blogposting",
  "headline": "My LRPS journey – Mike Ford | Client RPS Distinctions",
  "alternativeHeadline": "My LRPS journey – Mike Ford | Client RPS Distinctions | Alan Ranger Photography",
  "description": "My rPS distinctions journey mike ford – Mike Ford I am pleased to be able to share a guest blog from Mike who achieved his Distinction in September 2015.",
  "url": "https://www.alanranger.com/blog-on-photography/my-rps-distinctions-journey-mike-ford",
  "datePublished": "2016-04-29T00:00:00.000Z",
  "dateModified": "2016-04-29T00:00:00.000Z",
  "dateCreated": "2016-04-29T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "My LRPS journey – Mike Ford | Client RPS Distinctions my rPS distinctions journey mike ford – Mike Ford LRPS I am pleased to be able to share a guest blog from Mike who achieved his LRPS Distinction in September 2015. A big congratulations to Mike on this significant milestone and next step on his photographic journey. The RPS - Royal Photographic Society, has three levels of RPS distinctions that they award to successful applicants. Mike was awarded the Licentiateship Distinction enabling him to use the LRPS letters after his name and more importantly proving that he has reached a competent level of camera skill and composition in image making. LRPS (Licentiateship of The RPS) - images of a high standard of photographic execution - demanding but achievable for most dedicated photographers. Applicants must show variety in approach and techniques but not necessarily in subject matter. If you are interested in applying for a RPS Distinctions more information can be found on the RPS website here: https://www.rps.org/distinctions I am already supporting and coaching a number of people towards their distinctions with the RPS so am more than happy to offer the same support to you, just get in touch with me. Guest Blog by Mike Ford - rPS distinctions I've gained so much on my LRPS journey, but my biggest improvement has been learning what to do to improve my shots, either in Lightroom or in camera. Having been interested in photography for over 30 years, when I moved house 10 years ago, I thought how nice it would be if all the pictures that I hung in the house were of my own shots. First steps - rPS distinctions My story really begins there. I’d become aware of the RPS distinctions advisory days, where you get your portfolio critiqued. You have to present 10 pictures in a panel; mine was in 2 rows of 5 pictures per row. I sorted and printed my 10 best images in full glossy colour on my normal printer. The pictures have to be mounted - another new experience! What a day! Watching everyone else’s panels being critiqued was a lesson in itself. It was amazing to watch how a panel could be made more aesthetically pleasing and balanced simply by changing the position of the pictures. I’d never heard of blown highlights even though I had some good examples in my portfolio! The assessor explained, “There is no detail there, there’s nothing but the printer paper”. The smallest imperfections were spotted. The panel images needed to be technically perfect! I had a lot to learn. Only 3 of my 10 shots were good enough to survive that first mauling. The comment on the Dangerous Waves picture was the highlight of the day, “I wish I had taken that one”. While I still had lots to learn and do I was enthused and had learnt an enormous amount in that one day. Dangerous Waves My new challenge became not just taking a good picture but also how to process the image for printing. I noticed that whatever I did my images never looked as sharp or with the same clarity you see in magazines. I knew I was missing something but didn't know what. The right help I met Alan Ranger at the Photography Show at the NEC in March 2014. He understood straight away what I was looking for and I liked his style. I booked 2 half day sessions and used one of those to learn Lightroom. I learnt more in that half day session than in the last six months of playing with the sliders. Suddenly my processed images looked different, much more alive and fresh than ever before. Coupled with a better printer and good quality paper I could start to see the difference in my printed work. I joined Alan’s monthly mentoring program which has been real hard work but well worth the effort. I’m now in my second year of it. Alan’s feedback on my monthly submissions has been instrumental at making me take a harder look at my images. The feedback is excellent, sometimes brutally honest but very targeted at what you need to do to improve. It can be hard to take sometimes but when you stop and think about the feedback you realise it makes sense. The mentoring programme under Alan’s tuition has been the biggest contributor to improving my images; from showing me how to process the image correctly, pulling the detail out of the shadows and generally really getting to grips with how to use Lightroom to get the best out of my images. I was really focused on getting good images for my portfolio., The challenge is that as the portfolio develops the images needed to fill the gaps become more defined. Just one more good image isn’t always good enough as it has to balance in the panel in terms of subject, colour etc. From the feedback on the mentoring program I learned how to better critique my own pictures and some of my personal favourites were rejected due to slight imperfections. I had become much more critical and my attention to detail had changed significantly. My panel was now fastened to the wall in my study so I could see it develop and it was a constant reminder of what images I needed to take to finish it off. From that initial advisory day only two of my original panel survived all the way through to the final submission - Girl Street Portrait and Dangerous Waves. My final RPS distinctions panel So let me talk about my final panel, it consists of two rows of 5 images. You can see the symmetry in the panel with 4 mono images in portrait format in the 4 corners. All these four had to be processed so that they all had the same tonal range so they looked consistent and to show that I know how to process mono images. The girl on the top left is looking into the panel and the guys on the top right are generally looking inwards to the panel. This looks more balanced than if they had been facing the other way and looking out of the panel. The wooden pier also bends into the panel rather than out of it. View fullsize Mike Ford - Final L Panel The two striking images are the Dangerous Waves and the Playing Cards, these are in a central position as it would have been difficult to find another image to balance them out if they had been in any other place in the panel. On the top row the Playing Cards image is flanked by two wildlife images, both looking into the panel. On the bottom row the Dangerous Waves in flanked by 2 landscape images to balance and compliment the top row. The two central images complement each other as they both show movement. To prepare for the big day I reviewed all the images again and ensured they were all processed correctly, sometimes going over the same image time and time again until it looked right. I ensured there were no dust spots, blown highlights, dark shadows etc. before printing them all again onto the same paper type so they looked consistent. They were then mounted on off white mounts ready for showing. Judgement Day On the day itself there were 5 judges, and in a dimmed room the pictures are illuminated and are reviewed from about 2 metres away, they then get up and study the images very closely. They take images down and scrutinise them in great detail. There are 5 characteristics that they are looking for and then each judge scores the panel independently before passing the score sheets to the chairperson to tally the scores. The panel has to pass all 5 characteristics to be successful. The five characteristics are Presentation, Technical Camera, Technical Technique, Visual Technique and Communication. Once the scores have been tallied up the Chairperson gets up and announces the result. The Chairperson then asked one of the judges to talk for 5 minutes about my panel. He commented about the amount of photographer input into several of the images showing that I had made a conscious decision on how to influence the final image. The future Joining a mentoring programme like Alan’s is a great way to get the very best out of your images, to challenge you, and to show you how to improve. My time with Alan has helped me to look at my images with a fresh pair of eyes and be much more objective in my approach and due to Alan’s feedback my attention to detail has risen dramatically. So what’s next? I’ll be continuing to improve using Alan’s mentoring program, moving up to the personalised programme. I've already started to think about going to the next level of ARPS where you need 15 pictures but this time linked together in a theme. I am extremely pleased with my achievement to date, but I also realise that I can still develop and improve… . The journey continues! Mikes rPS distinctions L Panel Images: Click on image to see it full size. student-photosAlan Ranger29 April 2016alan ranger photographycase-studies, rps-panel, rps distinctions LinkedIn0 Pinterest0",
  "wordCount": 1547,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/my-rps-distinctions-journey-mike-ford#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/my-rps-distinctions-journey-mike-ford#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "Associate of the Royal Photographic Society (ARPS)"
    },
    {
      "@type": "Thing",
      "name": "RPS Distinctions"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "ARPS"
    },
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}