{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/new-partnership-with-one-vision-imaging#blogposting",
  "headline": "Partnership with One Vision Imaging - 12% off All Products",
  "alternativeHeadline": "Partnership with One Vision Imaging - 12% off All Products | Alan Ranger Photography",
  "description": "One Vision Imaging Ltd I am delighted to announce that I have agreed on an extended partnership with One Vision Imaging Ltd.",
  "url": "https://www.alanranger.com/blog-on-photography/new-partnership-with-one-vision-imaging",
  "datePublished": "2019-08-28T00:00:00.000Z",
  "dateModified": "2019-08-28T00:00:00.000Z",
  "dateCreated": "2019-08-28T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Partnership with One Vision Imaging - 12% off All Products One Vision Imaging Ltd I am delighted to announce that I have agreed on an extended partnership with One Vision Imaging Ltd. One Vision Imaging are a professional print lab that I have used for many years for all my prints. 12% off for Alan Ranger Photography Clients One Vision Imaging provides a full and professional print service that is unrivalled in range of products, quality of print and professional service. They are based in my home town of Coventry but have a great online portal for clients to upload images remotely and order their prints, with overmount or frames or whatever product you would like your photographs printed on. As a preferred partner, I am delighted to be able to share an ongoing offer with you for a 12% discount on any order you place with One Vision Imaging. To take advantage of this ongoing discount offer you need to register your account or create one on the One Vision website and then follow these steps. The 12% Discount will be applied automatically to your account for all orders placed through the website portal. To take advantage of this offer, follow these steps: • Register your Free Account at One Vision Imaging - https://www.onevisionimaging.com/account/register, if you already have an account, go to step 2 Contact Adam Edwards at One Vision Imaging via email to confirm you are an Alan Ranger client. adam.edwards@onevisionimaging.com Adam will check with me that you are a client. Adam will add an automatic discount of 12% to your one vision imaging account for all future orders placed through the account. That’s it, simple! photography-offers, photography-tips, recommended-productsAlan Ranger28 August 2019Alan Ranger Photographyprinting, one-vision LinkedIn0 Pinterest0",
  "wordCount": 289,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/new-partnership-with-one-vision-imaging#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/new-partnership-with-one-vision-imaging#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Photography"
    }
  ]
}