{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/patterns-rhythm-and-repetition-photography-assignment#blogposting",
  "headline": "Patterns Rhythm and Repetition Photography Assignment",
  "alternativeHeadline": "Patterns Rhythm and Repetition Photography Assignment | Alan Ranger Photography",
  "description": "Learning Objectives • Identify patterns and rhythms in everyday environments.",
  "url": "https://www.alanranger.com/blog-on-photography/patterns-rhythm-and-repetition-photography-assignment",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Learning Objectives • Identify patterns and rhythms in everyday environments. • Utilize repetition to create compelling compositions. • Apply specific camera settings to enhance the visual impact of patterns and repetition. Want feedback on your assignment? Join Foundation Plus and get personalised monthly critique plus full access to all assignments. Learn More & Join Download Assignment PDF Before You Shoot • Scout locations where patterns and repetitions are likely to be found, such as architecture, nature, or urban settings. • Consider the time of day for optimal lighting conditions that enhance texture and contrast. • Prepare your camera and lenses, ensuring they are clean and in good working condition. • Familiarize yourself with your camera settings, especially those related to exposure and focus. • Carry a notebook to jot down ideas and potential compositions during your shoot. The Assignment Technical Focus • Shoot at f/8, 1/250s, ISO 200 in manual mode to achieve a deep depth of field, allowing multiple layers of patterns to be in focus. • Use a shutter speed of 1/500s, ISO 400, and f/5.6 in aperture priority mode to freeze motion in dynamic patterns, like moving crowds or flowing water. • Set your camera to shoot in RAW format to retain maximum detail for post-processing. • Adjust the white balance to match the lighting conditions, ensuring colors are accurately represented in your patterns. • Use spot metering to focus on a specific area of your composition, ensuring the patterns are well-exposed. Creative Focus • Look for leading lines that guide the viewer's eye through the patterns in your composition. • Experiment with different angles and perspectives to find unique ways to showcase repetition. • Incorporate negative space to emphasize the patterns and create a sense of balance. • Use framing techniques to isolate patterns, drawing attention to the repetition in the scene. • Play with color contrast to enhance the visual rhythm in your photographs. Assignment Tasks • Capture a series of three images focusing on architectural patterns, shooting at f/8, 1/125s, ISO 100 in aperture priority mode. • Photograph a natural scene that exhibits rhythm, using f/4, 1/60s, ISO 200 in manual mode to blur the background and highlight the subject. • Create a diptych of two images showcasing repetition in urban settings, using f/5.6, 1/250s, ISO 400 in shutter priority mode. • Document a sequence of images that illustrate movement and rhythm, shooting at f/2.8, 1/500s, ISO 800 in aperture priority mode. • Capture close-up details of repetitive textures found in nature, using f/16, 1/125s, ISO 100 in manual mode. • Create a photo essay on a theme centered around patterns in daily life, using f/5.6, 1/200s, ISO 400 in manual mode. 💡 Stretch Tasks • Develop a series of abstract images focusing solely on color patterns and textures, using f/4, 1/60s, ISO 200 in aperture priority mode. • Create a time-lapse video that captures patterns and rhythms in nature over a period, using appropriate settings for exposure and interval. DO / DON'T DO • ✓ Do experiment with different lenses to capture patterns from various perspectives. • ✓ Do pay attention to lighting and shadows as they can enhance patterns and textures. • ✓ Do use a tripod for stability when shooting in low light or with slower shutter speeds. • ✓ Do review your images on-site to ensure you are capturing the intended patterns and compositions. • ✓ Do engage with your environment and observe how patterns change with different angles. DON'T • ✗ Don't rely solely on automatic settings; take control of your exposure to enhance patterns. • ✗ Don't ignore the background; ensure it complements the patterns you are capturing. • ✗ Don't be afraid to move around and change your position to find the best composition. • ✗ Don't rush your shots; take time to observe and frame your patterns carefully. • ✗ Don't overlook the potential of post-processing to accentuate patterns and repetition. Reflection Questions • What patterns did you find most compelling during your shoot? • How did different camera settings affect the way patterns were captured? • In what ways did you experiment with composition to enhance rhythm and repetition? • What challenges did you face while trying to capture patterns, and how did you overcome them? 📚 Related Reading Before you start, read these related blog posts to deepen your understanding: • → What Is Contrast In Photography • → Mastering Abstract Photography For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus. Alan Ranger23 November 2025Composition & Creative LinkedIn0 Pinterest0",
  "wordCount": 782,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/patterns-rhythm-and-repetition-photography-assignment#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/patterns-rhythm-and-repetition-photography-assignment#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}