{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/peter-orton-rps-distinctions#blogposting",
  "headline": "Case Study - Peter Orton - ARPS | RPS Distinctions Panel",
  "alternativeHeadline": "Case Study - Peter Orton - ARPS | RPS Distinctions Panel | Alan Ranger Photography",
  "description": "View fullsize Peter Orton Hanging Plan RPS Distinctions Peter first came to me in May 2024, fresh from an unsuccessful attempt at his distinction.",
  "url": "https://www.alanranger.com/blog-on-photography/peter-orton-rps-distinctions",
  "datePublished": "2025-10-14T00:00:00.000Z",
  "dateModified": "2025-10-14T00:00:00.000Z",
  "dateCreated": "2025-10-14T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Case Study - Peter Orton - ARPS | RPS Distinctions Panel View fullsize Peter Orton ARPS Hanging Plan RPS Distinctions Peter first came to me in May 2024, fresh from an unsuccessful attempt at his ARPS distinction. His panel showed plenty of promise — the overall theme, a key requirement for the Associate level, was solid — but the presentation and consistency in colour and tonal balance were letting it down. We decided to go full “root and branch” and rebuild from the ground up. That meant auditing every image, re-editing from scratch, and developing a completely new body of work. Peter worked tirelessly through the process and, to his credit, took my no-nonsense rejections and critiques squarely on the chin. Along the way, we spent time out in the field for some practical tuition, where I was able to help refine his approach to composition and camera technique — the kind of small but crucial details that make all the difference when the judges’ loupe is out. After several months of re-edits, refinements, and rearranging his panel layout, Peter was finally ready to print. One Vision Imaging, as ever, were superb — offering great support on paper choice and print handling. I’m delighted to say Peter passed his ARPS distinction and joins the growing list of photographers I’ve mentored to RPS success — 18 and counting (4 Associates and 14 Licentiates). His patience, persistence, and good humour — especially during our Lightroom “debates” — made the process a pleasure from start to finish. Well done, mate — now, let’s get cracking on that Fellowship! Statement of IntentThis series of images are presented, with a fine art perspective, depicting coastal subjects, piers and boats, both on the coast and in estuaries. The photographic typology is of functional structures on the pathway towards dereliction and abandonment. The intent originated from noticing the effort of mankind to create and to maintain these structures, together with the destructive power of nature. The groynes continue to be overtaken by nature and are no longer effective in reducing coastal erosion. The piers have been created by mankind to use the sea, in a bygone era, and are now no longer functional. The coastal flood defences have been breached, resulting in inland flooding and the death of trees. This process has been occurring for several hundred years, is present now and ongoing, in the sea, estuaries and rivers. All have become overwhelmed, becoming abandoned and derelict, and are now a hazard to mankind. (Word count: 150) Interview with Peter Orton — ARPS Distinction Success Story Distinction Achieved: ARPSMentor: Alan RangerInterview Date: 14 October 2025 Why did you want to gain a distinction with the Royal Photographic Society (RPS)? To achieve a measurable and recognised photographic standard. Why did you choose Alan to mentor you for a distinction, and had you worked with him before? After failing my first ARPS attempt, I searched online for a tutor experienced with the RPS assessment process.Alan stood out as professional, knowledgeable, and clearly experienced.It was my first time working with him. Describe how you found the RPS Mentoring Classes Excellent. We achieved a lot in each session, and the flexibility really helped.Alan’s manner is calm and professional — his patience and ability to bring you along creatively were first-class.I had to do the work, but Alan guided me every step of the way. Do you feel you got the right level of support from the sessions? Yes, very much so. Did you feel you were already good enough to gain a distinction before starting the mentoring course? I felt I had the potential, but my previous RPS assessment was effectively set up to fail.The RPS process itself could use improvement — they offer pre-assessments, but there’s no real student support, plan, or follow-up after failure.Alan began by assessing my previous work, then we spent time on practical shoots with a structured plan.His feedback was clear and direct — I appreciated his black-and-white approach, which left no doubt about what was needed. What distinction did you apply for, and were you successful? I applied for the ARPS — and I passed.I received detailed notes from the panel assessment I attended. What was your experience like on the RPS Assessment Day? The day was well organised and very professional.Candidates are anonymous and only identified if successful.The judges’ opinions were excellent — well-considered, consistent, and fair, with both overall and detailed feedback. Did you seek independent feedback before your final panel assessment? Yes — I had two pre-assessments with the RPS and feedback from my earlier failure.I also sought opinions from other professional photographers, but the feedback varied widely. What advice would you share with others pursuing an RPS distinction? Keep going, even after setbacks.Find a tutor who can support and challenge you, and take their advice seriously.The ARPS standard is high, but the process will elevate your photography in every way — it truly combines art, craft, and science. What was the hardest part of gaining your distinction — and why? Persevering through setbacks and maintaining motivation.The RPS could improve communication and post-assessment support.The standards need to be clearer and applied more consistently — during my journey I dealt with nine different examiners, and the variation was noticeable.I believe the RPS should also evaluate its own examiners for validity and reliability. Has working towards a distinction helped you progress as a photographer? Absolutely. It’s taken my photography to a whole new level.The process of external assessment provides not just recognition, but a framework for reflection and growth.Building a cohesive panel forces you to think proactively about your subjects and your own creative direction. Any other comments you’d like to add? I’ve now started working towards the FRPS and developing new ideas.As of April 2024, there were around 3,000 photographers with LRPS, 2,000 with ARPS, and only 650 with FRPS — so it’s an inspiring challenge ahead. Click on images to see full screen If you are interested in attaining an RPS distinction I can support you with my RPS Courses for distinctions RPS Mentoring Course Summary- Produce a panel of images for an RPS Distinctions Qualification • Zoom - Online • Evening Class - 19:00 - 21:00. Six classes, you choose dates, within a twelve-month period to suit • From £395 Or also available as a series of 1hr 1-2-1 Zoom Sessions Having supported many clients through a journey of development and improvement, with their photography, over the past few years, this mentoring course is for those who are already technically competent (or at least are on the path to mastering it) and are able to demonstrate good design and composition in their photography. You are not expected to be a master or even polished to attend. This RPS Distinctions course is to help support you in improving in all three areas of image production: • Technical - The mechanics of it Creativity - The reason for it Output - The editing and publication of it You will be expected to understand and demonstrate or be willing to learn; Good exposure of photographs Good compositional awareness A range of techniques and styles (L) or specific themed body of work (A) Ability to edit images to a \"reasonable\" standard. Over the course of 12 months, where you will attend six RPS Distinctions classes at intervals suited to you, there will be professional input, feedback and support to help you progress towards either the A or L distinction with the RPS Successful Client Panels Photography Tuition comes in all shapes and sizes - you may be one of those who prefers practical or theory - you may be someone who can't attend classes in the Midlands or in the evenings. You may live abroad or just have limited time or money. Whatever your constraints remember that I can provide a varied package of photography tuition to suit anyone's needs and budgets. Learning is so much easier and more fun when done with the support of a professional and the friends you will make whilst doing it. Please contact me for a free no obligation chat about taking your next step in improving. 0781 701 7994 or email info@alanranger.com photography-courses, student-photosAlan Ranger14 October 2025Alan Ranger Photographyrps-panel, rps distinctions LinkedIn0 Pinterest0",
  "wordCount": 1375,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/peter-orton-rps-distinctions#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/peter-orton-rps-distinctions#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "Associate of the Royal Photographic Society (ARPS)"
    },
    {
      "@type": "Thing",
      "name": "RPS Distinctions"
    },
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "ARPS"
    },
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}