{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/photography-basics-creative-photo-projects#blogposting",
  "headline": "Tip of the day- 10 Creative Photo Projects To Do Today",
  "alternativeHeadline": "Tip of the day- 10 Creative Photo Projects To Do Today | Alan Ranger Photography",
  "description": "10 Creative Photo Projects To Do Today I intend to post a new photography tip regularly to my client base on the mailing list.",
  "url": "https://www.alanranger.com/blog-on-photography/photography-basics-creative-photo-projects",
  "datePublished": "2021-03-24T00:00:00.000Z",
  "dateModified": "2021-03-24T00:00:00.000Z",
  "dateCreated": "2021-03-24T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Tip of the day- 10 Creative Photo Projects To Do Today 10 Creative Photo Projects To Do Today I intend to post a new photography tip regularly to my client base on the mailing list. Sign up here if you want to receive these by email Hopefully, with more downtime, you will be able to read and learn photography basics or refresh your understanding. 10 Creative Photography Projects To Do This Weekend I don’t know about you, but being in lock-down, isolation and unable to venture out beyond the perimeter of my property is a sure-fire way to stifle my creativity. I draw my energy and inspiration from being in the landscape and outdoors amongst nature. So, when folks have asked me for ideas about what to photograph during this period, I have found it hard to come up with anything original or inspiring. For those of you who are on my RPS Mentoring Course, now is a good time to create or refine some subjects and techniques that could help your panel. Macro/Close-up, Still life, Portrait, Movement, Abstract or whatever would fit your portfolio and demonstrate different techniques and competence. For the rest of us, trying to find that “thing” that stirs up excitement and motivation is really just down to setting time aside this weekend to have a good go at something. I intend to read at least one of the many books on photography that have sat on the shelf for too long, untouched. I hope that I will find the motivation to pick up the camera and create again. Some Photo Projects Ideas • ABC project There are two ways you can tackle this project. You can either choose a letter to photograph something that starts with that letter. Another photography idea is to photograph something that looks like the letter. This option is fun if you want to create a collage of photos to spell out your last name or a photograph for each letter of the alphabet. • Work through a book There are many books out there that will teach you different skills. You can tackle a new chapter each day. I recommend this Henry Carroll series: Read This If You Want to Take Great Photographs Read This if You Want to Take Great Photographs of Places Read This If You Want to Take Great Photographs of People Photographers on Photography: How the Masters See, Think and Shoot • • Grateful project Photograph objects, people or spaces you are grateful for. Not only will you never run out of ideas of things to photograph but it helps you focus on what is really important and how blessed you are. • Choose a subject Focus on a new subject to try new compositions and break out of your normal photography routine. Subject ideas: – Shoes – Flags – Windows – A colour – Lines – Doors – Chairs • Same view every day Take a photo from a window or identical position every morning, evening or both, everyday to see how it changes in the light, weather and seasons. • A Day in the Life of Take a photo once an hour for the whole day to capture the everyday moments and routines that we often forget to capture. • Make a self-portrait or Shoot a REAL Portrait of a Loved One Probably one of the hardest projects to do and feel happy with it. I am an avid selfie hater, however creating a self-portrait is actually quite challenging. Think about how you can get creative using glass/mirror reflection or other ways to portray yourself or if a loved one take the time to make a professional photo of this person and give it to them. Remember your photographing who someone is not what they look like. • ROYGBIV Photograph a 7 day Rainbow project. This is to take a different colour as the focus point every day for 7 days. Sunday: Red Monday: Orange Tuesday: Yellow Wednesday: Green Thursday Blue Friday: Indigo Saturday: Violet. • Learn and practise a new technique Panning, zoom burst, focus stacking, macro, abstract, selective focus, motion blur, panoramics… the list is endless. Pick a technique that you want to learn and master it with research and lots of practice. • Lock-Down - Look Down It’s easy to fall into the habit of photographing things in front of us but why not try locking down your perspective to only photograph things looking down for a day? I'm just photographing stuff on the ground. You will find interesting subject matter if you look closely enough. Meantime sign up for one of my webinar, online photography class tutorials - Editing with Lightroom and NIK, B&W Conversion, Filters & Bracketing, Composition and more… If you want to support my business and invest something for when we return to normal working ways you can buy yourself a digital gift voucher. You can redeem the voucher at any time against any event or service. You’ll be spending a little bit now for future use and I will have a little bit of cash flowing in, a win-win. Thanks Buy Yourself A Gift Voucher photography-basics, photography-tips, tip-of-the-dayAlan Ranger24 March 2021Alan Ranger Photographytips, tripod, learn-photography LinkedIn0 Pinterest0",
  "wordCount": 871,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/photography-basics-creative-photo-projects#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/photography-basics-creative-photo-projects#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}