{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/photographers-rights-in-the-uk#blogposting",
  "headline": "Photographers Rights in the UK - What are the Facts?",
  "alternativeHeadline": "Photographers Rights in the UK - What are the Facts? | Alan Ranger Photography",
  "description": "Unlocking the Secrets to Photographers Rights in the UK: Your Comprehensive Guide to Legal Protection, Permissions and Creative Freedom! Don't Miss Out.",
  "url": "https://www.alanranger.com/blog-on-photography/photographers-rights-in-the-uk",
  "datePublished": "2019-04-23T00:00:00.000Z",
  "dateModified": "2019-04-23T00:00:00.000Z",
  "dateCreated": "2019-04-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "PHOTOGRAPHERS RIGHTS IN THE UK - WHAT ARE THE FACTS?PHOTOGRAPHERS RIGHTS IN THE UKOne of my students recently got into a sticky situation when out and about shooting environmental portraits - candid shots of people in their environment. This environment was a market and therefore in public view. However one particular member of the public took strong offence to the lens being pointed in their general direction (although as it happens they weren't actually in the shot) Anyway what followed was a rather heated fracas between said member of the public, the photographer and then the Police.photographers rights in the UK/s/photographersrights_UK.pdfClick to download this printable pocket guide on photographers rights in the UKTHIS BLOG POST IS TO TRY AND ANSWER THE MAIN QUESTION OF PHOTOGRAPHERS RIGHTS IN THE UK WHAT CAN THE POLICE DO AND WHAT ARE THE RIGHTS OF THE INDIVIDUAL(S) BEING PHOTOGRAPHED?Its important to state right up front that I am not a qualified legal person and can not be responsible for the legal accuracy of the information provided. I have used reliable sources to check the validity of the current legal position but the information provided is of general nature and not intended for legal advice.It is also very important to respect the liberty and rights of each person and situation and my overriding general advice to photographers is - if you get into a difficult situation then its best to defuse it and unless the shot you have taken is of general nature and not intended for legal advice.It is also very important to respect the liberty and rights of each person and situation and my overriding general advice to photographers is - if you get into a difficult situation then its best to defuse it and unless the shot you have taken is worth arguing over it sometimes better to just delete it and walk away rather then to educate the people involved, this includes police officers, officials and the public.So here are all the basic questions covered but i would also refer to a great article, without prejudice, that a more extensive explanation of what are photographers rights in the UKARTICLE BY LINDA MACPHERSON ON PHOTOGRAPHERS RIGHTS IN THE UKFacts in summaryWhere can I take photographs? * everyone has the right to photograph in a public space * shopping centres are private property and therefore the owners can impose restrictions and bans on taking photographs whilst on their property. * you can however take photos of private property, ie shopping centre, if you are standing on the public highway. The exceptions to these are military institutions and some national/royal spaces. * you can take photographs in public parks but some local authorities can impose restrictions on these too. * be aware that if you are causing an obstruction on the public highway to photograph something this could, unlikely though, to get you into a conversation with the police. Common sense usually prevails, ie don't set your tripod up the public footpath or in the road when its busy and likely to cause an obstruction and generally speaking you will just be asked to move on.Who can i take photographs of? * In UK law there is no specific right to privacy in public places. The European Convention on Human Rights gives a 'right to private and family life' * In UK law you do not have a right to privacy in a public place. * therefore you do not need the permission of someone to take their photograph if you are standing in a public space - however i advise caution here - if the photograph is of a family with said children then be sensitive to this as the law is a little more vague when it comes to infringement of \"reasonable expectation to privacy\" even when in public space. My advice is ask permission. * if you intend to use the photograph for publication, commercial use or stock photography then you need a signed model release. * photographs of people may also be the subject of the data protection act which controls the processing of \"personal data\" that is data relating to an individual from which an individual can be identified - this is again a grey area and whilst there has not been a court case to determine whether a photograph of someone without any identifying information would be caught by this act the advice is to be aware this. * photographing children under the age of 16. Whilst it is not illegal to photograph children in public spaces it will certainly draw the attention of parents, other adults and the police so its advisable to get at least the verbal consent from the parents at least first. Many local authorities and organisations have strict child protection policies in children's sports and other activities and have rules about photography at events so it is worth enquiring about the policy before attempting to take photographs even if you are the parent of the child involved. * you cannot photograph someone (using a long lens for example) from a pub policies in children's sports and other activities and have rules about photography at events so it is worth enquiring about the policy before attempting to take photographs even if you are the parent of the child involved. * you cannot photograph someone (using a long lens for example) from a public space of them in a private place, such as their home, without their consent. This is an invasion of privacy even though the photo is taken from a public place.What are my rights when challenged? * read the list above and know it well enough to be able to talk to the person challenging you - do not argue it as legal authority simple explain you understand your rights to be... * if some one claims being photographed is harassment then point out the following - just because you have photographed someone (in a public space) and they didn't want to be photographed doest make it harassment. Harassment is essentially behaviour that causes another person alarm or distress and it refers to a course (course means at least two occasions) of conduct not a single event. If a photographer stalks a person to get a photograph of them or repeatedly thrusts a camera in their face this might be harassment. * If challenged remain polite and calm. * You are not required to give any personal details unless you are being arrested by the Police. * No one, including the police, have the right to delete your images or force you to delete your images - however sometimes this may be the simplest way to defuse a situation if the photos are not that important to you. * No one has the right to confiscate your camera or equipmentRemember photography is not a crime!In most situations that arise, things can easily be placated with an explanation of what you are doing and what your intended purpose of the photograph is for. If you seek permission first then you are less likely to have issues. Where that isn't feasible or desirable then just be sensitive to individuals and know the facts but remain calm and polite and decide yourself if the image is worth the aggravation of debating things.PLEASE LIKE AND SHARE THIS POST PHOTOGRAPHERS RIGHTS IN THE UK IF YOU FOUND IT USEFUL USING THE SHARE LINK BELOW----------------------------------------MORE FREE PHOTOGRAPHY TIPS/blog-on-photography/photographing-autumn-uk-landscape-photography-guidePhotographing Autumn - UK landscape photography guide Photographing autumn: Experience the colours and stunning UK landscapes of the season. Discover expert tips and techniques for breathtaking autumn photography.Read More → /blog-on-photography/the-way-of-wu-wei-philosophyThe Way of Wu Wei Philosophy - A Personal Reflection “It is actually in not doing that we achieved this wondrous thing, Sire all we did was create the space for the painting to happen itself. Wu Wei PhilosophyRead More → /blog-on-photography/composition-curiousness-part-1Composition Curiousness - Part 1 | Professional Guide Composition Curiousness - Part 1 - Undoubtedly the most common question I am asked as a tutor is the one around composition. How to, what, why, when and so on Read More → Composition Curiousness - Part 1 - Undoubtedly the most common question I am asked as a tutor is the one around composition. How to, what, why, when and so on Read More → /blog-on-photography/composition-curiousness-part-2Composition Curiousness - Part 2 | Professional Guide “There will always be those who look only at technique, who ask ‘how’, while others of a more curious nature will ask ‘why’.Part 2 composition curiousnessRead More → /blog-on-photography/mastering-the-art-of-seasonal-photographyMastering the Art of Seasonal Photography: Nature's Rhythms Mastering the Art of Seasonal Photography: Embracing Nature's Rhythms - Mastering the art of seasonal photography requires more than just technical prowessRead More → /blog-on-photography/what-is-iso-in-photography04 What is ISO in Photography: A Guide for Beginners. What is ISO in photography? Plain-English definition, examples and pro tips. Set ISO for clean results and sharp photos —see when to raise or keep it low....Read More → /blog-on-photography/photo-print-sizes-resize-photosPhoto Print Sizes - Photo Sizing - Print Resolution Guide Free printing guide and calculator for photo print sizes, DPI/PPI and aspect ratios. Check max print size, pixels needed & quality. Download the cheat-sheetRead More → /blog-on-photography/composition-in-photographyComposition in Photography: Why the Camera Isn’t the Artist Master composition in photography with five expert tips. The Camera Isn’t the Artist – You Are. Learn to see, balance, tell stories and create with intentionRead More → photography-tips Alan Ranger 23 April 2019photographers-rights LinkedIn0 Pinterest0 3A+Your+Comprehensive+Guide+to+Legal+...&media=https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1577614742242-ZCBSFQJKN3EO24ZYOINO/_-26.jpg&url=https%3A%2F%2Fwww.alanranger.com%2Fblog-on-photography%2Fphotographers-rights-in-the-uk]",
  "wordCount": 1572,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/photographers-rights-in-the-uk#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/photographers-rights-in-the-uk#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}