{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/photography-basics-creative-editing#blogposting",
  "headline": "Tip of the day - photography basics - Creative Editing",
  "alternativeHeadline": "Tip of the day - photography basics - Creative Editing | Alan Ranger Photography",
  "description": "Creative Editing | How-To Guide - Ten Professional Tips to Enhance Your Photography Creative Editing Skills - For Beginner and Intermediate Photographers.",
  "url": "https://www.alanranger.com/blog-on-photography/photography-basics-creative-editing",
  "datePublished": "2021-02-06T00:00:00.000Z",
  "dateModified": "2021-02-06T00:00:00.000Z",
  "dateCreated": "2021-02-06T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "TIP OF THE DAY - PHOTOGRAPHY BASICS - CREATIVE EDITINGPHOTOGRAPHY BASICS - CREATIVE EDITING – TEN LESSONS10 WAYS TO IMPROVE THE FINAL IMAGE - PHOTOGRAPHY BASICS 1. THE MORE YOU GET RIGHT IN THE CAMERA THE LESS TIME YOU SPEND EDITING 2. EVERY CORRECTION FOR SLOPPY CAMERA WORK DEGRADES THE QUALITY OF THE IMAGE 3. THE CAMERA CAN ONLY TAKE THE IMAGE SO FAR SO RECOGNISE THE POTENTIAL OF AN IMAGE WITH EDITING 4. STICK TO YOUR INTENTION FOR THE IMAGE WHEN EDITING – IF YOU DON’T KNOW, DON’T EDIT 5. TAME YOUR ADJUSTMENTS SO THEY STAY BALANCED AND REPRESENTATIVE OF WHAT YOU WANT TO SHOW 6. NEVER EDIT OR STYLE AN IMAGE ACCORDING TO WHAT’S POPULAR OR SEEMS TO FIT THE TRENDS 7. BE TRUE TO YOURSELF AND THE IMAGE – NO ONE ELSE SHOULD JUDGE YOUR WORK MORE THAN YOU 8. USE THE BEST TOOL FOR THE JOB, DON’T GET ATTACHED TO ONE METHOD OR TOOLSET 9. TAKE TIME TO EDIT REGULARLY AND THOROUGHLY SO YOU BECOME PROFICIENT AND EFFICIENT AT IT 10. BE PREPARED TO LIVE WITH A VERSION FOR SOME TIME AND IF NEEDS BE, RE-WORK IT AGAIN.----------------------------------------If you want to support my business and invest something for when we return to normal working ways you can buy yourself a digital gift voucher. You can redeem the voucher at any time against any event or service. You’ll be spending a little bit now for future use and I will have a little bit of cash flowing in, a win-win. ThanksBuy yourself a gift voucher - ng ways you can buy yourself a digital gift voucher. You can redeem the voucher at any time against any event or service. You’ll be spending a little bit now for future use and I will have a little bit of cash flowing in, a win-win. ThanksBuy yourself a gift voucher ----------------------------------------photography-basics , photography-tips , tip-of-the-day Alan Ranger 6 February 2021tips , learn-photography LinkedIn0 Pinterest0",
  "wordCount": 324,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/photography-basics-creative-editing#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/photography-basics-creative-editing#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Photography"
    }
  ]
}