{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/photography-lessons-for-beginners#blogposting",
  "headline": "Photography Lessons for beginners to learn and practice",
  "alternativeHeadline": "Photography Lessons for beginners to learn and practice | Alan Ranger Photography",
  "description": "Before you can run” to explain this evolutionary process.",
  "url": "https://www.alanranger.com/blog-on-photography/photography-lessons-for-beginners",
  "datePublished": "2022-07-20T00:00:00.000Z",
  "dateModified": "2022-07-20T00:00:00.000Z",
  "dateCreated": "2022-07-20T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "before you can run” to explain this evolutionary process. Only by building on existing knowledge and experience is it possible, in my opinion, to practice the latter. The second post will attempt to deal with being the servant to dissatisfaction, that we are wired to feel as human beings, and how your approach (mindfulness) to photography can make you the master of satisfaction and allow the creativity to blossom. I don’t want to falsely promise that doing these things will make you a professional photographer or mean that you are “successful”, if you measure success in likes, awards, sales or some other form of accolades, but measure it in personal advancement and honest self assessment of the achievements and progress you have made in learning the fundamentals. I recently blogged about How to Learn Photography and why I believe that your attitude to photography counts for more than your innate capability. This post is focused very much on improving your capability and the next post your attitude towards your photography. Combined your overall performance (performance = satisfaction) should improve. Please note, this is not intended to be a ten or five step guide to learning about shutter speeds, aperture and ISO, or telling you that all you need to do is attend a photography course, or photography workshop. This post is about how you might tap into a range of resources and exercises to maximise your efforts, to produce outputs that you feel are better over time.These are things that I did over fifteen years to try and improve my capability, and how I created images and enjoyed photography more. Set yourself some targets: Photography lessons for beginners Targets sounds very corporate but they don’t have to be! The idea of setting goals in life is, simply, to give you a target to aim for. You may full short or exceed the target but nonetheless it, at least, provides a benchmark and motivation for you to measure against and strive to meet. In photography terms, it maybe means one single thing or a number of things; • To become less confused, and more proficient about basic camera settings and how, why and when to use those settings to capture the photo you want. To improve your understanding of photographic composition, so that you frame shots that show a greater intention and skill of connecting to your subject. To travel and record images of the places and experiences you have with a better result than just a snap or disappointing photo that doesn’t justify what you saw and felt. To receive recognition in camera club or other competitions for single images. To achieve a recognised standard through a professional or amateur body with a photography accreditation or qualification. To create a body of work, portfolio or develop a style of photography that expresses the way you interpret your subjects and use photography to tell a story. The list goes on, and there are no right or wrong answers to this question and ambition. What is important, in my view, is that you have some goals. The goals may change throughout the year(s) and adapt, but having a clear vision of want you want to achieve in any given time period, will help you focus, be motivated and measure your progress. Research, Review and Revisit: Photography lessons for beginners Researching a locations terrain and access, reviewing your images, and from others, for a location, and revisiting a location multiple times, are sure ways to improve your chance of getting better shots and a variety of shots in different light and conditions. As an outdoor photography workshop host, this is default practise and every workshop location is thoroughly researched beforehand. Of course, this is one of the main advantages of going on an organised workshop to a location. You spend less time working out the logistics and burning energy on finding the right areas and more time enjoying and learning photography. Make photography a habit: Photography lessons for beginners If you signed up for a gym membership, but didn’t go, you wouldn’t expect to get fitter. In fact, the only pounds you would lose would be from your bank account rather than waistline. Photography is no different, you have to put in the effort on a frequent basis to exercise the muscle. Set aside time, even if just an hour, on a weekly basis to do photography. Doing photography doesn’t have to involve going out with the camera. It can be taking photos indoors, editing photos, reading articles or a book, “reading” (to read a photo we decode the photograph, unpacking the photographer's interpretation rather than accepting the photograph as it …) and learn from it. Anything that helps build your understanding and increases your capability will help to pay dividends further down the line. If you have a friend who also enjoys photography, why not schedule something on a regular basis together? Learn how to post process with skill and sensitivity: Photography lessons for beginners This is important. When I started using a digital camera, I naively thought that the end of the photographic process was the click of the shutter and then look at the resulting photo on the memory card on the computer. Sure, I was comfortable with cropping the image if I felt it improved the overall composition and maybe even straightening the odd wonky horizon. But, I didn’t have the understanding or knowledge to do anything further. The thought of using photoshop or similar software was an alien concept to me and one I didn’t feel was an authentic form of photography. It didn’t take long before I realised that every photograph was a lie. Forgetting the fact that shooting in JPG format meant the image was being processed anyway, by the cameras JPG preset settings, the mere fact we turn a three dimensional world into a shrunken two dimensional view and only show a portion of a scene in a rectangular frame clearly is clearly not reality. Pablo Picasso was alleged to have said, when painting a portrait of a man's wife and the husband became increasingly agitated, Picasso enquired why he was so concerned. The husband replied that the painting looked nothing his wife. Picasso replied, “So, tell me, what does your wife look like?” The man took a picture out of his wallet and said “that’s how she looks!” Picasso carefully studied the picture and said, “oh really! Small, isn’t she?” A photograph is constructed by the photographer, aided by additional enhancement in the digital dark room, and reconstructed by the viewer with subjective judgement. Just like cooking a meal, you start with raw ingredients and then combine, flavour add additional herbs and spices and cook it the way it suits your palate. Whether that also agrees with another person's palate should not restrict or constrain the way you want to serve it. Be aware of over-sharpening, bringing out too much detail in areas of the photograph that don’t require detail and trying to achieve the maximum impact through clumsy and an insensitive appreciation of the scene. I witness a lot of photos that scream of too much saturation, too much definition and so on that become a distraction of what the photographer witnessed and experienced. It is akin to pouring half a jar of vindaloo curry powder into one dish when a teaspoon full was more than enough for anyone’s palate. Invest wisely in your craft: Photography lessons for beginners If you read photography magazines, go to a camera club or just look at Youtube and social media photography posts you will find that the majority of conversation and explanation is focused around the gear. Of course the camera, lens and accessories will make a difference to the way you photograph or more importantly how much easier or difficult it is to take pictures. But, that doesn’t necessarily mean that the gear is the master and therefore you become the slave. Or, to put it another way, the gear produces the photograph rather than the photographer. People will naturally be drawn to better lenses, camera bodies and the accessories that are marketed and almost religiously preached as being the answer to the problem that many beginners ask the reason why and how… However, from my own personal experience and that of tutoring literally thousands of beginners the gear is not the shortfall the reason they are not making photographs that satisfy. It may be an “obvious” and an easy conclusion to make that the reason a particular photographer is deemed good is due to the fact that they have x,y,z gear. Trust me, I have met many photographers with all the gear and no idea, and plenty of beginners with lots of ideas and no gear. Ideas, means an understanding, appreciation and creative perspective and they can find a way of creating something from nothing, with whatever they have at their disposal. Yes, the result may have room for improvement with a better lens, better resolution or the use of a filter or two, but what separates them from the former is knowledge and the ability to adapt with what they have at their disposal. That knowledge is acquired through the hard hours put into learning their camera craft and being able to see beyond the media generated views of what is reality or beautiful to see the extraordinary in the everyday objects, scenes and events in our lives. Education and knowledge has a bigger positive outcome on your photography than a new lens, tripod, upgraded camera body or the latest accessories and gizmos. Invest in learning the craft more than you do on the equipment to execute it. When you search for photography courses and workshops you will find a plethora of options to choose from. Many people book based on price, location and date. This is of course inevitable, we all live busy lives and have to make compromises, decisions based on multiple criteria. However, how many people use the criteria of education and development before location, budget and dates? I hazard to guess but suspect it’s at least 80% Good photographers don’t necessarily make good teachers. Vice versa, good teachers don’t make necessarily make good photographers. Good is obviously subjective, but you should, at very least, put the emphasis on good teachers before good photographers when choosing a course or workshop if you actually want to learn and improve rather than just imitate. Shoot what you connect to and experiment: Photography lessons for beginners I have emphasised this point on countless occasions over the last ten years - without a personal connection to the subject, scene, situation it’s impossible to create an image, captured in single moment, that expresses what one truly feels about what they are experiencing. This intention is critical for the photographer to know and arguably important for the viewer to interpret. When I embarked on learning photography, I didn’t have a clear idea about what I wanted to photograph. My only objective was that I wanted to become better at whatever I photographed. I therefore experimented with many genres, travel, landscapes, wildlife, portraits, architecture and events. Over time it became apparent that I was naturally drawn to one genre over the over. Maybe it’s because I am most relaxed and used the outdoors and landscape environments both locally and further afield to re-balance myself after a hectic, stressful and exhausting week in the corporate world I worked in. The outdoors and particularly the countryside has always been a major part of recreation for me so it’s of no real surprise that my photography pursuits ended up taking place there. While I do think it’s important for any photographer, especially beginners, to experiment with other genres and subjects - this helps build a visual awareness, understanding and increases the repertoire of knowledge, I certainly found that my “best” (measured in personal satisfaction) came from my outdoor/landscape images. Focus your efforts on the genre you enjoy most and have easy access to but don’t be afraid to experiment and dabble in other genres too. Your best image doesn’t define your vision or ability: Photography lessons for beginners There is a real danger that we self-doubt our images and rely on some for of external feedback for confirmation, reassurance or measurement of our best work. The photography community itself has an abundance of ways, when it comes to these checks and balances with competitions, accreditations, awards or simply the size of your Instagram or Facebook following and likes. Being popular doesn’t necessarily mean you are good - Van Gogh only sold one of his own paintings in his whole lifetime - on this basis he really wasn’t very good at what he did! I have met many people who are part of that slightly-outdated community of camera clubs and societies, who have openly told me that they just want to get placed or highly commended for an image they submit to that internal competition. As if this form of recognition is the ultimate goal and confirmation they need to feel a sense of achievement about what they have created. There is nothing wrong in having targets, see my first tip, but you have to be careful about how you allow these to influence you and impact your motivation and direction. The most I have been paid for an image is $15,000 the least I have been paid for is $0.50 - so what does that tell us? Value is subjective and based on the buyers (viewers) perspective. Was the image costing $15,000 any better than the image costing $.50? Not in my view and certainly not in that differential. Did I consider myself an advanced photographer, or any better or worse photographer after the sale of one image versus another, no I certainly didn’t. It’s all very subjective when it comes to value and satisfaction. Everyone of us will have our own take on it. The key thing for any photographer be they an advanced photographer or beginner is to take photos of what you like, present them how you like them and accept that some people will appreciate them and some won’t. Neither is right or wrong if you abandon the parameters and criteria of judgement. If you chose to enter a competition or go for an accreditation, remember you are working to their criteria and rules not yours so don’t complain when the two things don’t align. Subject, Narrative and Light - Photography lessons for beginners What, why When? Whatever subjects you choose to photograph there are some cornerstones of good composition that works and compositions that don’t. The first and arguably most important aspect of any photo is a clear and obvious subject. The point of interest, focal point, subject matter and its environment. Many beginners struggle to reduce the content in their images into a single subject matter because they find it difficult to reduce the elements they see down to one single thing. That thing is the critical element of interest and becomes the focus of attention in the image with everything else around it becoming a supporting element rather than dominant element. I have often used the analogy of going to the theatre and rather than the lighting being on the main characters, and the dialogue between characters being a conversation or the background effects and music accompanying each stage of the story being told, you are bombarded in a nano second of it all played out together an in instant. The result, of course, would be a chaotic non-arrangement of noise and visual disruption. This is how many photographs are taken - maybe not quite to the same level of confusion that i described but certainly not a conscious awareness on the part of the photographer to reduce as many distractions as possible The narrative is the photographer’s interpretation and way of communicating their emotion about the subject they are photographing. This can be a logical conclusion or shrouded in mystery and ambiguity. The choices are down to the photographer but should at least be an important part of the considerations when composing. The light is of course essential. Not many images work well without contrast and areas of shadows and highlights. This doesn’t mean that you can only shoot in certain light, far from it, I have made some of my most satisfying images in what would be considered poor light. The test of advanced photography practise is to adapt to the light you have available and use it to help set the tone and emotional poetry you visualise. Your turn - Photography lessons for beginners I will stop there; not because I couldn’t come up with another two or seven lessons, I could but would prefer to hear the thoughts of those who are going through a journey who are beginners or were, and are happy to share their own insights for beginners. Please add your ideas and discuss in the comments box below. Beginners Classes photography-tipsAlan Ranger20 July 2022Alan Ranger Photographytips LinkedIn0 Pinterest0",
  "wordCount": 2843,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/photography-lessons-for-beginners#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/photography-lessons-for-beginners#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}