{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/photography-show-buying-advice#blogposting",
  "headline": "photography show buying guide | Professional Guide",
  "alternativeHeadline": "photography show buying guide | Professional Guide | Alan Ranger Photography",
  "description": "My advice, over the last few weeks, to those who have contacted me asking about equipment they are thinking of buying at the show, is simply to do your.",
  "url": "https://www.alanranger.com/blog-on-photography/photography-show-buying-advice",
  "datePublished": "2020-03-31T00:00:00.000Z",
  "dateModified": "2020-03-31T00:00:00.000Z",
  "dateCreated": "2020-03-31T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "before you go... My advice, over the last few weeks, to those who have contacted me asking about equipment they are thinking of buying at the show, is simply to do your research before you go to the show. 3 Tips to get the best deal • Try to avoid the impulse purchase when you are there and make a list of specific items you want before you go. Check the prices of several sites online before you go to the show so you know whether you can purchase cheaper online before you get to the show (remember to take into account delivery costs) Consider the ease of returns and warranty in both purchasing online and at the show Pro's of the show purchase The biggest advantage of the show purchase, in my view, is that you get to see, handle, and possibly talk to someone about the item before purchasing it. However, bear in mind that the retail stands that carry lots of equipment can be 5-10 deep with people trying to do the same, so wait times can be frustratingly slow, and the person serving you may be fatigued with the onslaught of questions, deliberations, and pressure to sell quickly! There are also many stands that you can casually browse, such as Benro, Manfrotto, Gitzo, and so on, which is great if actually picking up and seeing is important—particularly useful when it comes to camera bags, tripods, and other items where weight and size are a priority. Sites to check before you go... Apart from the sites listed below, it's worth also thinking about using a QR scanner on your mobile phone. Some QR scanners will give you a list of sites with prices for the scanned item so you can compare them when at the show. QR / Barcode Scanners Shopsavvy for Android & Apple phone Red Laser for Apple Online Retailers Camera Pricebuster - http://www.camerapricebuster.co.uk/ Camera in the Post -http://www.camerainthepost.com/ Amazon - Checkout my recommended products - https://www.alanranger.com/photography-equipment Filters and filter kits then see this - https://www.alanranger.com/s/linhoff-ARP-Discount- And https://www.alanranger.com/blogs/photographic-filters-enhancing-your-photography-with-kase-revolution-filters There are of course many other retailers online but I have listed the goto ones, if others know of better/other sites that they have purchased from and had a good service and price then please add those to the comments section of this post for others to research. I hope this simple guide has helped, maybe it will avoid me answering another 20 emails in the next week but more importantly I hope it helps you get the best deals available either at the show or from another source. newsAlan Ranger31 March 2020Alan Ranger Photography recommended-products LinkedIn0 Pinterest0",
  "wordCount": 441,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/photography-show-buying-advice#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/photography-show-buying-advice#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Photography"
    }
  ]
}