{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/photography-for-kids#blogposting",
  "headline": "Help children take photos - Photography For Kids Guide",
  "alternativeHeadline": "Help children take photos - Photography For Kids Guide | Alan Ranger Photography",
  "description": "Getting Your Kids Into PhotographyPhotography For Kids Photography may seem like an adult’s hobby with all the seemingly complicated equipment and varied.",
  "url": "https://www.alanranger.com/blog-on-photography/photography-for-kids",
  "datePublished": "2015-06-19T00:00:00.000Z",
  "dateModified": "2015-06-19T00:00:00.000Z",
  "dateCreated": "2015-06-19T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Help children take photos - Photography For Kids Guide Getting Your Kids Into PhotographyPhotography For Kids Photography may seem like an adult’s hobby with all the seemingly complicated equipment and varied jargon that comes along with it. Yet the younger generation are just as capable and can produce beautiful pieces of art like the rest of us. When you look at the photos children capture, you are looking at the world through a completely different perspective – the eyes of an innocent child from the mind of a person that hasn't yet been influenced by as many experiences and opinions. As we get closer to spring and with Easter around the corner, the world begins to blossom with new life. What better time than now to introduce your little ones to photography? View fullsize Camera settings explained for kids Kids and photography Get down to basics - Children Photography You may have reservations about handing over your beloved DSLR, that's understandable, but do you have an older camera spare, bridge camera or even a point a shoot? One thing you should avoid doing is spoiling the fun for them. Give them a few guiding tips and leave them to their own creative devices. Children are surprisingly perceptive so they should be able to pick up the basics in no time! This first tip is one that even adults can benefit from – experiment with your shots. Children are some of the most creative beings, seeing the world in a completely different way to that of adults. Their imaginations are always active and brimming with ideas just waiting to be put into physical form. Giving them a camera may allow you to see more than just a still image they've created. Teach them about the various angles and viewpoints they can take photographs from, instilling the idea that even the dullest of subjects can be made exciting if a little thought is put into it. Being as inquisitive as they are, children will quickly get into the swing of things, looking at subjects from every angle imaginable. Even simply explaining the importance of light in a shot is something a child can pick up on with a little help. If the child is old enough and the camera has it why not show them how to shoot in Aperture Priority Mode (A or AV) - explain that the larger the F-number (F16) the more is in focus in the shot the lower the F-number (F5.6) the less is in focus. You might be surprised how they quickly put this choice into action and start making images that go beyond looking like a snap! Make it fun! - Photography For Kids Kids don’t want to do something unless it’s fun and who can blame them? So making up fun little activities for them to get stuck into is a great way to help their photography skills grow. Give them a scavenger hunt or certain things to photograph for their own portfolio; a great piece of memorabilia you can reminisce on in years to come. You could even encourage their storytelling skills and get them to tell a story through a series of photographs they've taken. Giving your child something to work towards that they can be praised for is a great incentive to getting them actively involved in photography. You never know, they might even take it up as a profession one day. Bringing a smile A family activity Photography For Kids The great thing about getting your child started early in their photography journey is that you can both look back on what they did as children and see how much they've developed as grow older. Let your children feel proud of their work, letting them know that as long as they’re having fun, they’re on the right track. If you want to introduce your little ones to the world of photography, I run photography mentoring on-line so their work can be done without attending evening classes or shorter (2.5hrs) photography workshops on location. These are suitable for all ages, if you enrol with your children, and see how photography can change the way you look at the world. I look forward to seeing the next generation of photographers discover the wonders of photography! photography-tipsAlan Ranger0 Pinterest0",
  "wordCount": 716,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/photography-for-kids#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/photography-for-kids#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    }
  ]
}