{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/photography-tips-10-things-to-know#blogposting",
  "headline": "Photography Tips | 10 Things I Wish I Knew Earlier ",
  "alternativeHeadline": "Photography Tips | 10 Things I Wish I Knew Earlier  | Alan Ranger Photography",
  "description": "Photography Tips – Tip of the Day - Ten Simple Things I Wish I Knew Earlier About Photography - How many things do you know? | Photography News Blog |.",
  "url": "https://www.alanranger.com/blog-on-photography/photography-tips-10-things-to-know",
  "datePublished": "2022-10-20T00:00:00.000Z",
  "dateModified": "2022-10-20T00:00:00.000Z",
  "dateCreated": "2022-10-20T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Which Photography Courses Are Best For Me? Course Calendar Beginners Photography Course Free Online Photography Course Beginners Lightroom Course RPS Mentoring photography-lessons-online-1-2-1 Private 1-2-1 Lessons Monthly Mentoring Assignments Intentions Course 2.5hr - 4hr Workshops One-day Workshops Residential Workshops Gift Vouchers 1-2-1 Zoom Support Private 1-2-1 Lessons Gear Checks & Services Fine Art Prints Pick N Mix - Payment Plans Products, Services & Property Photography Portrait Photography Staff Training on Photography Blog Academy Recommended Products PHOTOGRAPHY TIPS | 10 THINGS I WISH I KNEW EARLIERI intend to post new photography tips regularly to my client base on the mailing list. Sign up here if you want to receive these by email Hopefully, with more downtime, you will be able to read and learn photography basics or refresh your understanding. This one is not sixty seconds read :)----------------------------------------PHOTOGRAPHY TIPS - TEN THINGS I WISH I KNEW EARLIER ABOUT PHOTOGRAPHYAfter twenty years of being passionate about photography, I'd like to think I have learned a few things on the way so wanted to share some of those lightbulb moments I had in the early days that helped me improve my photographs. This list could have easily been twenty or forty items, but I wanted to try and condense it into what I think were the most critical elements that I realised back in the day when I began. Some of the items are of course technical, and it's only right that any beginner has to learn those elements to do with the camera and settings, but also some of the significant changes were based on softer skills about light, composition and treatment of photos in post-production. I hope they help or at least remind you of the essential lessons that you are learning now or have learnt----------------------------------------FREE PHOTOGRAPHY TIPS #01 GET OFF AUTOMATIC MODELEARN TO SHOOT IN APERTURE OR SHUTTER PRIORITY MODE TO CONTROL DEPTH OF FIELD AND FOCUS AND SHUTTER SPEED TO CAPT or at least remind you of the essential lessons that you are learning now or have learnt----------------------------------------FREE PHOTOGRAPHY TIPS #01 GET OFF AUTOMATIC MODELEARN TO SHOOT IN APERTURE OR SHUTTER PRIORITY MODE TO CONTROL DEPTH OF FIELD AND FOCUS AND SHUTTER SPEED TO CAPTURE MOVEMENT THE WAY YOU WANT TO. MAKING YOUR OWN DECISIONS AND MISTAKES IS THE FASTEST WAY TO REALISING WHAT THOSE NUMBERS AND SETTINGS REALLY MEAN AND HOW THEY CHANGE AN IMAGE.#02 CONTROL YOUR DEPTH OF FIELDUNDERSTANDING AND USING APERTURE TO CONTROL THE DEPTH OF FIELD (AMOUNT OF SUBJECT MATTER IN FOCUS OR BLURRED) WAS A TURNING POINT FOR ME. BEING ABLE TO VARY THAT AT WILL TO CREATE SOFT AND DELICATE REPRESENTATIONS OR AS MUCH DETAIL AS I WANTED WAS A GAME-CHANGER. YOU DON'T NEED TO MAKE IT HARDER THAN IT TECHNICALLY NEEDS TO BE. APERTURE PRIORITY WILL ALLOW THE CAMERAS LIGHT METER TO WORK OUT EXPOSURE WHILE YOU CONTROL THE DEPTH OF FIELD. MANUAL EXPOSURE WORKS TOO, BUT IT WILL TAKE YOU LONGER TO ACHIEVE THE SAME THING.#03 UNDERSTAND AND USE THE HISTOGRAMTHE HISTOGRAM IS A SIMPLE GRAPH YOU CAN USE WHEN VIEWING A PHOTO ON THE BACK OF THE CAMERAS LCD. IT WILL SHOW YOU WHERE TONAL VALUES OF LIGHT ARE DISTRIBUTED IN THE PICTURE. SHADOW PIXELS TO THE LEFT, MID-TONES IN THE MIDDLE AND HIGHLIGHTS TO THE RIGHT. LEARNING TO EXPOSE TO THE RIGHT (ETR) IS ESSENTIAL IF YOU DON'T WANT \"NOISE\" IN THE SHADOWS. YOUR PHOTO MAY LOOK \"WASHED OUT\" AS A RESULT, BUT THIS IS EASILY CORRECTED IN POST-PRODUCTION AND WILL PRODUCE MUCH BETTER TONAL QUALITY AND RESOLUTION IN THE FINAL IMAGE.#04 UNDERSTAND HOW AND WHERE TO FOCUS ACCURATELYIS FOCUSING SIMPLE? WELL, YES TO AN EXTENT BUT, IT'S SURPRISING HOW MANY PEOPLE DON'T UNDERSTAND HOW AND WHERE TO FOCUS IN A SHOT. SOME APPS CAN HELP YOU DETERMINE HYPER FOCAL DISTANCE, BUT PERSONALLY, THE IDEA OF GETTING AN APP OUT ON MY PHONE DURING A CREATIVE MOMENT FILLS ME WITH DREAD. LEARN TO CONTROL YOUR FOCUS POINT SELECTIVELY AND WHERE TO FOCUS IN A SCENE TO RENDER THE DEPTH OF FIELD YOU REQUIRE. REMEMBER THERE IS MORE THAN ONE VARIABLE TO FOCUSING TO ACHIEVE FOCUS AND DOF!#05 SIMPLIFY YOUR COMPOSITIONTHIS WAS PROBABLY ONE OF THOSE TURNING POINTS WHEN IT CAME TO COMPOSITION. LESS IS MORE! IT'S MORE IMPORTANT WHAT YOU CUT OUT OF A FRAME THAN PUT IN THE FRAME. SIMPLIFY THE COMPOSITION DOWN TO THE THINGS THAT ONLY MATTER RATHER THAN TRYING TO CAPTURE EVERYTHING AND OVER-COMPLICATING THE COMPOSITION AND THE CAMERAS LIMITED EXPOSURE RANGE. WORK ON BALANCING YOUR FRAME WITH ELEMENTS (HIGHLIGHTS, MID-TONES, SHADOWS) RATHER THAN TRYING TO INCLUDE EVERYTHING. REMEMBER, YOU CAN ALWAYS MAKE MORE THAN ONE SHOT!#06 WHY ARE YOU STANDING THERE?THIS ONE TOOK ME A WHILE TO GRASP AND IMPROVE ON. NOW, IT'S ODD HOW CLIENTS SAY YOU ALWAYS GRAB THE BEST SPOTS. I DON'T AS IT HAPPENS, I ALLOW THEM TO FIND THEIR POSITIONS AND THEN WORK AROUND THEM. MAYBE, IT HAS BECOME INTUITIVE TO ME NOW, I SHOULD HOPE SO AFTER TWENTY YEARS, BUT MERELY OBSERVING THE SCENE, AND ADJUSTING HEIGHT (LOWER OR HIGHER, LEFT OR RIGHT), PERSPECTIVE, ANGLES PLUS FOREGROUND AND BACKGROUND WILL AMAZE YOU HOW IT MAKES A DIFFERENCE AND BETTER PHOTOGRAPH. GET AGILE AND BE PREPARED TO KEEP THINKING ABOUT WHERE YOU STAND AND HOW MOVING MAY IMPROVE THINGS.#07 IT'S ALL ABOUT THE LIGHTWHEN I FIRST STARTED PHOTOGRAPHY, I DIDN'T PROPERLY UNDERSTAND HOW TO READ LIGHT IN A SCENE. SURE, I COULD SPOT A GOOD SUNRISE OR SUNSE NCE AND BETTER PHOTOGRAPH. GET AGILE AND BE PREPARED TO KEEP THINKING ABOUT WHERE YOU STAND AND HOW MOVING MAY IMPROVE THINGS.#07 IT'S ALL ABOUT THE LIGHTWHEN I FIRST STARTED PHOTOGRAPHY, I DIDN'T PROPERLY UNDERSTAND HOW TO READ LIGHT IN A SCENE. SURE, I COULD SPOT A GOOD SUNRISE OR SUNSET, BUT OUTSIDE OF THE OBVIOUS, I DIDN'T UNDERSTAND THE RELATIONSHIP BETWEEN HOW THE CAMERA READS LIGHT AND MY EYES/BRAIN RECORD IT. THEY ARE DIFFERENT! I GOT FRUSTRATED THAT MY IMAGES OF LOCATIONS DIDN'T MATCH THOSE OF OTHERS I VIEWED. I WORKED OUT THAT MANAGING THE LIGHT WITH FILTERS, BRACKETING, SHOOTING DIFFERENTLY BASED ON THE LIGHT AND HOW IT RENDERED THINGS IN THE IMAGE WAS A HUGE EYE-OPENER. PHOTOGRAPHY IS ALL ABOUT LIGHT AND HOW THE CAMERA RECORDS THOSE PHOTONS. LEARN ABOUT LIGHT, EMBRACE ITS MANY FORMS AND UNDERSTAND HOW TO DEAL WITH DIFFERENT LIGHTING.#08 POST-PROCESSING IS NOT CHEATINGI REMEMBER THE FIRST PHOTOGRAPHY WORKSHOP I ATTENDED AND HAVING A PASSIONATE DEBATE ABOUT HOW DOING SOMETHING TO AN IMAGE ON THE COMPUTER AFTERWARDS WAS NOT AUTHENTIC! HOW LITTLE I UNDERSTOOD BACK THEN. PHOTO EDITING, PROCESSING, MANIPULATION WHATEVER YOU CALL IT HAS BEEN PART OF THE PHOTOGRAPHY WORKFLOW SINCE ITS CONCEPTION. WHETHER YOU ALLOW YOUR CAMERA TO DO THE GENERIC STYLING OR YOU DO YOUR OWN THING IS YOUR CHOICE BUT REMEMBER THE CAMERA IS JUST AN INSTRUMENT, HOW YOU PLAY IT AND THE STYLE YOU PLAY IT IN IS YOUR CHOICE – AND RIGHTLY SO! LEARN HOW TO EDIT YOUR PHOTOS TO THE WAY YOU WANT THEM TO LOOK. THAT MEANS TAKING CONTROL, LEARNING HOW TO USE EDITING SOFTWARE AND BECOMING PROFICIENT AT THE JOB.#09 DON'T BE SO HARD ON YOURSELFI KNOW WE ARE ALL OUR OWN WORSE CRITICS. I INCLUDED, BUT REMEMBER WE ALL HAVE STRENGTHS AND WEAKNESSES SO WE HAVE TO TRY TO IDENTIFY WHERE WE NEED TO IMPROVE AND IMPORTANTLY, WHAT AREAS WILL GIVE US THE MOST SIGNIFICANT GAINS. GOING BACK TO MY CORPORATE DAYS AS A CONSULTANT, I RECALL DISCUSSING THIS TOPIC AND WORKING OUT WHETHER IT WAS RIGHT TO PLAY TO SOMEONE'S STRENGTHS OR WORK ON IMPROVING THEIR WEAKNESSES. IN PRACTICE, IT IS A CASE OF BALANCING THE TWO BUT EMPHASISING THEIR STRENGTHS MORE SO THAT THEY DIDN'T LOSE MOTIVATION. WHEN IT COMES TO APPLYING THAT TO YOUR PHOTOGRAPHY, I THINK IT'S IMPORTANT TO LOOK BACK AT WHERE YOU STARTED AND WHERE YOU ARE NOW AND ACKNOWLEDGING THE PROGRESS YOU HAVE MADE OVER SOME TIME. IF YOU GET IN A RUT (I'VE HAD SEVERAL OVER THE YEARS) THEN IT'S TIME TO TAKE A FRESH APPROACH BUT STAYING DETERMINED AND OPEN-MINDED WILL YIELD RESULTS IF YOU ARE PREPARED TO TAKE ON BOARD THE FEEDBACK AND WORK HARD TO GET BETTER.#10 GO OUT AND TAKE MORE PHOTOSA NICE EASY ONE TO FINISH ON. YOU WILL MISS 100% OF THE SHOTS YOU DIDN'T TAKE! THE MORE YOU PRACTICE, THE MORE YOU TAKE (CONSIDERED WISE), THE MORE YOU FAMILIARISE YOURSELF WITH THE CAMERA, SETTINGS, COMPOSITION, LIGHT, AND WHAT WORKS AND DOESN'T. YOU WOULDN'T EXPECT TO GO TO THE GYM ONCE AND LOSE 1KG OR PICK UP A GUITAR EVERY EIGHT WEEKS AND STRUM AND EXPECT TO PLAY LIKE JIMI HENDRIX SO WHY THINK THAT PHOTOGRAPHY IS ANY DIFFERENT. GOING OUT AND \"MAKING\" RATHER THAN TAKING PHOTOGRAPHS WITH CRITICAL THINKING IS THE ONLY WAY TO GET BETTER. BOOKS ARE GREAT FOR THEORETICAL UNDERSTANDING, YOUTUBE MIGHT WORK FOR SOME EXPLANATIONS AND IDEAS, BUT NOTHING SUBSTITUTES THE REALITY OF YOU TAKING MORE PHOTOS.----------------------------------------SIGN UP FOR ONE OF MY WEBINAR, ONLINE PHOTOGRAPHY CLASS TUTO IS THE ONLY WAY TO GET BETTER. BOOKS ARE GREAT FOR THEORETICAL UNDERSTANDING, YOUTUBE MIGHT WORK FOR SOME EXPLANATIONS AND IDEAS, BUT NOTHING SUBSTITUTES THE REALITY OF YOU TAKING MORE PHOTOS.----------------------------------------SIGN UP FOR ONE OF MY WEBINAR, ONLINE PHOTOGRAPHY CLASS TUTORIALS - EDITING WITH LIGHTROOM AND NIK, B&W CONVERSION, FILTERS & BRACKETING, COMPOSITION AND MORE…----------------------------------------If you want to support my business and invest something for when we return to normal working ways you can buy yourself a digital gift voucher. You can redeem the voucher at any time against any event or service. You’ll be spending a little bit now for future use and I will have a little bit of cash flowing in, a win-win. ThanksBuy Yourself A Gift Voucher ----------------------------------------photography-basics , photography-tips , tip-of-the-day Alan Ranger 20 October 2022Alan Ranger Photography tips , learn-photography LinkedIn0 Pinterest0",
  "wordCount": 1636,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/photography-tips-10-things-to-know#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/photography-tips-10-things-to-know#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}