{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/photography-the-epitome-of-art#blogposting",
  "headline": "Photography – The Epitome of Art - Stories without words",
  "alternativeHeadline": "Photography – The Epitome of Art - Stories without words | Alan Ranger Photography",
  "description": "Photography – The Epitome of Art As all photographers will argue, photography is an art in its own right, enchanting millions upon millions of onlookers.",
  "url": "https://www.alanranger.com/blog-on-photography/photography-the-epitome-of-art",
  "datePublished": "2015-08-19T00:00:00.000Z",
  "dateModified": "2015-08-19T00:00:00.000Z",
  "dateCreated": "2015-08-19T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Photography – The Epitome of Art - Stories without words Photography – The Epitome of Art As all photographers will argue, photography is an art in its own right, enchanting millions upon millions of onlookers every year. Yet there are those that would argue otherwise, claiming that there is no skill or thought into taking a picture of a luscious landscape or chaotic city. They couldn't be more wrong… Stories without words The stories that can be told with photography can be just as gripping and emotive as stories in the written word. We already express the lives of people through books, songs and paintings; so why are photographs any different? Through the understated medium of photography, we have been able to produce emotive works of art that have moved the hearts of countless people for generations. Sometimes it’s impossible to describe something in words alone. Sometimes the only way to believe something is to see it for yourself. That’s what photography allows us to do. It’s a window into the lives and experiences of everything and anything on this planet. To me, that is aspect of the essence of art. View fullsize Immortalise split seconds of life One reason why the everyday person utilises photography is to capture memories that they can look back on and reminisce over in the years to come. I believe the same can be said for anyone that holds a camera in their hands and takes a photo. No matter what the subjects are, memories are held within that photo and stay alive in the mind of the photographer, giving that photo the same emotional weighting of any song or painting. If you’re good enough, the emotions embedded into a single photograph can spread like wildfire and ignite the hearts of countless people to share in these emotions. War photography is a prime illustration of this. We’ve all seen the photos of soldiers saying goodbye to loved ones and entire cities being brought to rubble. We’ve all felt that same sense of grief and sorrow as we imagine ourselves in that scenario, even bringing some people to tears. This is living proof that photography has the power to move the very essence of what makes us human and that again proves that photography is an art, worthy of recognition. Lose yourself in the art of photography The argument that photography is not an art is futile when considering the power a single photograph possesses. Emotions, stories and memories are all concealed in photography and waiting to be discovered by insightful and creative minds. With a world as diverse as our own, we’re spoiled for choice when choosing our photographic subjects. Whether your subject is people, animals, plants or buildings, everything on this earth has a story to be told. A story you could tell and share with the world. So why not start producing your own art by taking up a number of my photography courses and workshops, tailored to raise the next generation of photographers. These can even be brought together as a Pick ‘n’ Mix package where you could save money on your tuition. What do you think makes photography an art? newsAlan Ranger0 Pinterest0",
  "wordCount": 533,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/photography-the-epitome-of-art#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/photography-the-epitome-of-art#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}