{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/portrait-photography-practice-assignment#blogposting",
  "headline": "Portrait Photography Practice Assignment - Free Lesson",
  "alternativeHeadline": "Portrait Photography Practice Assignment - Free Lesson | Alan Ranger Photography",
  "description": "Learning Objectives • Understand the different styles of portrait photography and their unique characteristics.",
  "url": "https://www.alanranger.com/blog-on-photography/portrait-photography-practice-assignment",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Learning Objectives • Understand the different styles of portrait photography and their unique characteristics. • Master the use of light, composition, and posing to create compelling portraits. • Develop technical skills in camera settings specific to portrait photography. Want feedback on your assignment? Join Foundation Plus and get personalised monthly critique plus full access to all assignments. Learn More & Join Download Assignment PDF Before You Shoot • Select a suitable location that complements the subject's personality and story. • Communicate with your subject to establish rapport and understand their preferences. • Choose the appropriate lens for the desired focal length and perspective. • Prepare your camera settings in advance based on the lighting conditions. • Gather any necessary props or accessories that may enhance the portrait. The Assignment Technical Focus • Use a wide aperture (f/1.8 to f/2.8) to create a shallow depth of field, isolating the subject from the background. • Set the shutter speed to at least 1/125s to avoid motion blur, especially in candid shots. • Adjust the ISO setting based on the lighting: use ISO 100-400 in bright conditions and ISO 800-1600 in lower light. • Utilize single-point autofocus to ensure precise focus on the subject's eyes. • Set the white balance according to the lighting conditions, such as daylight or cloudy, to achieve accurate skin tones. Creative Focus • Experiment with different angles and perspectives to find the most flattering view of your subject. • Incorporate environmental elements to tell a story about the subject's personality and lifestyle. • Use natural light during golden hour for soft, flattering illumination. • Encourage your subject to engage in natural movements or expressions to capture candid moments. • Explore different styles of posing to create dynamic and interesting compositions. Assignment Tasks • Capture a traditional portrait using a 50mm lens at f/2.8, 1/125s, ISO 200 in aperture priority mode, with the subject looking directly at the camera. • Shoot a lifestyle portrait in a park setting at f/4, 1/250s, ISO 400 in manual mode, allowing the subject to interact with their environment. • Create an environmental portrait using a 35mm lens at f/5.6, 1/60s, ISO 800, ensuring the background complements the subject's story. • Take a candid portrait at f/2.0, 1/500s, ISO 1600 in shutter priority mode, capturing the subject in a moment of laughter or thought. • Photograph a headshot at f/1.8, 1/125s, ISO 100 in portrait mode, focusing on the subject's eyes while blurring the background. • Experiment with backlighting by shooting at f/2.8, 1/200s, ISO 400 in manual mode, creating a halo effect around the subject. 💡 Stretch Tasks • Create a series of portraits that explore different emotions, using varied lighting setups and compositions. • Conduct a portrait session with a focus on storytelling, incorporating props and environmental elements to enhance the narrative. DO / DON'T DO • ✓ Do communicate clearly with your subject to make them feel comfortable. • ✓ Do experiment with different lighting conditions to see how they affect mood and tone. • ✓ Do use reflectors or diffusers to manage harsh light and create softer shadows. • ✓ Do review your images frequently to ensure proper exposure and focus. • ✓ Do consider the background and its impact on the overall composition. DON'T • ✗ Don't use overly complicated poses that may make your subject feel uncomfortable. • ✗ Don't neglect the importance of eye contact in creating a connection with the viewer. • ✗ Don't rely solely on automatic settings; understanding manual controls is crucial. • ✗ Don't forget to check your composition before taking the shot; framing is key. • ✗ Don't ignore the importance of post-processing in enhancing your portraits. Reflection Questions • What techniques did you find most effective in capturing your subject's personality? • How did different lighting conditions impact your portraits? • What challenges did you face while directing your subject during the shoot? • How can you improve your approach to capturing candid moments in future sessions? 📚 Related Reading Before you start, read these related blog posts to deepen your understanding: • → What Is Portrait Photography For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus. Alan Ranger0 Pinterest0",
  "wordCount": 726,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/portrait-photography-practice-assignment#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/portrait-photography-practice-assignment#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}