{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/rps-distinctions-group-cfp5t#blogposting",
  "headline": "RPS Distinctions: Gain Licentiate &amp; Associate Mentoring",
  "alternativeHeadline": "RPS Distinctions: Gain Licentiate &amp; Associate Mentoring | Alan Ranger Photography",
  "description": "Are you interested in gaining photographic RPS distinctions | I have a group wishing to apply for the L or A distinction with RPS. Sign up today for mentoring.",
  "url": "https://www.alanranger.com/blog-on-photography/rps-distinctions-group-cfp5t",
  "datePublished": "2021-09-16T00:00:00.000Z",
  "dateModified": "2021-09-16T00:00:00.000Z",
  "dateCreated": "2021-09-16T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Which Photography Courses Are Best For Me? Course Calendar Beginners Photography Course Free Online Photography Course Beginners Lightroom Course RPS Mentoring photography-lessons-online-1-2-1 Private 1-2-1 Lessons Monthly Mentoring Assignments Intentions Course 2.5hr - 4hr Workshops One-day Workshops Residential Workshops Gift Vouchers 1-2-1 Zoom Support Private 1-2-1 Lessons Gear Checks & Services Fine Art Prints Pick N Mix - Payment Plans Products, Services & Property Photography Portrait Photography Staff Training on Photography Blog Academy Recommended Products RPS DISTINCTIONS: GAIN LICENTIATE & ASSOCIATE MENTORINGRPS DISTINCTIONSARE YOU INTERESTED IN GAINING A PHOTOGRAPHIC DISTINCTION?The Royal Photographic Society exists to promote photography and image-making and to support photographers in realising their potential, irrespective of their level of knowledge, equipment or skills. Having supported many clients through a journey of development and improvement, with their photography, over the past few years, I was aware that there is a growing group who have considered and are interested in going for accreditation with the RPS. Therefore I launched the RPS Group in February 2018.The course of classes will stretch your creative interpretation, technical camera execution, editing ability and finally the skill to pull together a panel of coherent images into a panel and set of prints of digital images for projection.I am pleased to say that after three years of launching the course we are making great progress with several more participants already reaching 75% or more of a draft panel that will be ready for submission this year. Plus a 100% success pass rate to date with nine clients achieving their distinctions. The collaborative format of each class is proving to be popular and a great way to get ideas, inspiration and discuss images collectively.If you are interested in joining this course and giving yourself a target to work on an image collection for RPS Distinction please get in touch to discuss or just bo llaborative format of each class is proving to be popular and a great way to get ideas, inspiration and discuss images collectively.If you are interested in joining this course and giving yourself a target to work on an image collection for RPS Distinction please get in touch to discuss or just book online. You can enrol at any time and join a class to suit your pace and availability.FUTURE RPS DISTINCTIONS CLASS DATES: RPS CLASSES ----------------------------------------RPS DISTINCTION REQUIREMENTSPROFESSIONAL RECOGNITION WITH RPSLICENTIATE OF THE RPS (LRPS)Requires 10 images that reflect your ability as a photographer.ASSOCIATE OF THE RPS (ARPS)Requires a body of work/project of 15 images of a high standard and a written Statement of Intent.I have previously supported a few clients in achieving their distinctions - RPS Case Studies so have experience of providing the mentoring and tuition to help you achieve this goal. To date, I have a 100% success record in mentoring clients to a successful pass rate, seven L’s and two A’s. Additionally, my own experience and knowledge mean I am well positioned to offer insight and guide you through the process.DISTINCTION GROUP - COST AND COMMITMENT * You will sign up for six classes within a twelve-month period. * There will be an option to extend for more than six classes or a longer period if you need a bit of extra time and support * Just let me know what class dates you would like to attend, when you know and have work to review. * Aim for at least 10-20 new images for each class or if we have already agreed on certain images for your panel you may attend with revised edited versions plus any new work to be reviewed. * The cost is £395 for the 12 months of classes/support.RPS DISTINCTIONS GROUP - FORMAT AND TUITION * Small group setting at my home or via Zoom Max 3 participants * Dropbox used for updated portfolios and images * Group collaboration and sharing * 2hr-2.5hrs - 7pm - 9:30pm on an optional monthly basis - Option to attend/leave session when it suits you * Advice on an individual basis throughout * Support for panel ideas, layout and coherence * Technical and creative critique with suggestions for improvement * Support for L and A panel submissions process * Support for DPI or Printing quality and formats * Support for RPS AdvisoriesNEXT STEPS - RPS DISTINCTIONS 1. Consider if an RPS Distinction is something you want to achieve 2. Consider if you can commit to up to six classes over the next 12 months 3. Consider if you can make the time to shoot the images needed for a panel 4. Consider the benefits of being in a distinctions group and collaborating/learning 5. Consider how this process will develop you and your photographic skills/knowledgeIf you feel answered positively to those five considerations, then this is a good opportunity for you to enrol in this programme.Just email/phone me to register your interest so I can discuss the level of interest, suitability of your work to date and confirm the timescales and next steps for you to sign up for RPS distinctions/photography-services-near-me/rps-mentoring-photography-course /photography-services-near-me/rps-mentoring-photography-courseRPS Courses - Independent RPS Mentoring for RPS Distinctions from £75.00RPS COURSES - INDEPENDANT RPS MENTORING FOR RPS DISTINCTIONS - START ANYTIME, YOU SELECT SIX ONLINE ZOOM SESSIONS WITHIN TWELVE MONTHS AT INTERVALS TO SUIT YOURPS COURSES - MENTORING FOR DISTINCTIONS * Participants: Via Zoom online in a group of max 3, or on 1-2-1 basis. * Equipment Needed: * Zoom App * Dropbox App used for updated portfolios and images * Terms: Sessions must be taken within 12 months of booking the course or forfeited, but there are options to extend the timeline and retain unused classes or add additional classes. * Method: * Technical and creative critique with suggestions for improvement * Advice on image selection and panel layoutMore Details about the RPS Mentoring Course *Note: Your tutor, Alan Ranger, holds both the RPS's Licentiate and Associate Distinctions, but the RPS does not accredit this Course. This is not an approved course or endorsed by the RPS as an organisation. Alan’s advice is private, unofficial and based on his experience and understanding of the elements required to reach the standard that may result in being awarded a distinction without any guarantee.Course:Select Course RPS Distinctions Course - 6 Sessions RPS Extend 6 Months (No Extra Sessions) RPS Extend 2 classes within 3 months RPS Extend 4 classes within 6 months RPS Extend 6 classes 12 months ExtraAdd to CartOnly 7 availablephotography-courses , student-photos Alan Ranger 16 September 2021Alan Ranger Photography LinkedIn0 Pinterest0",
  "wordCount": 1075,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/rps-distinctions-group-cfp5t#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/rps-distinctions-group-cfp5t#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "Associate of the Royal Photographic Society (ARPS)"
    },
    {
      "@type": "Thing",
      "name": "RPS Distinctions"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "ARPS"
    },
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}