{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/rubys-first-photo-project#blogposting",
  "headline": "Ruby's First Photo Project | The start of her journey",
  "alternativeHeadline": "Ruby's First Photo Project | The start of her journey | Alan Ranger Photography",
  "description": "I am about to start teaching photography to a class of special needs teeangers and have had to prepare a range of tasks and ideas for a photo project for them.",
  "url": "https://www.alanranger.com/blog-on-photography/rubys-first-photo-project",
  "datePublished": "2017-03-30T00:00:00.000Z",
  "dateModified": "2017-03-30T00:00:00.000Z",
  "dateCreated": "2017-03-30T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "RUBY'S FIRST PHOTO PROJECT | THE START OF HER JOURNEYPHOTO PROJECTI am about to start teaching a photography course to a class in a special needs school and have had to prepare a range of photographic tasks and ideas that could be enjoyed and tackled by children with a range of learning abilities.Having sketched out a rough outline I thought who better to try it out with than my own kids.My daughter, Ruby 9yrs, jumped at the opportunity to demonstrate, or as she put it - prove, that she was as good as her Dad. Nothing like a bit of family competition to get the kids to do something you want them to do! She even did a twist on my logo to create her own version for herself.It didn't take long to explain to her that she had to take six shots and then put them together in a hand-made photo album with a short statement to write for each photo. Ruby did the whole project in one weekend and put her heart and soul into every shot. Whilst I naturally helped her with camera settings for each shot she decided her own subject matter, took all the shots and then picked her favourite ones for the album.I know I am bound to be a little bias, aren't all Dads? However what really impressed me was that she had the patience to keep trying to get exactly what she wanted. She knew, without prompting the importance of it being in focus and sharp and even more impressive was that she understood that you shouldn't have any distractions in the photo so moved her own position a ally impressed me was that she had the patience to keep trying to get exactly what she wanted. She knew, without prompting the importance of it being in focus and sharp and even more impressive was that she understood that you shouldn't have any distractions in the photo so moved her own position and used the lens to zoom in and out to get the composition she wanted.So here's my girls first photo project - she is very proud of it and I am very proud of her and hope this is the start of something we can continue to enjoy together for many years to come.So I'd encourage all you parents, grandparents, Aunties and Uncles to get children involved with photography beyond smartphone selfies, you might even learn a thing or two from them about photography and they will certainly show you a perspective and interpretation that isn't obvious to you.RUBY'S PHOTOS AND HER OWN WRITE UP FOR EACH IMAGE UNDER THE PHOTO----------------------------------------View fullsizeFront CoverView fullsizeIndexView fullsizeInside CoverView fullsizePHOTO PROJECT - PORTRAITView fullsizeTitle of Image:Red Ruby DayDescription:The portrait shot has to be a mirror image or a selfie.How did you take the shot?How I did it, I held the camera at an angle and tried to fit in all of my face. We held the button down so it took lots of pictures. The camera put 16 pictures in to 1 photo. It was quite easy thinking about it.When you look at the photo what do you think? I think it’s so cool even though I knew that anyway. If you were me you would know. When I first looked at myself I thought that I was being a bit silly. I pulled a face like I was doing a selfie, I was trying to be silly as it was red nose day.How hard was it to take the shot?It can be tricky some times because you have to be extremely still and focused on the mirror.PHOTO PROJECT - ACTIONView fullsizeTitle of Image:Bubble dayDescription:A live photo and a movement + action shotHow did you take the shot?We had to make sure it shot fast we pressed the button half way to focus then we held the button all the way down once he started blowing bubbles.When you look at the photo what do you think?It says pop and its breath taking because you use your breath to blow bubbles but you can’t see your breath, only the bubbles so that’s the good thing.How hard was it to take the shot?It was quite hard because he only blew one bubble, so we were doing it a long time to complete this task.PHOTO PROJECT - STILL LIFEView fullsizeView fullsizeTitle of Image:Coffee RescueMinion’s Banana RaidDescription:She fell in the cup making coffee her friend helps her.Minions are carrying banana to their blood – thirsty bedrooms and are going to make a hammock for a bed.How did you take the shot?We placed them in positions then I had to be very still and I took a photo of them.When you look at the photo what do you think?I think that if I were in a mug I would want help and I would be hurt.I would love to make my own hammock of banana skins.How hard was it to take the shot?I had to hold the camera very still and I had to try very hard not to show the background of the table in the pictures.PHOTO PROJECT - ABSTRACTView fullsizeView fullsizeTitle of Image:Wood of AnubisThe increased patternDescription:Growling at the wood chopper to go away.Stripy patterns.How did you take the shot?Be low down and only the pattern was show the background of the table in the pictures.PHOTO PROJECT - ABSTRACTView fullsizeView fullsizeTitle of Image:Wood of AnubisThe increased patternDescription:Growling at the wood chopper to go away.Stripy patterns.How did you take the shot?Be low down and only the pattern was in the shot.When you look at the photo what do you think?With its nasty eyes, I think its evil.All the patterns and spots make me think of leopards and there razor–sharp teeth!How hard was it to take the shot?No because I only had to squat down and be steady and still.PHOTO PROJECT - NATUREView fullsizeTitle of Image:BlossomDescription:Sun catching her tentacles.How did you take the shot?I waited and waited till the light was on the flower and then when the flower was still I quickly shot a picture.When you look at the photo what do you think?I think of Dads garden because it is in his garden.How hard was it to take the shot?Yes hard because I had to wait for the sun to gleam and the wind to stop blowing the flower.PHOTO PROJECT - TWISTED SHOTView fullsizeTitle of Image:Gulliver’s GravelDescription:My Brother is upside down and looks like his has a face upside down.How did you take the shot?My brother sat on the swing and then leant backwards until he was upside down. Then I took the photo with him looking upwards.When you look at the photo what do you think?I think of a hairy cheek manHow hard was it to take the shot?It was easy because I just had to photograph him upside down.news Alan Ranger 30 March 2017Alan Ranger Photography kids LinkedIn0 Pinterest0",
  "wordCount": 1145,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/rubys-first-photo-project#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/rubys-first-photo-project#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}