{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/shadows-and-contrast-photography-practice-assignment#blogposting",
  "headline": "Shadows and Contrast Photography Practice Assignment",
  "alternativeHeadline": "Shadows and Contrast Photography Practice Assignment | Alan Ranger Photography",
  "description": "In photography, shadows and contrast are powerful tools that enhance the depth and drama of an image by skillfully manipulating light and shadow and contrast.",
  "url": "https://www.alanranger.com/blog-on-photography/shadows-and-contrast-photography-practice-assignment",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "REFLECTION QUESTIONS * How did manipulating shadows change the mood of your photographs? * What techniques did you find most effective for enhancing contrast? * In what ways did the time of day affect the quality of shadows in your images? * How can you apply the lessons learned about shadows and contrast in future photography projects?📚 RELATED READINGBefore you start, read these related blog posts to deepen your understanding: * → Mastering The Art Of Shadow Photography * → What Is Contrast In Photography For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus.Alan Ranger 23 November 2025Composition & Creative LinkedIn0 Pinterest0 Which Photography Courses Are Best For Me? Course Calendar Beginners Photography Course Free Online Photography Course Beginners Lightroom Course RPS Mentoring photography-lessons-online-1-2-1 Private 1-2-1 Lessons Monthly Mentoring Assignments Intentions Course 2.5hr - 4hr Workshops One-day Workshops Residential Workshops Gift Vouchers 1-2-1 Zoom Support Private 1-2-1 Lessons Gear Checks & Services Fine Art Prints Pick N Mix - Payment Plans Products, Services & Property Photography Portrait Photography Staff Training on Photography Blog Academy Recommended Products SHADOWS AND CONTRAST PHOTOGRAPHY PRACTICE ASSIGNMENThttps://www.alanranger.com/free-online-photography-courseSHADOWS AND CONTRASTIn photography, shadows and contrast are powerful tools that enhance the depth and drama of an image. By skillfully manipulating light and shadow, photographers can create striking compositions that evoke emotion and intrigue.LEARNING OBJECTIVES * Understand the role of shadows in creating contrast and mood in photography. * Master the technical aspects of capturing shadows effectively using various camera settings. * Explore creative techniques to use shadows and contrast for compelling visual storytelling.WANT FEEDBACK ON YOUR ASSIGNMENT?Join Foundation Plus and get personalised monthly critique plus full access to all assignments.Learn More & Join Download Assignment PDF BEFORE YOU SHOOT * Scout locations with varying light conditions and interesting shadow patterns. * Prepare your camera by ensuring it is charged and has sufficient memory space. * Choose the right lens for your desired composition, such as a wide-angle for landscapes or a prime lens for portraits. * Set your camera to manual mode for maximum control over exposure settings. * Check the weather forecast to plan for optimal natural lighting conditions. ficient memory space. * Choose the right lens for your desired composition, such as a wide-angle for landscapes or a prime lens for portraits. * Set your camera to manual mode for maximum control over exposure settings. * Check the weather forecast to plan for optimal natural lighting conditions.THE ASSIGNMENTTECHNICAL FOCUS * Use a low aperture (f/2.8) to create a shallow depth of field, isolating shadows and enhancing contrast against the background. * Set your shutter speed to 1/250s to freeze motion and capture sharp details in both shadows and highlights. * Adjust your ISO to 200 for bright daylight conditions to minimize noise while maintaining image quality. * Utilize spot metering to focus on the light and shadow areas, ensuring proper exposure for contrast. * Set your white balance to 'Shade' to warm up the tones in shadowed areas, enhancing their richness.CREATIVE FOCUS * Experiment with backlighting to create silhouettes, using shadows to define shapes and forms. * Incorporate leading lines created by shadows to draw the viewer's eye into the composition. * Use shadows to create patterns and textures, adding depth and interest to your photographs. * Capture reflections of shadows in water or glass surfaces to create a layered effect. * Play with the angle of light to manipulate the length and intensity of shadows for dramatic effects.ASSIGNMENT TASKS 1. Photograph a subject in direct sunlight at f/4, 1/125s, ISO 100 in aperture priority mode, focusing on the shadows cast by the subject. 2. Capture a scene during golden hour at f/5.6, 1/60s, ISO 200 in manual mode, emphasizing the contrast between warm light and long shadows. 3. Shoot a close-up of an object with a strong shadow at f/2.8, 1/250s, ISO 400 in shutter priority mode, ensuring the shadow details are crisp. 4. Create a silhouette against a sunset at f/8, 1/500s, ISO 100 in manual mode, focusing on the subject's outline and the vibrant colors in the background. 5. Photograph an urban scene with harsh midday sun at f/11, 1/1000s, ISO 200 in aperture priority mode, capturing the stark contrast between light and shadow on buildings. 6. Experiment with flash to create dramatic shadows at f/5.6, 1/125s, ISO 800 in manual mode, adjusting the flash power to control shadow intensity.💡 Stretch Tasks * Create a series of black and white images focusing on shadows and contrast, using a consistent camera setting of f/4, 1/125s, ISO 200 in manual mode. * Develop a photo essay that tells a story through shadows, capturing a variety of techniques and settings in a cohesive narrative.DO / DON'TDO * ✓ Do explore different times of day to see how shadows change with the angle of light. * ✓ Do use reflectors to bounce light into shadowed areas for balanced exposure. * ✓ Do experiment with different lenses to capture shadows from unique perspectives. * ✓ Do analyze your images post-shoot to understand how shadows and contrast affect the overall composition. * ✓ Do share your shadow photography with peers for feedback and discussion.DON'T * ✗ Don't ignore the background; distracting elements can detract from the impact of shadows. * ✗ Don't rely solely on automatic settings; take control for more creative results. * ✗ Don't forget to adjust your settings if the lighting conditions change suddenly. * ✗ Don't overlook the potential of shadows as a subject; they can be as compelling as the main subject. * ✗ Don't shoot in harsh li",
  "wordCount": 953,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/shadows-and-contrast-photography-practice-assignment#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/shadows-and-contrast-photography-practice-assignment#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}