{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/shooting-night-time-photography-tips#blogposting",
  "headline": "Night time photography - Shooting in Low Light Tips",
  "alternativeHeadline": "Night time photography - Shooting in Low Light Tips | Alan Ranger Photography",
  "description": "It’s amazing how much the landscape changes during the dark hours of the night. During winter, we have even more opportunities to shoot Night Time Photography.",
  "url": "https://www.alanranger.com/blog-on-photography/shooting-night-time-photography-tips",
  "datePublished": "2017-03-30T00:00:00.000Z",
  "dateModified": "2017-03-30T00:00:00.000Z",
  "dateCreated": "2017-03-30T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "NIGHT TIME PHOTOGRAPHY - SHOOTING IN LOW LIGHT TIPSNIGHT TIME PHOTOGRAPHYIt’s amazing how much the landscape can change during the dark hours of the night. During winter, we have even more opportunities to explore its depths.A bright, colourful meadow can turn into a dim and mysterious void of nothingness when night descends upon it. Even if the environment around you is consumed by the night, photography still has its place and can even produce more mesmerising photos than during the day.View fullsizePREPARATION IS KEYWith any form of photography, I’d always urge you to do thorough preparation before going out into the field, especially with night photography. The last thing you want to do is fumble around in the darkness trying to set your camera up right or find the best spot. Even if you remember to bring a torch, this inconvenience can be avoided with the right preparation.You also might want to scope out the area before hand and decide exactly what you want to photograph. You don’t want daybreak to come along and bring the light that might ruin your perfect shot.View fullsizeDusk at Kenilworth CastleShooting near a city? Light trails are perfect for night shoots, giving us a glimpse into the hidden pathways light travels every day. Remember though, light pollution can greatly affect your photos, presenting unwanted illumination so pick your spot carefully.View fullsizeCity Centre at nightREMEMBER YOUR CAMERA SETTINGS - NIGHT TIME PH r night shoots, giving us a glimpse into the hidden pathways light travels every day. Remember though, light pollution can greatly affect your photos, presenting unwanted illumination so pick your spot carefully.View fullsizeCity Centre at nightREMEMBER YOUR CAMERA SETTINGS - NIGHT TIME PHOTOGRAPHYIf you’re used to always shooting in brightly lit areas, you’ll probably be used to using similar if not the same camera settings during your shoots. However with night time photography, you’re in a whole other world that requires a very different camera set up.Unless you’re shooting at close range, using the flash on your camera isn’t recommended. Utilising a long exposure is more useful, allowing more captivating details and hidden oddities to be captured in a single photograph. This method is highly useful whilst focussing on the night sky, capturing the stars that have bewildered mankind for centuries.To make the most of the time you have under the stars, you need to invest in a tripod to keep your camera as still as possible, removing any risk of blurred photos. Even using a remote release will greatly aid your aim to get the clearest image.With so much potential, it would be a shame to not make the most of photography during the night.AS ALWAYS, BE CREATIVE WITH IT!With any and all photography it’s important to experiment with new things and see what works best in the scenarios you find yourself in. Experiment with shutter speeds, aperture, angles; the night has so much to offer whether it be in nature or the confines of the city.View fullsizeChesterton Windmill at nightSo with camera in hand, explore the mysteries of the night to improve your skills in night time photography. There’s beauty hidden in every corner. Why not join me for expert advice and tuition on a 2.5hr workshop at night - I will help you with all aspects of shot making from camera set-up and operation to design and composition of your shots.View fullsizeBarley field at nightphotography-tips Alan Ranger 0 Tumblr 0 Likes",
  "wordCount": 571,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/shooting-night-time-photography-tips#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/shooting-night-time-photography-tips#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}