{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/shutter-speed-and-motion-photography-practice-assignment#blogposting",
  "headline": "Shutter Speed and Motion Photography Practice Assignment",
  "alternativeHeadline": "Shutter Speed and Motion Photography Practice Assignment | Alan Ranger Photography",
  "description": "Shutter Speed and Motion. This photography assignment focuses on mastering shutter speed to control motion in your images. By understanding how to manipulate.",
  "url": "https://www.alanranger.com/blog-on-photography/shutter-speed-and-motion-photography-practice-assignment",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "SHUTTER SPEED AND MOTION PHOTOGRAPHY PRACTICE ASSIGNMENThttps://www.alanranger.com/free-online-photography-courseSHUTTER SPEED AND MOTIONThis photography assignment focuses on mastering shutter speed to control motion in your images. By understanding how to manipulate shutter speed, you can either freeze fast-moving subjects or create artistic motion blur, enhancing the storytelling aspect of your photography.LEARNING OBJECTIVES * Understand the relationship between shutter speed and motion capture. * Learn to apply different shutter speeds to achieve desired effects in photography. * Gain proficiency in adjusting camera settings for optimal exposure while capturing movement.WANT FEEDBACK ON YOUR ASSIGNMENT?Join Foundation Plus and get personalised monthly critique plus full access to all assignments.Learn More & Join Download Assignment PDF BEFORE YOU SHOOT * Select a location with dynamic movement, such as a busy street or a sports field. * Ensure your camera battery is fully charged and your memory card has sufficient space. * Familiarize yourself with your camera's shutter speed settings and modes. * Choose appropriate lenses based on your subject and desired perspective. * Consider the lighting conditions and time of day for optimal re your camera battery is fully charged and your memory card has sufficient space. * Familiarize yourself with your camera's shutter speed settings and modes. * Choose appropriate lenses based on your subject and desired perspective. * Consider the lighting conditions and time of day for optimal shutter speed settings.THE ASSIGNMENTTECHNICAL FOCUS * Use a fast shutter speed of 1/1000s at f/4, ISO 200 in shutter priority mode to freeze motion of a running athlete. * Set a slow shutter speed of 1/4s at f/8, ISO 100 in manual mode to capture light trails from moving vehicles. * Employ a shutter speed of 1/30s at f/5.6, ISO 800 in aperture priority mode to create motion blur while panning with a moving subject. * Adjust shutter speed to 1/60s at f/3.5, ISO 400 in program mode to capture a dancer in motion with some blur. * Utilize a shutter speed of 2s at f/11, ISO 100 in manual mode to create a smooth blur effect in waterfall photography.CREATIVE FOCUS * Experiment with intentional camera movement (ICM) by moving your camera during a long exposure to create abstract images. * Try zooming in or out while shooting at a slow shutter speed to create a dynamic sense of motion in your photographs. * Capture subjects in motion against a stationary background to emphasize speed and action. * Use silhouettes against a sunset backdrop with a fast shutter speed to create dramatic imagery. * Combine multiple exposures in post-processing to showcase different stages of motion in a single frame.ASSIGNMENT TASKS 1. Photograph a cyclist racing past you at f/5.6, 1/1000s, ISO 200 in shutter priority mode to freeze their motion. 2. Capture a waterfall with a slow shutter speed of f/8, 1/2s, ISO 100 in manual mode to create a silky water effect. 3. Shoot a moving train at f/4, 1/500s, ISO 400 in aperture priority mode to freeze the train while blurring the background. 4. Use a shutter speed of 1/30s at f/3.2, ISO 800 in manual mode to capture a street performer with motion blur. 5. Photograph a busy street scene at f/11, 1/4s, ISO 100 in manual mode to show light trails from passing cars. 6. Capture a soccer player kicking a ball at f/2.8, 1/2000s, ISO 400 in shutter priority mode to freeze the action.💡 Stretch Tasks * Create an abstract image using ICM by moving the camera vertically during a 1s exposure at f/16, ISO 100. * Shoot a time-lapse sequence of a sunset with varying shutter speeds to capture the changing light and motion.DO / DON'TDO * ✓ Do practice with different shutter speeds to see how they affect motion. * ✓ Do use a tripod for long exposure shots to maintain stability. * ✓ Do experiment with different focal lengths to alter the perception of speed. * ✓ Do adjust your ISO settings to compensate for changing light conditions. * ✓ Do review your images and make adjustments based on the results.DON'T * ✗ Don't use too slow of a shutter speed without a tripod, as it may result in unwanted blur. * ✗ Don't forget to set your white balance according to the lighting conditions. * ✗ Don't shoot in automatic mode if you want full control over your shutter speed. * ✗ Don't neglect to check your histogram to ensure proper exposure. * ✗ Don't be afraid to experiment; some of the best shots come from unexpected settings.REFLECTION QUESTIONS * How did changing shutter speed affect the way motion was captured in your images? * What challenges did you face when trying to freeze or blur motion? gram to ensure proper exposure. * ✗ Don't be afraid to experiment; some of the best shots come from unexpected settings.REFLECTION QUESTIONS * How did changing shutter speed affect the way motion was captured in your images? * What challenges did you face when trying to freeze or blur motion? * Which techniques did you find most effective for conveying movement? * How might you apply your understanding of shutter speed in future photography projects?📚 RELATED READINGBefore you start, read these related blog posts to deepen your understanding: * → What Is Shutter Speed For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus.Alan Ranger 23 November 2025Technical Foundations LinkedIn0 Pinterest0",
  "wordCount": 915,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/shutter-speed-and-motion-photography-practice-assignment#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/shutter-speed-and-motion-photography-practice-assignment#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    }
  ]
}