{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/still-life-photography-practice-assignment#blogposting",
  "headline": "Still Life Photography Practice Assignment - Free Lesson",
  "alternativeHeadline": "Still Life Photography Practice Assignment - Free Lesson | Alan Ranger Photography",
  "description": "Still life photography is a captivating genre that transforms ordinary objects into stunning visual narratives. By controlling composition, lighting, and mood.",
  "url": "https://www.alanranger.com/blog-on-photography/still-life-photography-practice-assignment",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "STILL LIFE PHOTOGRAPHY PRACTICE ASSIGNMENT - FREE LESSONhttps://www.alanranger.com/free-online-photography-courseSTILL LIFE PHOTOGRAPHYStill life photography is a captivating genre that transforms ordinary objects into stunning visual narratives. By controlling composition, lighting, and mood, photographers can create art that evokes emotion and tells a story through careful arrangement and presentation of items.LEARNING OBJECTIVES * Understand the principles of composition in still life photography. * Learn how to manipulate lighting to enhance textures and moods. * Master the use of camera settings to achieve desired effects in still life images.WANT FEEDBACK ON YOUR ASSIGNMENT?Join Foundation Plus and get personalised monthly critique plus full access to all assignments.Learn More & Join Download Assignment PDF BEFORE YOU SHOOT * Select a theme or concept for your still life arrangement. * Gather three to five related objects that complement each other. * Choose a suitable background that enhances the visual appeal of your objects. * Set up your shooting area with adequate space and lighting. * Prepare your camera and check that it is fully charged with an empty memory card.THE ASSIGNMENTTECHNICAL FOCUS * Use a tripod to stabilize ther. * Choose a suitable background that enhances the visual appeal of your objects. * Set up your shooting area with adequate space and lighting. * Prepare your camera and check that it is fully charged with an empty memory card.THE ASSIGNMENTTECHNICAL FOCUS * Use a tripod to stabilize your camera and avoid motion blur; set your aperture to f/8, shutter speed to 1/60s, ISO 100 in manual mode. * Experiment with different focal lengths; try using a 50mm lens at f/4, 1/125s, ISO 200 to create a pleasing depth of field. * Adjust white balance to match your light source; set it to 'Daylight' for natural light or 'Tungsten' for indoor lighting. * Use spot metering to ensure proper exposure on the subject; set your camera to aperture priority mode at f/5.6, 1/80s, ISO 400. * Take test shots and adjust exposure compensation to +1 or -1 as necessary to avoid clipping highlights or shadows.CREATIVE FOCUS * Incorporate the rule of thirds to create dynamic compositions in your still life images. * Experiment with layering textures and varying heights to add depth to your arrangement. * Use negative space intentionally to draw attention to your main subject. * Explore different angles and perspectives to find the most compelling view of your still life. * Utilize props or additional elements to tell a story or enhance the theme of your arrangement.ASSIGNMENT TASKS 1. Arrange a group of three to five related objects on a tabletop; shoot at f/8, 1/60s, ISO 100 in manual mode to achieve sharp focus and depth. 2. Create a still life scene using natural light from a window; set your camera to f/5.6, 1/125s, ISO 200, and use a reflector to bounce light onto the objects. 3. Experiment with different artificial light sources, positioning a softbox at 45°; shoot at f/4, 1/80s, ISO 400 in manual mode to create dramatic shadows. 4. Incorporate a white bounce card to fill in shadows; set your camera to f/8, 1/60s, ISO 100 in aperture priority mode while adjusting the card's position. 5. Take a series of photos from slightly different angles; use f/5.6, 1/125s, ISO 200 to maintain consistent exposure and focus. 6. Create a monochromatic still life arrangement using objects of similar color; shoot at f/11, 1/30s, ISO 100 in manual mode to enhance texture details.💡 Stretch Tasks * Develop a themed still life series focusing on a specific color palette; ensure consistent lighting and shoot at f/8, 1/60s, ISO 100. * Collaborate with another photographer to create contrasting still life images; experiment with different lighting techniques and camera settings.DO / DON'TDO * ✓ Do use a tripod for stability and consistency in your shots. * ✓ Do test different camera settings to find what works best for your specific scene. * ✓ Do pay attention to the arrangement of objects and their relationship to one another. * ✓ Do keep your background simple to avoid distractions from the main subject. * ✓ Do review your images regularly to assess composition and exposure.DON'T * ✗ Don't overcrowd your composition with too many objects. * ✗ Don't ignore the importance of lighting; it can make or break your still life image. * ✗ Don't forget to clean your objects to avoid dust and fingerprints. * ✗ Don't use mixed lighting sources without adjusting your white balance. * ✗ Don't rush the setup; take your time to arrange and style your still life effectively.REFLECTION QUESTIONS * What emotions did you aim to evoke th Don't forget to clean your objects to avoid dust and fingerprints. * ✗ Don't use mixed lighting sources without adjusting your white balance. * ✗ Don't rush the setup; take your time to arrange and style your still life effectively.REFLECTION QUESTIONS * What emotions did you aim to evoke through your still life arrangement? * How did the choice of lighting affect the mood of your photographs? * What challenges did you face while arranging your still life, and how did you overcome them? * In what ways did your camera settings influence the final outcome of your images?📚 RELATED READINGBefore you start, read these related blog posts to deepen your understanding: * → What Is Still Life Photography * → Composition In Photography For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus.Alan Ranger 0 Pinterest0",
  "wordCount": 928,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/still-life-photography-practice-assignment#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/still-life-photography-practice-assignment#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}