{
  "@context": "https://schema.org",
  "@graph": [
    {
      "@type": "WebPage",
      "@id": "https://www.alanranger.com/blog-on-photography/storytelling-narrative-photography-assignment#webpage",
      "url": "https://www.alanranger.com/blog-on-photography/storytelling-narrative-photography-assignment",
      "name": "Storytelling Narrative Photography Assignment",
      "description": "- FREE PHOTOGRAPHYThis assignment teaches the art of storytelling through photography by focusing on capturing emotions and narrative elements in your images.",
      "inLanguage": "en-GB",
      "isPartOf": {
        "@id": "https://www.alanranger.com#website"
      },
      "primaryImageOfPage": {
        "@id": ""
      },
      "about": [
        {
          "@id": "https://www.alanranger.com/blog-on-photography/storytelling-narrative-photography-assignment#blogposting"
        }
      ]
    },
    {
      "@type": "BreadcrumbList",
      "@id": "https://www.alanranger.com/blog-on-photography/storytelling-narrative-photography-assignment#breadcrumb",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://www.alanranger.com"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Blog",
          "item": "https://www.alanranger.com/blog-on-photography"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Storytelling Narrative Photography Assignment",
          "item": "https://www.alanranger.com/blog-on-photography/storytelling-narrative-photography-assignment"
        }
      ]
    },
    {
      "@type": "BlogPosting",
      "@id": "https://www.alanranger.com/blog-on-photography/storytelling-narrative-photography-assignment#blogposting",
      "headline": "Storytelling Narrative Photography Assignment",
      "alternativeHeadline": "Storytelling Narrative Photography Assignment | Alan Ranger Photography",
      "description": "- FREE PHOTOGRAPHYThis assignment teaches the art of storytelling through photography by focusing on capturing emotions and narrative elements in your images.",
      "url": "https://www.alanranger.com/blog-on-photography/storytelling-narrative-photography-assignment",
      "mainEntityOfPage": {
        "@type": "WebPage",
        "@id": "https://www.alanranger.com/blog-on-photography/storytelling-narrative-photography-assignment#webpage"
      },
      "datePublished": "2025-12-01",
      "dateCreated": "2025-12-01",
      "dateModified": "2025-12-01",
      "inLanguage": "en-GB",
      "articleBody": "STORYTELLING NARRATIVE PHOTOGRAPHY ASSIGNMENT - FREEhttps://www.alanranger.com/free-online-photography-courseSTORYTELLING NARRATIVE PHOTOGRAPHYThis assignment teaches the art of storytelling through photography by focusing on capturing emotions and narrative elements in your images. Students will explore composition, lighting, and intentional framing to convey meaningful stories.LEARNING OBJECTIVES * Develop the ability to visualize and plan a narrative before shooting. * Master the use of composition techniques to enhance storytelling. * Learn to employ lighting and gesture to evoke emotions in photographs.WANT FEEDBACK ON YOUR ASSIGNMENT?Join Foundation Plus and get personalised monthly critique plus full access to all assignments.Learn More & Join Download Assignment PDF BEFORE YOU SHOOT * Identify a personal story or theme you wish to convey in your photographs. * Scout locations that resonate with the narrative you want to portray. * Gather props or elements that can enhance the story you're telling. * Plan your shot list to include different angles and compositions that support the narrative. * Set your camera to either aperture priority or shutter priority mode with ISO fixed at 200.THE ASSIGNMENTTECHNICAL FOCUS . * Gather props or elements that can enhance the story you're telling. * Plan your shot list to include different angles and compositions that support the narrative. * Set your camera to either aperture priority or shutter priority mode with ISO fixed at 200.THE ASSIGNMENTTECHNICAL FOCUS * Use aperture priority mode at f/4 with ISO 200 fixed, allowing the camera to adjust shutter speed for depth of field control. * Experiment with different focal lengths to capture varied perspectives of the same subject. * Focus on balancing light and shadow to create mood and atmosphere in your images. * Utilize leading lines in your composition to guide the viewer's eye through the story. * Incorporate depth in your images by including foreground, middle ground, and background elements.CREATIVE FOCUS * Look for candid moments that reveal emotions and relationships between subjects. * Use color and contrast to enhance the emotional tone of your photographs. * Experiment with negative space to emphasize your subject and the story it tells. * Capture gestures and body language that convey interaction and connection. * Try to tell a story in a single frame by focusing on a decisive moment.ASSIGNMENT TASKS 1. Photograph a series of portraits that express different emotions, using aperture priority mode at f/2.8 with ISO 200 fixed. 2. Create a photo essay that follows a day in the life of a local community member, using shutter priority mode at 1/250s with ISO 200 fixed. 3. Capture a moment of interaction between two people, focusing on their gestures and expressions while in aperture priority mode at f/5.6 with ISO 200 fixed. 4. Shoot an environmental portrait that tells a story about the subject's life through the use of props and background elements, using aperture priority mode at f/4 with ISO 200 fixed. 5. Document an event or gathering, capturing candid moments that convey the atmosphere, using shutter priority mode at 1/125s with ISO 200 fixed. 6. Create a series of images that depict a specific theme or concept, ensuring each photo contributes to the overall narrative, using aperture priority mode at f/3.5 with ISO 200 fixed.💡 Stretch Tasks * Develop a multimedia storytelling project that incorporates both photography and audio or written elements. * Create a photo series that captures a narrative arc, with a clear beginning, middle, and end.DO / DON'TDO * ✓ Do take time to observe the scene before shooting to understand the mood and relationships. * ✓ Do include a variety of shots (wide, medium, close-up) to enrich the narrative. * ✓ Do pay attention to the background and eliminate distractions that could detract from the story. * ✓ Do engage with your subjects to elicit authentic emotions and reactions. * ✓ Do review your images critically to assess how well they convey the intended story.DON'T * ✗ Don't rely solely on posed shots; seek out genuine, candid moments. * ✗ Don't ignore the impact of lighting; use it consciously to enhance the mood. * ✗ Don't overcomplicate your composition; keep it focused on the story. * ✗ Don't shoot without a clear intention or theme in mind. * ✗ Don't forget to experiment with different angles and perspectives to find the best storytelling shot.REFLECTION QUESTIONS * How did your choice of composition influence the narrative you were trying to convey? * What emotions did you aim to capture, and how successful were you in doing so? * In what ways to experiment with different angles and perspectives to find the best storytelling shot.REFLECTION QUESTIONS * How did your choice of composition influence the narrative you were trying to convey? * What emotions did you aim to capture, and how successful were you in doing so? * In what ways did lighting affect the mood of your photographs? * What challenges did you face in telling a story through your images, and how did you overcome them?📚 RELATED READINGBefore you start, read these related blog posts to deepen your understanding: * → The Art Of Storytelling Photography * → How To Find Your Photography Style For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus.Alan Ranger 23 November 2025Composition & Creative LinkedIn0 Pinterest0",
      "wordCount": 893,
      "keywords": [
        "Storytelling",
        "Narrative",
        "Photography",
        "Practice"
      ],
      "about": [
        {
          "@type": "Thing",
          "name": "Aperture (photography)"
        },
        {
          "@type": "Thing",
          "name": "Shutter speed"
        },
        {
          "@type": "Thing",
          "name": "Photographic composition"
        }
      ],
      "mentions": [],
      "hasPart": [],
      "image": {
        "@type": "ImageObject",
        "url": "",
        "width": 1500,
        "height": 1000,
        "caption": ""
      },
      "thumbnailUrl": "",
      "speakable": {
        "@type": "SpeakableSpecification",
        "xpath": [
          "/html/head/title",
          "//h1"
        ]
      },
      "discussionUrl": "https://www.alanranger.com/blog-on-photography/storytelling-narrative-photography-assignment#comments",
      "author": {
        "@type": "Person",
        "@id": "https://www.alanranger.com/#person"
      },
      "publisher": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com/#org"
      },
      "isPartOf": {
        "@type": "WebSite",
        "@id": "https://www.alanranger.com/#website"
      },
      "copyrightHolder": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com/#org"
      },
      "copyrightYear": 2025,
      "sameAs": [
        "https://www.alanranger.com/blog-on-photography"
      ],
      "creator": {
        "@type": "Person",
        "@id": "https://www.alanranger.com/#person"
      },
      "accountablePerson": {
        "@type": "Person",
        "@id": "https://www.alanranger.com/#person"
      },
      "teaches": "Storytelling Narrative Photography",
      "interactionStatistic": {
        "@type": "InteractionCounter",
        "interactionType": "https://schema.org/CommentAction",
        "userInteractionCount": 0
      },
      "commentCount": 0
    }
  ]
}