{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/street-photography-practice-assignment#blogposting",
  "headline": "Street Photography Practice Assignment - Free Lesson",
  "alternativeHeadline": "Street Photography Practice Assignment - Free Lesson | Alan Ranger Photography",
  "description": "Learning Objectives • Develop confidence in approaching and photographing strangers in public settings.",
  "url": "https://www.alanranger.com/blog-on-photography/street-photography-practice-assignment",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Learning Objectives • Develop confidence in approaching and photographing strangers in public settings. • Master the technical aspects of street photography including exposure, focus, and composition. • Cultivate an understanding of ethical considerations and cultural sensitivities in street photography. Want feedback on your assignment? Join Foundation Plus and get personalised monthly critique plus full access to all assignments. Learn More & Join Download Assignment PDF Before You Shoot • Research local customs and laws regarding photography in public spaces. • Select a compact camera or a lens that allows for discreet shooting. • Plan your shooting location and time for optimal lighting conditions. • Prepare your camera settings in advance to minimize adjustments during shooting. • Practice zone focusing techniques to capture spontaneous moments effectively. The Assignment Technical Focus • Use aperture priority mode at f/4.0, shutter speed 1/250s, ISO 200 for sharp images in varying light conditions. • Set your camera to continuous focus mode to track moving subjects effectively. • Utilize a white balance setting of 'Daylight' for shooting in natural light to preserve color accuracy. • Experiment with metering modes; use spot metering to expose correctly for subjects in shadowed areas. • Adjust exposure compensation to +1/3 to prevent highlights from blowing out in bright sunlight. Creative Focus • Seek out interesting backgrounds that complement your subjects to create depth in your images. • Look for leading lines in the environment to draw the viewer's eye into the photograph. • Capture candid moments by anticipating gestures and emotions that tell a story. • Utilize reflections in windows or puddles for a creative twist on traditional street scenes. • Experiment with different angles and perspectives to add variety to your compositions. Assignment Tasks • Photograph street vendors at a local market using settings f/5.6, 1/125s, ISO 400 in aperture priority mode to capture vibrant colors and details. • Capture a series of candid portraits of passersby at a busy intersection with settings f/2.8, 1/500s, ISO 800 to achieve a shallow depth of field. • Document street performers in action using settings f/4.0, 1/250s, ISO 200 in manual mode to freeze motion while maintaining good exposure. • Shoot a bustling street scene during sunset using settings f/8, 1/60s, ISO 100 to create a sense of atmosphere with warm light. • Photograph an interesting architectural feature with pedestrians interacting around it using settings f/11, 1/125s, ISO 400 to maintain focus throughout the scene. • Create a photo essay of local culture by capturing various aspects of street life, using settings f/5.6, 1/250s, ISO 400 to maintain consistency. 💡 Stretch Tasks • Conduct an in-depth photo project focusing on a specific neighborhood, utilizing varied camera settings to document the area's unique character and stories. • Create a time-lapse series of a busy street corner over a few hours, adjusting settings dynamically to capture the changing light and activity. DO / DON'T DO • ✓ Do engage with your subjects and ask for permission when appropriate. • ✓ Do practice patience and wait for the right moment to capture a scene. • ✓ Do explore different neighborhoods to broaden your perspective on urban life. • ✓ Do keep your camera ready and be discreet to capture authentic moments. • ✓ Do review your images regularly to understand what works and what doesn’t. DON'T • ✗ Don't intrude on private spaces or disrespect individuals' privacy. • ✗ Don't rely solely on post-processing to fix exposure issues; aim for correct settings in-camera. • ✗ Don't be afraid to experiment; take risks with your compositions and angles. • ✗ Don't stick to one location; explore various environments to diversify your portfolio. • ✗ Don't ignore the importance of storytelling; aim to convey a narrative through your images. Reflection Questions • How did your approach to photographing strangers change during this assignment? • What challenges did you encounter in capturing candid moments and how did you overcome them? • In what ways did your understanding of ethical considerations in street photography evolve? • How did the technical aspects of your camera settings influence the final images you captured? 📚 Related Reading Before you start, read these related blog posts to deepen your understanding: • → Street Photography Tips For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus. Alan Ranger0 Pinterest0",
  "wordCount": 741,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/street-photography-practice-assignment#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/street-photography-practice-assignment#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}