{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/struggle-to-see-your-camera-screen#blogposting",
  "headline": "Struggle to see your camera screen | Professional guide",
  "alternativeHeadline": "Struggle to see your camera screen | Professional guide | Alan Ranger Photography",
  "description": "Every photographer who has been outside in bright sunlight will tell you that's it pretty hard to review your image on the camera screen.",
  "url": "https://www.alanranger.com/blog-on-photography/struggle-to-see-your-camera-screen",
  "datePublished": "2016-01-31T00:00:00.000Z",
  "dateModified": "2016-01-31T00:00:00.000Z",
  "dateCreated": "2016-01-31T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Struggle to see your camera screen | Professional guide Every photographer who has been outside in bright sunlight will tell you that's it pretty hard to review your image on the camera screen. Not all camera's allow you to review the image you have taken through the viewfinder - assuming your camera even has a viewfinder! LCD Viewfinder - Camera Screen There are a couple of alternative devices to solve this problem. They both basically do the same thing. Matin M-6296 2X LCD Viewfinder Kit to Fit 3.2 inch Screen Available from my recommended products through Amazon Associates Store at £38. This device will cover a LCD screen up to 3.2\" which covers pretty much most camera types. It also allows for 2 x magnification so helps you see those details and check sharpness/focus and depth of field even more accurately. -5 to +3 diopter adjustment for those who wear glasses. It comes supplied with a pouch and neck strap. Hoodman Hoodloupe Available from my recommended products through Amazon Associates Store at £87. Works exactly the same as the Matin above - so why the extra £50? I don't know the answer to that other than it uses minimal magnification to prevent eliminate visual pixilation of your image and comes with with ¼ 20 mounting solution thread Anyone who has attended one of my workshops will tell you how I bang the drum repeatedly about reviewing your image on the camera screen to check for all those silly mistakes, imperfections and opportunities to re-take and improve the shot both technically and creatively. These devices can really make the difference of that process being achievable or not so if you care about getting it right don't go on a shoot without one. My Amazon Associates Store contains many products I recommend and personally use - click on this store link to see what you can add to your kit bag to make like easier and your photography easier to do. photography-tips, recommended-productsAlan Ranger31 January 2016recommended-products, NIK LinkedIn0 Pinterest0",
  "wordCount": 337,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/struggle-to-see-your-camera-screen#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/struggle-to-see-your-camera-screen#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Photography"
    }
  ]
}