{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/suffolk-punch-personal-perspective#blogposting",
  "headline": "Suffolk Punch - A personal perspective &amp; Background",
  "alternativeHeadline": "Suffolk Punch - A personal perspective &amp; Background | Alan Ranger Photography",
  "description": "Suffolk Punch is an area of untapped beauty and photographic challenges.&nbsp; Read about my latest photo workshop in a harsh light in an inspiring location.",
  "url": "https://www.alanranger.com/blog-on-photography/suffolk-punch-personal-perspective",
  "datePublished": "2018-03-02T00:00:00.000Z",
  "dateModified": "2018-03-02T00:00:00.000Z",
  "dateCreated": "2018-03-02T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "SUFFOLK PUNCH - A PERSONAL PERSPECTIVE & BACKGROUNDSUFFOLK PUNCHSUFFOLK ROOTSI was educated (or not) in Suffolk as my parents moved there from south London when I was young. Therefore, Suffolk is the place I, partly, grew up in and have fond memories of. Part of my family still resides there, Ipswich and Felixstowe and being brought up there meant my loyalties regarding football have remained firmly attached to Ipswich Town. I held a season ticket with ITFC for several years despite moving to Coventry at eighteen and made numerous trips to the ground from Coventry (2.5hrs each way) to suffer frequent disappointment, with the occasional rush of success. Like most footy fans that's par for the course and eventually with the astronomical rise in ticket prices and the over-commercialisation of football, brought about Sky television I quickly became despondent about the time and cost to go to games. By the time I reached my mid 30's (a few years ago!) I lost the appetite for the game and what used to be a passion, which coincidentally was replaced with the love of photography. Interestingly the experience and outcomes are broadly similar - many disappointments and the occasional rush of satisfaction but also a lot of miles travelled and an expensive pursuit.I'm not sure that these two events are connected other than to say the love of Suffolk has not waned over the years. It's interesting that it doesn't feature much as a location for landscape photographers e occasional rush of satisfaction but also a lot of miles travelled and an expensive pursuit.I'm not sure that these two events are connected other than to say the love of Suffolk has not waned over the years. It's interesting that it doesn't feature much as a location for landscape photographers. Then when you consider the variety and choices we have in the UK to photograph the outdoors and landscape it doesn't take much to work out that we are totally spoilt for choice. Devon, Wales, Lakes, Northumbria, Scotland, Dorset to name a few and of course with the nearest neighbour, Norfolk , and particularly North Norfolk it's easy to see why so many haven't explored the Suffolk coast and countryside yet.SUFFOLK JEWELSPhotographically speaking my experiences in Suffolk have largely been based on family trips back home, thus I have never made proper time to consider, create and explore this area beyond family walks and limited time in any location. However, inspired by the work of Lee Acaster and Justin Minns and my own knowledge of the potential I recently organised a workshop there. In a somewhat fortunate way, the workshop didn't attract full participation which enabled me to go knowing that I would have an element of personal time to create as well as provide clients with what they wanted, sorry I meant needed!----------------------------------------LIGHT IN LANDSCAPESLandscape photography is always challenging due to the variable nature of light and weather so facing three days of bright blue skies, sunshine and harsh lighting I was compelled to think B&W. Interestingly, looking back through my portfolio recently, I haven't produced much mono in yonks. I'm not sure why that is, as it certainly isn't deliberate, so, I guess my visual awareness is drawn more towards colour, even though I know I resist too many colours in a single image. However, the harsh contrast light and in particular blue skies made me automatically think mono on this weekend. So barring a few early morning (softer light) frames most of the weekend was geared towards B&W and stark contrast.COLOUR LANDSCAPESView fullsizeRoad between Blythburgh and SouthwoldView fullsizeiPhone grab shot of reed beds at sunriseThe early, pre-sunrise, opportunities were my favourite, not so much because of the intense colour you record in defused light but because of the atmospheric situation of being, mainly alone, just you, your camera and the empty space and tranquillity of no one else around. We were based in Blythburgh, a ten-minute drive to Southwold or Walberswick, which gave us a few options for sunrise shots. Southwold Pier, beach huts and even the country road into the town provides plenty of opportunities for the \"classic\" shots of the pier etc or for the more \"rebellious\" individuals some gorgeous fields, woodlands and reed beds.View fullsizePre-Sunrise Southwold pierView fullsizeSunrise Southwold Pier----------------------------------------MONO LANDSCAPESOne of the biggest challenges of landscape/outdoor photography is adapting to the available light and conditions. It's somewhat easy to apply mechanical thinking to camera settings to work around the light, Bracketing/HDR, filters and whatever other tricks you can apply to capture a dynamic range of light in excess of the sensor's native capability. So faced with bright b the available light and conditions. It's somewhat easy to apply mechanical thinking to camera settings to work around the light, Bracketing/HDR, filters and whatever other tricks you can apply to capture a dynamic range of light in excess of the sensor's native capability. So faced with bright blue skies for three days of harsh light and barely any colour revealing itself after 10 am there was the only way to go was think mono.> \"Do not take the drastic step of abolishing or discarding something in its entirety when only part of it is unacceptable\"Mono, for me at least, has always been about removing colour because it's a distraction rather than something \"arty to do\". I rarely dabble in flicking any image to mono just because it's easy to do in post-production, instead, I have been fairly steadfast in the approach of thinking mono at the time of framing and capture. Thus the last weekend in Suffolk was largely an exercise in working in a monotone mindset throughout the day.Looking for high contrast situations, shapes/patterns and textural differences that I could compose together to form something that was evocative.View fullsizeSouthwold Pier Sunrise MonoView fullsizeSouthwold Pier & defenses sunriseMOODY MONOOnce it got past 10 am the mood of light changed considerably and the tonal range of light became extreme. Using spot metering to expose for the brightest elements and tone down everything else in relation to the bright part, created some very moody and contrasty exposures. This technique became the method to search for those subjects and scenes that exploited this relationship in the light.View fullsizeDunwich GrassesView fullsizeShingle Street LayersView fullsizeHerringfleet MillView fullsizeFelixstowe DefensesView fullsizeWalberswick Sand DunesView fullsizeShingle Street PoolsView fullsizeHerringfleet Reed BedsView fullsizeTown and Country----------------------------------------It was an interesting weekend and reminded me of my own roots and the potential of this unexplored landscape, and my own approach to dealing with difficult light. I am pleased that is has forced me to take on mono again. I don't think for one minute, that I have mastered the execution but it feels good to be outside of a comfort zone again.I'm looking forward to going back there again in September on another workshop to explore and develop this untapped area. Please take a look at my landscape photography workshops listings for more opportunities to explore and photograph the UK.photography-workshops Alan Ranger 2 March 2018Alan Ranger Photography LinkedIn0 Pinterest0 Pinterest0",
  "wordCount": 1169,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/suffolk-punch-personal-perspective#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/suffolk-punch-personal-perspective#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    },
    {
      "@type": "Thing",
      "name": "Woodland photography"
    }
  ]
}