{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/ten-tips-towards-better-composition#blogposting",
  "headline": "Tip of the day - Ten tips towards better composition",
  "alternativeHeadline": "Tip of the day - Ten tips towards better composition | Alan Ranger Photography",
  "description": "I intend to post a new photography tip regularly to my client base on the mailing list.",
  "url": "https://www.alanranger.com/blog-on-photography/ten-tips-towards-better-composition",
  "datePublished": "2021-06-23T00:00:00.000Z",
  "dateModified": "2021-06-23T00:00:00.000Z",
  "dateCreated": "2021-06-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Tip of the day - Ten tips towards better composition I intend to post a new photography tip regularly to my client base on the mailing list. Sign up here if you want to receive these by email Hopefully, with more downtime, you will be able to read and learn photography basics or refresh your understanding. This one is not sixty seconds read :) Ten tips towards better composition #01 Shooting from where your feet land - Better Composition “The eye should learn to listen before it looks.” Just because you happen to stop at a certain point or notice something you want to shoot doesn't mean that this is the ideal position, height, angle to immediately take the photograph from. In fact, it would probably be a miracle if you were always automatically arriving in the ideal position every time. Where you have the chance, spend some time changing your point of view, height, angle and perspective. Look at the light, shadows and how you can separate objects in the frame so they don’t blend together or overlap. #02 Including too much in the frame - Better Composition “The painter constructs, the photographer discloses.” Creating photographs more accurately describes the process of being a photographer than taking a photograph. Consideration has to be made to what the important and essential elements of the picture are. The best principle to apply for a beginner is to keep it simple! The more you include in a photograph the more complex and potentially unambiguous the image becomes. Start with framing just the most important thing and only add other things as “props” to the main subject when they can justify their part in the photo without becoming a distraction. #03 No focal point - Better Composition “For me, the subject of the picture is always more important than the picture.” Make it clear to the viewer what to look at first, second and third. Make sure your focal point is positioned accurately and the composition has a strong leading line, direction and balance to your subject. Placing your main subject dead centre of the frame will not allow the viewer’s eye to explore the rest of the frame. It’s essential to make sure all the elements in the frame are well-positioned and support the main subject in terms of space, depth and perspective. Create each image with a sense of balance! #04 No clear intention - Better Composition “Photography is the story I fail to put into words.” There is nothing worse than a sharp image of a fuzzy concept – every photograph you take should inform the viewer of the photographer’s intention. Making a photograph is telling a story. It has many constructs to it and reflects the vision and interpretation of the person behind the camera and their relationship to the subject. “The camera is an instrument that teaches people how to see without a camera.” #05 Connect to your subject - Better Composition “Don’t shoot what it looks like. Shoot what it feels like.” Recording the world and subjects in it as they are seen by human eyesight does not necessarily show us anything different. In fact, it rarely provokes an emotional response from the viewer unless it’s a startling image captured for journalistic & historical purposes. So how do you turn the ordinary into the extraordinary? Try asking yourself, what do I feel about this subject? Using the one or two words you come up with in your head, focus on making a picture that communicates just those words. #06 Be patient – Be determined - Better Composition “Patience is the essence of clicking great Photographs!” If a shot is worth getting it’s worth waiting for! So many times I witness beginners taking photos as if it was a fast-food activity – in – out – consume – job done. However, when you go out for a special meal you are happy to take your time, enjoy the experience, and relish the flavours and different courses and the company you are with. Creating photographs can, at times, be as much about enjoying the experience of being somewhere and experiencing something as it is getting a shot of it. I have found that simply absorbing my surroundings, watching the changing light and elements has enabled me to take that special shot rather than just any shot. #07 Don’t let composition rules stifle your creativity - Better Composition “To consult the rules of composition before making a picture is a little like consulting the law of gravitation before going for a walk.” Most cameras now show you the rule of thirds. However, you can end up being in a straight-jacket and taking photos based on formula and numbers, which if you’re not careful, won’t allow the expression of your individuality. The rules of composition are a great aid for the beginner trying to move from centrally composed images, but it’s also worth always trying to break the rules to create something more interesting. If it feels balanced and natural to you then that is a good indication that it works. Use the composition rules as a guide not an instruction. #08 Fail to plan, prepare to fail - Better Composition “Always seeing something, never seeing nothing, being photographer” Despite all the planning, research and preparation you can put into shooting at a location, sometimes things just won’t work out as you had hoped with light, weather and subject. However, I always try to give beginners two pieces of advice. Firstly always try to put in the research about timing your visit to a location to maximise the chances of getting the right conditions you want to capture. Secondly, when despite those conditions not being as you had planned to be prepared to change your objectives and the type of shots you can get. It’s often the ability to adapt that brings us the greatest rewards. #09 Pay attention to the light - Better Composition “In the right light, at the right time, everything is extraordinary” A The eye is always drawn to the brightest part of an image – therefore it’s important that you either position yourself, the framing of the shot and main subject with the light falling on it rather than something else. Sometimes you have to wait for the light if shooting a landscape, other times it’s simply a case of moving your position to catch the light from a different angle. In any situation, the light in your photo is fundamental to drawing the viewers’ attention to the subject and can turn the ordinary into extraordinary in a moment! #10 Watch out for foreground & background intruders - Better Composition “A photograph is a secret about a secret. The more it tells you, the less you know” Backgrounds/foregrounds in an image need to be balanced and in context to the main subject. Sometimes you can completely blur the background to make the foreground subject really stand out in contrast. Other times the background is an essential part of the image that gives the foreground context and vice versa with the background. Always check your images after taking them for anything that might distract from the main subject, be it a fuzzy background or foreground or intruders that creep into the shot from the edge of the frame. Usually, showing less is far more compelling. Sign up for one of my webinar, online photography class tutorials - Editing with Lightroom and NIK, B&W Conversion, Filters & Bracketing, Composition and more… If you want to support my business and invest something for when we return to normal working ways you can buy yourself a digital gift voucher. You can redeem the voucher at any time against any event or service. You’ll be spending a little bit now for future use and I will have a little bit of cash flowing in, a win-win. Thanks Buy Yourself A Gift Voucher photography-basics, photography-tips, tip-of-the-dayAlan Ranger23 June 2021Alan Ranger Photographytips, learn-photography LinkedIn0 Pinterest0",
  "wordCount": 1332,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/ten-tips-towards-better-composition#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/ten-tips-towards-better-composition#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}