{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/the-way-of-wu-wei-philosophy#blogposting",
  "headline": "The Way of Wu Wei Philosophy - A Personal Reflection",
  "alternativeHeadline": "The Way of Wu Wei Philosophy - A Personal Reflection | Alan Ranger Photography",
  "description": "Wu Wei philosophy Once upon a time, in the Land of the Middle Kingdom, there lived a great emperor.",
  "url": "https://www.alanranger.com/blog-on-photography/the-way-of-wu-wei-philosophy",
  "datePublished": "2025-09-16T00:00:00.000Z",
  "dateModified": "2025-09-16T00:00:00.000Z",
  "dateCreated": "2025-09-16T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "The Way of Wu Wei Philosophy - A Personal Reflection Wu Wei philosophy Once upon a time, in the Land of the Middle Kingdom, there lived a great emperor. This mighty lord lived in a magnificent castle, surrounded by many guards, ladies in-waiting, cooks, artists, philosophers, and doctors. He awoke each day to the soft caresses of one of his many wices, ate his breakfast in a wonderful garden surrounded by the morning song of his many birds, and passed his days in the company of his many admirers and flatterers. But he was not happy. He felt he was missing out on some essential thing of life. Just what this essential thing was he did not know, but he knew that he did not have it, and this distressed him endlessly. He filled his court with various magicians and philosophers, all of whom tried to tell him that if he would only listen them and them alone he would find this essential and missing ingredient of his life. But he knew that each was only trying to better his own individual situation, and so did not heed their shining and flattering words. Instead, he winnowed them out, one by one, until there were only two groups left, the Confucians and the Taoists. But he could not decide which of them had the secret and essential thing that he was lacking. The Confucians were a haughty yet wise lot. They did not flatter him in silken phrases like other philosophers had. They told him of the mighty days of old, when the emperor was truly the son of heaven and could in heaven’s name. All he had to do was return to those days and revive the ancient ways of the old rites and rituals and his kingdom would prosper - he would be happy and fulfilled, both as a ruler and a man. The Taoists, on the other hand, seemed unorganised and motley crew. They never seemed to agree on anything, even among themselves and spent their days performing strange movements like animals in the garden; their nights drinking wine, reciting poetry, and trying to seduce his ladies-in-waiting. But they were said to have great powers over the elements and the secret of eternal life. Of course, when he questioned them about this they only shrugged and said “we have but once precious secret and the one only, my lord” “well then,” he would say, “What is this precious thing?” “Ah,” they would counter, “We cannot describe this secret in words, great and powerful Lord, we can only show it to you.” “Agreed,” said the emperor, and announced a contest between the Confucians and Taoists. Whichever could show him the true secret of their power, he said, would become the supreme teachers of the land. On the appointed day, the Confucians and Taoists were led to a great chamber deep in the heart of the castle. A great curtain was drawn down the centre of the room, dividing the Taoists from Confucians. Both groups were told that they were to create a painting, a great work of art, on the wall on either side. This would be the final test of their power and knowledge. Whoever impressed the emperor the most would be awarded the prize. The Confucians smiled and quickly ordered all the colours that were available in the royal storerooms. They immediately went to work designing and painting a magnificent mural. The Taoists, on the other hand, ordered a great deal of wine and few dozen soft cloths, the softest that were available. Then they went to work opening the wine. Day after day the Confucians labored on their huge and wondrous mural. Day after day the Taoists ordered more wine and simply rubbed the wall with their soft cloths, over and over, while singing old drinking songs at the top of their lungs. Finally came the day when the emperor would review each work of art and make his decision. First he visited the Confucians’ side of the room, certain that he would be in for a visual treat. He had watched how assiduously the Confucians had applied their layers of colours on the wall and how they stopped often to study the ancient texts and perform slow and stately rituals before taking up their brushes again. He was not disappointed. The Confucians had created a marvel of colour and form. He saw his whole city laid out before him, with his own castle in the very centre of the city, the golden light of the setting sun glinting off its shapely and graceful roofs. At the edge of the painting he saw his own magnificent form astride his favourite war horse, leading his victorious troops into battle against and already vanquished enemy. A great river ran across the bottom of the painting with cunning little waves painted all over it and the curly shadows of birds suspended above it. It was truly a wondrous and amazing sight and the emperor was at a loss as to how the Taoists could top it. Imagine his surprise then when he crossed over to the other side of the room to view the Taoists’ work only to find a completely blank wall and a lot of slightly tipsy Taoists doing their strange cloud-like movements. True, the wall was very shiny and smooth after numerous applications with the soft cloths but there was nothing there, no paintings of his magnificence, no golden palace, no wondrous river. “What is this,” he thundered, “you did not even try to paint a picture. Is this the way you curry my favour?” “Oh but we have done our best!” cried the Taoists indignantly, and a little rudely. “But there is nothing there, “ said the emperor, “Is this truly how you view me? Is this your precious secret?” “Wait one moment please,” said the oldest and tipsiest of the Taoists, his long beard still damp with wine. “Please draw the aside the curtain between our walls and you will truly see our work” So shaking his head in wonder, the emperor had the curtain drawn, revealing the dazzling painting of the Confucians. The emperor stood before it once again, marvelling at its wonder(and how they seemed to get his noble brow just so). Then, his mind already made up as to who was the the winner this day, he turned once again to the Taoists’ blank wall, only to find there, not a blank wall after all but the reflection of the painting on the opposite wall. Only this time, instead of a flat and static picture, he saw reflected the unbelievably smooth and shiny wall, a moving picture. Somehow, because of the play of light on the shiny surface there, it seemed as though the painting had come alive. There was the palace and the town again, only he thought he could detect movement behind its windows. The river itself moved, the waves lapping against each other and the birds pirouetting overhead. And lastly, he could see himself there, astride his great stallion, whose very nostrils seemed to quiver in the air while his own beard fluttered in the breeze and his lips seem to move with own shouted ordered to his troops. He was amazed. He was astounded. he turned to the tipsy Taoists and asked them with humility and wonder in his voice just how they had managed this miracle. The Taoists seemed to hang their heads just a little and answered simply. “It is actually in not doing that we achieved this wondrous thing, Sire all we did was create the space for the painting to happen and it painted itself.” “Is this then your precious secret?” asked the great lord. “Yes,” answered the Taoists, “it is indeed.” “We call it Wu Wei” By Solala Towler - Tales from the TAO news, photography-tips, a-journeyAlan Ranger16 September 2025Alan Ranger Photographycomposition-curiousness LinkedIn0 Pinterest0",
  "wordCount": 1322,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/the-way-of-wu-wei-philosophy#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/the-way-of-wu-wei-philosophy#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}