{
  "@context": "https://schema.org",
  "@graph": [
    {
      "@type": "WebPage",
      "@id": "https://www.alanranger.com/blog-on-photography/top-tips-for-photographing-bluebells#webpage",
      "url": "https://www.alanranger.com/blog-on-photography/top-tips-for-photographing-bluebells",
      "name": "Top Tips for photographing bluebells | A Professional Guide",
      "description": "Table of Contents ShowBluebell woodlands are always an annual highlight for outdoor photographers and I am fortunate enough to have an arrangement with a.",
      "inLanguage": "en-GB",
      "isPartOf": {
        "@id": "https://www.alanranger.com#website"
      },
      "primaryImageOfPage": {
        "@id": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1577785209795-ZFCBGDB3Q8L2QPWCL5CH/bluebell+sways.jpg"
      }
    },
    {
      "@type": "BreadcrumbList",
      "@id": "https://www.alanranger.com/blog-on-photography/top-tips-for-photographing-bluebells#breadcrumb",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://www.alanranger.com"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Blog",
          "item": "https://www.alanranger.com/blog-on-photography"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "Top Tips for photographing bluebells | A Professional Guide",
          "item": "https://www.alanranger.com/blog-on-photography/top-tips-for-photographing-bluebells"
        }
      ]
    },
    {
      "@type": "BlogPosting",
      "@id": "https://www.alanranger.com/blog-on-photography/top-tips-for-photographing-bluebells#blogposting",
      "headline": "Top Tips for photographing bluebells | A Professional Guide",
      "alternativeHeadline": "Top Tips for photographing bluebells | A Professional Guide | Alan Ranger Photography",
      "description": "Table of Contents ShowBluebell woodlands are always an annual highlight for outdoor photographers and I am fortunate enough to have an arrangement with a.",
      "url": "https://www.alanranger.com/blog-on-photography/top-tips-for-photographing-bluebells",
      "mainEntityOfPage": {
        "@type": "WebPage",
        "@id": "https://www.alanranger.com/blog-on-photography/top-tips-for-photographing-bluebells#webpage"
      },
      "datePublished": "2025-04-01T00:00:00+00:00",
      "dateCreated": "2025-04-01T00:00:00+00:00",
      "dateModified": "2025-04-01T00:00:00+00:00",
      "inLanguage": "en-GB",
      "articleBody": "TOP TIPS FOR PHOTOGRAPHING BLUEBELLS | A PROFESSIONAL GUIDETable of Contents ShowBluebell woodlands are always an annual highlight for outdoor photographers and I am fortunate enough to have an arrangement with a local land-owner for access to a private woodland in Warwickshire. People are always suggesting public woods to me for photographing bluebells, and whilst I appreciate their intentions I have yet to see any of these public woods that match the private woodlands I run my workshops in. See details for my bluebell workshop dates at the end of this post.The woods are managed for game and therefore the woodland floor is generally less cluttered and cleared to maximise the views of dense bluebell carpets that are not trampled on by “ignorant” members of the public who think it’s ok to do a selfie in the middle of the bluebells and causing substantial damage to the natural habitat and future flowering.Therefore, my first tips for shooting bluebells wherever you go is:PHOTOGRAPHING BLUEBELLS----------------------------------------1. DO NOT TRAMPLE ON THE BLUEBELLS!> According to research carried out by Moulton College in the Midlands, once damaged, bluebells need approximately five years, without any additional disturbance, to recover fully. Not only does trampling cause a loss of up to 96% of the bluebells’ flowers, but the species also cannot produce seeds as efficiently, consequently affecting many generations to come.ht ds, once damaged, bluebells need approximately five years, without any additional disturbance, to recover fully. Not only does trampling cause a loss of up to 96% of the bluebells’ flowers, but the species also cannot produce seeds as efficiently, consequently affecting many generations to come.https://heartwoodforest.wordpress.com/2017/03/17/save-our-bluebells-2017/ If you see others trampling on them when photographing bluebells explain why that’s causing damage and how it can take up to five years for them to recover, if undisturbed again. Most woodlands have paths so stick to those and be mindful of your impact on the ecology of the woodlands.----------------------------------------2. GO EARLY OR LATE AND AVOID THE TOURISTS!As photographers, we are really passionate about getting those great shots of nature with beautiful light but non-photographers also have as much right to enjoy the bluebells too. If you want to avoid the “tourist” day-trippers then it pays to go very early in the day, as early as sunrise, or very late in the day as the sun sets. You will undoubtedly avoid the flocks of people that turn up between 10 am and 4 pm and hopefully, get some images without every person and their dog in the frame.The National Trust, as an example, have introduced a charge in certain woodlands to try and reduce the volume of traffic to well-known bluebell woodland sites on its estates.https://www.telegraph.co.uk/news/2016/04/18/national-trust-charges-to-see-bluebell-woods-after-crowds-trampl/ ----------------------------------------3. GO PREPARED WITH THE RIGHT GEARPhotographing bluebells can be done in many ways, more of that later, but essentials, in my view, are the following items to improve your chances of getting the best results. * A polariser filter - will help reduce the reflective glare of shiny and wet surfaces and increase the saturation and contrast in your shots - you need to purchase one that fits the diameter of your lens. See my post on filters for more information. * The choice of lenses is always a dilemma if worry about weight or have too many options/distractions in your kit bag. Personally, I prefer two lenses - 70-200mm and a macro lens. However, wide-angle lenses (16-35mm) are also useful in certain situations so if you do have a set that covers a range then it might be worth the weight of carrying them - just try to avoid the I’ve carried these so am going to use them regardless syndrome! Pick the right tool for the job. * At least one spare battery and memory card. You can never have enough batteries and a spare memory card will safeguard you against the unexpected corruption issue whilst there. * Tripods are beneficial for several reasons. * They allow you to frame and re-compose your shot easily with small adjustments to the composition * They stabilise your camera which will allow you to shoot at slower shutter speeds and still get sharp results - remember to turn off image stabilisation! * When doing macro and close-ups it’s essential to use a tripod if you want sharp/in-focus results with blurred backgrounds - the slightest movement in the subject or camera will result in out of focus images. * If you are panning or shoo lts - remember to turn off image stabilisation! * When doing macro and close-ups it’s essential to use a tripod if you want sharp/in-focus results with blurred backgrounds - the slightest movement in the subject or camera will result in out of focus images. * If you are panning or shooting a panoramic the tripod makes this technique much easier to produce the overall aligned shots with the scene being vertically and horizontally level. * My recommended tripods - tripods-gitzo-vs-benro-head-to-head * A remote release cable enables you to take the photo without touching the camera and potentially causing vibration and camera movement resulting in a slightly out of focus shot, If you don’t have a remote release cable then use the camera's built-in 2 sec or 10-sec timer function. * A kneeling mat or dustbin liner is great for doing those low down perspectives and macro shots. * Large sandwich bag or clear plastic bag to cover the camera in the event of rain. * Flask of tea/coffee and snacks – It will be cold early on if you are there at sunrise * Warm clothes – gloves/hat – it’s cold at sunrise in Apr/May! * Wellies or walking shoes/boots – dry warm feet help you stay focused * If you are a smoker then please take something with you to take cigarette butts away with you----------------------------------------4. GET THE COLOUR RIGHT. * White Balance calibration tool - I have lost count of the number of times I have seen bluebell photos that look anything but their natural colour. It’s true that bluebell colour will vary from purple-ish to hues of blue depending on the light temperature and time of day and weather situation. However, if you calibrate the light temperature using a custom white balance then you know that your images won’t need further correction when back home unless it’s for aesthetic/creative reasons. Doing a custom white balance only takes ten seconds but you need to remember to re-calibrate the custom white balance every hour or as often as you sense the light changes or your photos don’t reflect the colour your eye sees. A simple and cost-effective tool for this is the white balance lens cap filter. Make sure you purchase the right size for the diameter of your lens. Check your camera manual for how to set a custom white balance for your particular camera. If using a white balance preset, I recommend cloudy or shady not Auto White Balance (AWB) * Set your JPG Picture Style to Neutral – You should find this in the camera menu system and it will be called something like - Creative style or Picture Style - You are looking for the setting where there are three or four of the icons for contrast, saturation, sharpening all display as zero - meaning that the image recorded is not being artificially enhanced and the colour isn’t exa m and it will be called something like - Creative style or Picture Style - You are looking for the setting where there are three or four of the icons for contrast, saturation, sharpening all display as zero - meaning that the image recorded is not being artificially enhanced and the colour isn’t exaggerated fooling you into thinking your white balance is correct or incorrect.Even if you shoot in RAW only, remember the image displayed on the back of the cameras LCD is a jpg thumbnail so will show the jpg picture style settings. Your RAW file will not, of course, be affected by these settings.----------------------------------------5. GET THE EXPOSURE RIGHT. * Metering Modes – Changing metering modes may help you get an exposure that emphasises the light contrast so work out where to change it on your camera and choose centre-weighted average or spot metering mode to ensure your shadows and highlights have good exposure. It’s easy to check the exposure on the image you have just taken by reviewing the histogram of the image. - Check your camera manual on how to display the histogram for the photo your viewing. * Woodland lighting can be very contrasty and cause exposure issues if you use evaluative metering as the camera tries to deal with a dynamic range of light that exceeds the range the camera can record in a single exposure. Using graduated filters to reduce the bright areas can be tricky because you will effectively darken down tree trunks as well as sky. You can of course bracket exposures . but then you will also need to use the software on the computer to blend them together into a single frame. Personally, I prefer to spot meter and expose it to the right to protect the highlights and then adjust the shadows and mid-tones in post-process. * Personally, my style and preference are to frame the composition without sky leaking into the top of the frame, thus avoiding dynamic range exposure issues and giving as much exposure as the camera allows to the bluebells and dark shadows around them.----------------------------------------6. GET THE DOF RIGHT. * In my view the most common mistake (mistake is probably controversial) is that beginners believe that landscape photography is about getting every aspect of the frame in sharp focus and a depth of field that starts at 1 cm in front of the camera to infinity distance. And, when the camera doesn’t quite match that expectation they then give the image a dose of over-sharpening steroids or detail extractor in post-production. There is no right or wrong answer to this setting or treatment other than personal interpretation and taste. However, you have to consider how your eye sees the scene naturally and how far you wish to push those boundaries - is photography about reality (based on human perception and how the eye witnesses something) or is it about something that is an art form and therefore transcends those boundaries. The answer to that question is a personal one so I won’t make a judgement on either side of that argument but just say that you should knowingly set your depth of field (Aperture F stop) to create the illusion that matches your intention. * I have taken many bluebell woodland shots over the years and the DoF ranges from wide-open F2.8 to F6.3 with varying focal lengths to F16 but the majority of shots that match my style are generally in the lower DoF range because I want the “il to create the illusion that matches your intention. * I have taken many bluebell woodland shots over the years and the DoF ranges from wide-open F2.8 to F6.3 with varying focal lengths to F16 but the majority of shots that match my style are generally in the lower DoF range because I want the “illusion” of the dense patch of bluebells in the distance rather than attempting to show every bluebell within 200 meters in front of me as sharp as the next. So, when photographing bluebells be open-minded about using various apertures and focus points to experiment.----------------------------------------7. VARY YOUR HEIGHT, POSITION AND ANGLE. * Think about your viewpoint and elevation to the subject when photographing bluebells * Survey your subject from many viewpoints and perspectives * Take note of the light, contrasts, surroundings and background - photograph the light! * Watch out for cluttered backgrounds and distractions I have witnessed a bad habit over the years ( I am guilty too sometimes) of putting the camera on the tripod, at any given height, and then simply moving the tripod to the next spot and framing a shot without first evaluating a different height, position and angle to my subject. It’s an easy trap to fall into so try to remember to treat every shot with the same care and duty that you gave the first shot you made that day.Take a look at my composition viewing frames to help you work this out----------------------------------------8. DESIGN YOUR COMPOSITION.Composition is key – make sure it has a good skeleton framework of interest * Decide on a clear subject, focal point and framing when photographing bluebells * Watch out for intruders (distractions) on edge of the frame and very dark or very light areas inside the frame. * The edges/border of the image are just as important as what’s inside so keep them simple/clean and as consistent as possible * Think about movement, and dynamism in the composition so there are strong directional flows and contrasts of light and dark that support this. * You don’t have to show the whole area/environment, get closer for details * Aperture variation can produce vastly different results of blurred or detailed backgrounds so experiment but don’t just stick to one F number! * Look for texture, shape, form, interesting angles and use lines wisely * Think about changing aspect ratios of the frame in the camera to help you frame a better composition.----------------------------------------9. CREATIVITY AND EXPERIMENTATION.It can become lazy to just move around a location and apply the same style, technique and method. This approach limits and stifles your creativity. Try and remind yourself about the endless ways you can approach photographing bluebells and situations and be open to experimentation. Even if it fails it will broaden your creative thinking for the future. * Think about the many techniques, styles and subjects you can try and apply when photographing bluebells: * Abstract, Macro, Straight, Close-Up, Movement, High Key, Low Key, Vista, Long Exposure, ICM, Minimalist, HDR… * Consider taking a vertical and horizontal composition for every subject/shot, sometimes it produces surprising results.----------------------------------------10. RELAX AND ENJOY.I posted a blog a long time back on How to Lean Photography and The Way",
      "wordCount": 2344,
      "keywords": [
        "photography tips",
        "bluebells"
      ],
      "about": [
        {
          "@type": "Thing",
          "name": "Exposure (photography)"
        },
        {
          "@type": "Thing",
          "name": "Aperture (photography)"
        },
        {
          "@type": "Thing",
          "name": "Shutter speed"
        },
        {
          "@type": "Thing",
          "name": "Photographic composition"
        },
        {
          "@type": "Thing",
          "name": "Landscape photography"
        },
        {
          "@type": "Thing",
          "name": "Woodland photography"
        }
      ],
      "mentions": [],
      "hasPart": [],
      "image": {
        "@type": "ImageObject",
        "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1577785209795-ZFCBGDB3Q8L2QPWCL5CH/bluebell+sways.jpg",
        "width": 1500,
        "height": 1000,
        "caption": "Top Tips for photographing bluebells | A Professional Guide"
      },
      "thumbnailUrl": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1577785209795-ZFCBGDB3Q8L2QPWCL5CH/bluebell+sways.jpg",
      "speakable": {
        "@type": "SpeakableSpecification",
        "xpath": [
          "/html/head/title",
          "//h1"
        ]
      },
      "discussionUrl": "https://www.alanranger.com/blog-on-photography/top-tips-for-photographing-bluebells#comments",
      "author": {
        "@type": "Person",
        "@id": "https://www.alanranger.com/#alanranger",
        "name": "Alan Ranger",
        "url": "https://www.alanranger.com/about-alan-ranger",
        "jobTitle": "Photographer & Photography Educator",
        "sameAs": [
          "https://www.alanranger.com",
          "https://www.linkedin.com/in/alanrangerphotography"
        ]
      },
      "publisher": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography",
        "url": "https://www.alanranger.com",
        "logo": {
          "@type": "ImageObject",
          "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/b859ad2b-1442-4595-b9a4-410c32299bf8/ALAN+RANGER+photography+LOGO+BLACK.+switched+small.png?format=1500w",
          "width": 300,
          "height": 100
        }
      },
      "isPartOf": {
        "@type": "WebSite",
        "@id": "https://www.alanranger.com/#website"
      },
      "copyrightHolder": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography"
      },
      "copyrightYear": 2025,
      "sameAs": [
        "https://www.alanranger.com/blog-on-photography"
      ],
      "interactionStatistic": {
        "@type": "InteractionCounter",
        "interactionType": "https://schema.org/CommentAction",
        "userInteractionCount": 0
      },
      "commentCount": 0
    }
  ]
}