{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/top-10-composition-mistakes-beginners-make#blogposting",
  "headline": "Top 10 composition mistakes - Guide To Great Composition",
  "alternativeHeadline": "Top 10 composition mistakes - Guide To Great Composition | Alan Ranger Photography",
  "description": "Composition Mistakes are nothing to be ashamed of,in fact, they’re a rite of passage! The only way to grow as a photographer is to learn from trial and error.",
  "url": "https://www.alanranger.com/blog-on-photography/top-10-composition-mistakes-beginners-make",
  "datePublished": "2020-07-27T00:00:00.000Z",
  "dateModified": "2020-07-27T00:00:00.000Z",
  "dateCreated": "2020-07-27T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "TOP 10 COMPOSITION MISTAKES - GUIDE TO GREAT COMPOSITIONA PHOTOGRAPHER’S GUIDE TO GREAT COMPOSITIONAVOIDING COMPOSITION MISTAKESComposition mistakes are nothing to be ashamed of, in fact, they’re a rite of passage! The only way to grow as a photographer is to learn from trial and error. “photography is like life. You need the negatives to develop.” Ask any established photographer and they will reel you off a list of silly mistakes that they have made. Whether it is something small like leaving the lens cap on or devastating like dropping the camera on the floor, we've all been there.I've compiled the most common errors most beginners make when it comes to designing and composing a shot to help you to avoid them: In no particular order:1. COMPOSITION MISTAKES 1 - SHOOTING FROM WHERE YOUR FEET LAND!Just because you happen to stop at a certain point or notice something you want to shoot doesn't mean that this is the ideal position, height, angle to immediately take the photograph from. In fact, it would probably be a miracle if you were always automatically arriving in the ideal position every time. Where you have the chance, spend some time changing your point of view, height, angle and perspective by taking into account the light, shadows, separating objects in the frame so they don’t blend together or overlap and making sure you are maximising as many aspects of the photograph as possible.“THE EYE SHOULD LEARN TO LISTEN BEFORE IT LOOKS.”2. COMP nt of view, height, angle and perspective by taking into account the light, shadows, separating objects in the frame so they don’t blend together or overlap and making sure you are maximising as many aspects of the photograph as possible.“THE EYE SHOULD LEARN TO LISTEN BEFORE IT LOOKS.”2. COMPOSITION MISTAKES 2 - INCLUDING TOO MUCH IN THE FRAME.Creating photographs more accurately describes the process of being a photographer than taking a photograph. Consideration has to be made to what the important and essential elements of the picture are. The simple principle to apply for a beginner is to keep it simple!The more you include in a photograph the more complex and potentially unambiguous the image becomes. Try starting with framing just the most important thing that you are trying to capture and only add other things as “props” to the main subject when they can justify their part in the photo without taking away attention from the main subject.“THE PAINTER CONSTRUCTS, THE PHOTOGRAPHER DISCLOSES.” 3. COMPOSITION MISTAKES 3 - NO FOCAL POINTMake it clear to the viewer what to look at first, second and third. Make sure your focal point is positioned accurately and the composition has a strong leading line, direction and balance to your subject. Placing your main subject dead centre of the frame will not allow the viewer’s eye to explore the rest of the frame. It’s essential to make sure all the elements in the frame are well positioned and support the main subject in terms of space, depth and perspective. Create each image with a sense of balance!“FOR ME, THE SUBJECT OF THE PICTURE IS ALWAYS MORE IMPORTANT THAN THE PICTURE.” 4. COMPOSITION MISTAKES 4 - NO CLEAR INTENTIONThere is nothing worse than a sharp image of a fuzzy concept – every photograph you take should inform the viewer of the photographers intention. Creating a photograph is telling a story. It has many constructs to it and reflects the vision and interpretation of the person behind the camera and their relationship to the subject. “The camera is an instrument that teaches people how to see without a camera.” “PHOTOGRAPHY IS THE STORY I FAIL TO PUT INTO WORDS.” 5. COMPOSITION MISTAKES 5 - CONNECT TO YOUR SUBJECTThis is probably one of the most fundamental tips I can advise beginners to put into practise. Recording the world and subjects in it as they are seen by human eyesight does not necessarily show us anything different. In fact it rarely provokes any emotional response from the viewer unless it’s a startling image captured for journalistic purposes. So how do you turn the ordinary into the extraordinary? Try asking yourself, what do I feel about this subject? Using the one or two words you come up with in your head, focus on making a picture that communicates just those words.Imagination is a critical component, see another of my blogs on how emotion can be captured through photography.“DON’T SHOOT WHAT IT LOOKS LIKE. SHOOT WHAT IT FEELS LIKE.” 6. COMPOSITION MISTAKES 6 - BE PATIENT – BE DETERMINEDIf a shot is worth getting it’s worth waiting for! So many times I witness beginners taking photos as if it was a fast food activity – in – out – consume – job done. However, when you go out for a special meal you are happy to take your time, enjoy the experience, relish the flavours and different courses and the company you are with. Creating photographs can, at times, be as much about enjoying the experience t food activity – in – out – consume – job done. However, when you go out for a special meal you are happy to take your time, enjoy the experience, relish the flavours and different courses and the company you are with. Creating photographs can, at times, be as much about enjoying the experience of being somewhere and experiencing something as it is getting a shot of it. More often than not I have found that simply absorbing my surroundings, watching the changing light and elements has enabled me to take that special shot rather than just any shot.“PATIENCE IS THE ESSENCE OF CLICKING GREAT PHOTOGRAPHS!” 7. COMPOSITION MISTAKES 7 - DON'T LET COMPOSITION RULES STIFLE YOUR CREATIVITYMost photographers, and indeed cameras now, show you the rule of thirds. However you can end up being in a straight-jacket and taking photos based on formula and numbers, which if you’re not careful, won’t allow the expression of your individuality. The rules of composition are a great aid for the beginner trying to move from centrally composed images, but it’s also worth always trying to break the rules to create something more interesting – if it feels balanced and natural to you then that is a good indication that it works.“TO CONSULT THE RULES OF COMPOSITION BEFORE MAKING A PICTURE IS A LITTLE LIKE CONSULTING THE LAW OF GRAVITATION BEFORE GOING FOR A WALK.”8. COMPOSITION MISTAKES 8 - FAIL TO PLAN PREPARE TO FAILDespite all the planning, research and preparation you can put into shooting at a location, sometimes things just won’t work out as you had hoped with light, weather and subject. However, I always try to give beginners two pieces of advice. Firstly always try to put in the research about timing your visit to a location to maximise the chances of getting the right conditions you want to capture and secondly, when despite those conditions not being as you had planned be prepared to change your objectives and the type of shots you can get. It’s often the ability to adapt that brings us the greatest rewards.“ALWAYS SEEING SOMETHING, NEVER SEEING NOTHING, BEING PHOTOGRAPHER” 9. COMPOSITION MISTAKES 9 - PAY ATTENTION TO THE LIGHTThe eye is always drawn to the brightest part of an image – therefore it’s important that you either position yourself, the framing of the shot and main subject with the light falling on it rather than something else. Sometimes you have to wait for the light if shooting a landscape, other times it’s simply a case of moving your position to catch the light from a different angle. In any situation the light in your photo is fundamental to drawing the viewers’ attention to the subject and can turn the ordinary into extraordinary in a moment!“IN THE RIGHT LIGHT, AT THE RIGHT TIME, EVERYTHING IS EXTRAORDINARY”10. COMPOSITION MISTAKES 10 - WATCH OUT FOR FOREGROUNDS-BACKGROUNDS AND INTRUDERSBackgrounds/foregrounds in an image need to be balanced and in context to the main subject. Sometimes you can completely blur the background to make the foreground subject really stand out in contrast and other times the background is an essential part of the image that gives the foreground context and vice versa with the background. Always check your images after taking them for anything that might distract from the main subject, be it a fuzzy background or foreground or intruders that creep into the shot from the edge of the frame. Usually, showing less is far more compelling.“A PHOTOGRAPH IS A SE a with the background. Always check your images after taking them for anything that might distract from the main subject, be it a fuzzy background or foreground or intruders that creep into the shot from the edge of the frame. Usually, showing less is far more compelling.“A PHOTOGRAPH IS A SECRET ABOUT A SECRET. THE MORE IT TELLS YOU, THE LESS YOU KNOW”> Alan Ranger Photography delivers a complete range of courses suitable for all levels, whether you’re just starting out or are looking to further your expertise. Whatever you are looking for, Alan has a photography course or workshop that will teach you all the essentials.For more information, visit our Photography Courses page.NEXT WEEKS TIP:TOP 10 CAMERA MISTAKES BEGINNERS MAKEPLEASE LIKE, COMMENT AND SHARE THIS POST IF YOU FOUND IT USEFUL, USING THE SHARE LINK BELOWphotography-tips Alan Ranger 0 Tumblr 0 Likes",
  "wordCount": 1558,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/top-10-composition-mistakes-beginners-make#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/top-10-composition-mistakes-beginners-make#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}