{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/tripods-gitzo-vs-benro-review#blogposting",
  "headline": "Benro Review - Head to Head with Gitzo and Manfrotto Tripods",
  "alternativeHeadline": "Benro Review - Head to Head with Gitzo and Manfrotto Tripods | Alan Ranger Photography",
  "description": "A head-to-head review of the Benro Tripods system versus Gitzo for the amateur landscape photographer who needs to consider weight, stability and price.",
  "url": "https://www.alanranger.com/blog-on-photography/tripods-gitzo-vs-benro-review",
  "datePublished": "2021-07-05T00:00:00.000Z",
  "dateModified": "2021-07-05T00:00:00.000Z",
  "dateCreated": "2021-07-05T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "BENRO REVIEW - HEAD TO HEAD WITH GITZO AND MANFROTTO TRIPODSI have been a proud owner of the Gitzo GT3532LS Tripods with the Manfrotto 405 Pro Geared Head for nearly ten years. Just after the Photography Show in March 2009, I purchased the combination that has been the de facto choice for most landscape photographers for many years. Now its time to compare the Benro head to head with the Gitzo.Overall the GT3532LS and 405 geared head has served me very well and has certainly clocked some mileage over that ten-year period, not to mention being under some extreme conditions of wind, salt water, snow, ice and, of course, plenty of rain in that time. Given it has survived ten years and is still in good working order, I can’t really complain about the cost over that period - c£100 per year.Let’s jump straight into why I am now looking at the Benro alternative setup. There are three main factors that led me to consider a change last September.Gitzo GT3532LS Legs with Manfrotto 405 Pro Geared Head - Client - Joyce James 1. The GT3532LS legs have needed two replacement legs over the ten years due to the carbon fibre breaking down and splintering. I wouldn’t say that was definitely down to the quality of the product, but anyone who knows me, knows I take very good care of my equipment. Secondly, the G-Lock rubber seals, that you use to tighten and untighten and the 3 legs have stretched over the years and when wet from rain they become very loose, making it difficult finitely down to the quality of the product, but anyone who knows me, knows I take very good care of my equipment. Secondly, the G-Lock rubber seals, that you use to tighten and untighten and the 3 legs have stretched over the years and when wet from rain they become very loose, making it difficult and often frustrating to get a secure lock on the leg positions. 2. The overall weight of the GT3532LS legs with the Manfrotto 405 Geared Head is a consideration when you are walking up hills or over any distance with all your other equipment. Whilst I certainly wouldn’t call the combination heavy, it certainly reminds you that you are carrying it when you walk more than a mile or two or an ascent. It is worth pointing out early on in this review that the majority of the weight burden comes from the Manfrotto 405 Geared Head as you will see from the comparison table below. 3. I am frequently asked by clients what tripods and head I recommend for them. We all know this question always results in the “depends” response but even when the answer is the GT3532LS legs with the Manfrotto 405 Geared Head the cost becomes a barrier for most amateurs with not much change from a £1,000 and that’s if you manage to find a deal somewhere. So this review will hopefully meet the needs of some of those enquiries.Having acquired the Mefoto Globetrotter - Carbon Fibre a few years back, for use when travelling overseas, I was interested to see if the MAC Group also produced a good alternative to the Gitzo/405 setup. Benro is one of the brands in the MAC Group, alongside Mefoto and Tenba. I was so impressed with the Mefoto Globetrotter as my lightweight (3.70 lbs), compact and sturdy solution it has been my top recommendation for the majority of my clients for the last two-three years. The aluminium version is excellent value at around £110-£150 (depending on what colour you pick) that it falls within most amateurs budget and needs.Link Mefoto Globetrotter on Amazon Following a discussion with the MAC Group Brand Manager I discovered that they were about to launch a combination head and legs that would be an ideal match and comparison to Gitzo/405 combination, so when then the Benro product arrived in early November 2018 I was very excited to unpack it and give it a road test, which happened to be Glencoe a week later.The first impressions of what arrived were excellent. Clearly great build quality in the geared head and tripod legs but I was also impressed with all of the accessories that are included. Various feet and attachments, tool kit and a padded protective carrying bag all reassured me that this was a quality product straight out of the box. The test would be in its use out in the field or in my case in wet conditions in Scotland.Since that inaugural trip I have not used the Gitzo/405 combination and the C3770TN Benro Combination Tripod with the GD3WH Geared Head has become my default setup on workshops. So far, over 15 workshops later and over the equivalent of out in the field or in my case in wet conditions in Scotland.Since that inaugural trip I have not used the Gitzo/405 combination and the C3770TN Benro Combination Tripod with the GD3WH Geared Head has become my default setup on workshops. So far, over 15 workshops later and over the equivalent of 25 days in use, it has stood up to every test and has not shown any issues. Now, of course, I have to be fair and say that the Gitzo/405 combination has had 10 years of hard use so can I really compare one over the other? The answer is probably not just yet, but my experience tells me that the C3770TN legs definitely feel more durable and easier to use than the Gitzo 3532LS, importantly the G-lock seal's on the C3770TN feel more rugged and secure than the Gitzo ever does, even when new. Time will tell if the Benro-combo stands the test of time and durability.----------------------------------------KEY FACTORS FOR CHOOSING A TRIPOD SET-UPWhen it comes to selecting a tripod and head there are generally five factors to consider. I posted a blog about these considerations in 2018 * Height * Weight * Budget * Stability * FlexibilityI guess I should now add the sixth which would be durability after all we want our equipment to stand the test of time and hopefully invest only once and wisely.Weight, height and flexibility certainly count a great deal towards the comfort and enjoyment of using a tripod and stability is non-negotiable. I have witnessed far too many photographers, over the years, wrestling with a inadequate tripod and head, watching their patience and creativity drain away because they didn’t purchase the right tool for the job in hand or in this case the camera/lens combination.I can say outright that both the Gitzo/405 and Benro set-ups both perform well on height, weight, stability and flexibility. As I have said it’s too early to say whether the Benro setup will suffer the same durability issues that the Gitzo tripods legs have had after years of use but the Benro setup certainly beats the Gitzo/405 hands down on budget costing approximately £350-£500 less and weight.SPECIFICATIONSLet’s get down to the specifications of both set-ups. The first thing I should point out is that the Benro Gear Head is a closer comparison to the Manfrotto 410 Junior Geared Head . This the 405’s baby brother, a head that I have never owned as when using a clients I found the micrometric knobs positioned too close together for my fingers to easily and quickly make adjustments, I think the “ergonomic” grips are simply too small/low profile to wrap your fingers around with a comfortable grip. However, for the purposes of a like for like comparison, I am including both Manfrotto geared heads.----------------------------------------COMPARISON OF TRIPOD LEGS - BENRO VS GITZOView fullsizeView fullsizeExtended Feet SpikesNote both Tripods have three leg sections with no centre column, allowing a lower position to the ground for minimum height shooting.Both tripods come with a range of different feet and adapters for different heads. If you want the extra long spikes (useful when on soft ground) then the Manfrotto G1220.129LB3 will fit to either system 3/8″ screw fitting.View fullsizeBenro C3770TN TripodView fullsizeBenro C3770TN TripodView fullsizeGitzo GT3533LS Tripod----------------------------------------COMPARISON OF TRIPODS HEADS - BENRO VS MANFROTTOView fullsizeNote to use the GD3WH geared head on either the C3770TN or Gitzo 3533LS tripod legs you need to purchase the Geared Head Adapter - GDHAD1 costing £20 (weight 0.015kg).> This simple but effective product is designed for users of the GD3WH Geared Head who wish to use the head on a Combination type tripods that uses a large diameter platform to attach the head to. Currently this is not possible as some of the head controls are lower than the mounting base of the head. The adapter simply screws on to the top of the tripod using the 3/8” thread and provides a raised platform so that the Geared Head can be attached, allowing full tilt up/down and landscape/portrait movement of the head.BENRO GEARED HEAD COMPONENTSView fullsizeBenro GD3WHView fullsizeBenro Geared Head Adapter - GDHAD1View fullsizeArca-Swiss PU70 PlateMANFROTTO GEARED HEAD COMPONENTSView fullsizeManfrotto 405 Pro Geared HeadView fullsizeManfrotto 410 Junior Geared HeadView fullsizeManfrotto 410 Plate----------------------------------------COMBINATIONSGITZO/MANFROTTO VS BENRO - TRIPODSNote prices are based on average selling price at the time of writing. You may find items cheaper or more expensive depending on the retailer. * If you already own the Gitzo tripod legs you can just upgrade your tripods head to a Benro geared head with the adapter to gain a saving on weight and usability.View fullsizeView fullsizeBenro Head & AdapterView fullsizeFeaturesView fullsizeMovement----------------------------------------VERDICT - TRIPODSWithout overstating the obvious, the Benro system is much more affordable than both the Gitzo/Manfrotto combinations with a massive 40% saving on cost. So the obvious question might be, so do I think there is a 40% degradation in performance against my five factors for a tripod setup? NO, absolutely not.Leaving durability out of the equation for now, as I haven’t had the Benro system long enough to make a fair comparison, let's look at my five factors again.HeightBoth tripods leg systems are pretty much identical with the Gitzo legs just having an extra 2cm on max height and 3cm advantage on minimum height. However, if you add the 4.5cm height of the Benro Geared Head Adapter onto the Benro tripod legs then the overall height advantage goes to Benro.Winner - BenroWeightGiven I was comparing my existing setup (Gitzo/Manfrotto 2) against the Benro system then I have saved a whopping 0.96kg (26%) in weight. This may not sound much but trust me every ½ kg counts when you are on your feet for 12 hours on location and walking across varied terrains.Winner - BenroBudgetWhether you choose or prefer the smaller geared head or larger one from Manfrotto you are going to save a lot of kg (26%) in weight. This may not sound much but trust me every ½ kg counts when you are on your feet for 12 hours on location and walking across varied terrains.Winner - BenroBudgetWhether you choose or prefer the smaller geared head or larger one from Manfrotto you are going to save a lot of cash with the Benro geared head. As combined systems, the Benro beats the other combinations hands-down being 33% (£305) less on combination 1 and 45% (£505) less than combination 2.Winner - BenroStabilityBoth systems offer maximum loads way beyond my needs as a landscape photographer. My heaviest combination on the systems is the Sony A99 mkII (0.849kg) with a 70-200mm F2.8 (1.3kg) combined weight of 2.14kg plus a Lee Filter system with multiple filters still does not even get close to the maximum loads of tripod legs and heads on both systems of 5kg on the heads.Winner - EqualFlexibilityLegs - As both systems can go down pretty much to ground level and have similar maximum heights too then as tripod legs go I’d say they are equal in flexibility. However, the Benro tripod legs do feel a lot easier to handle and adjust with bigger grips on the leg adjustments plus the small extra of a padded/velcro holding sleeve on the Benro’s systems leg does provide comfort and protection.Heads - Comparing the Benro Geared Head to the Manfrotto 405 head is trickier. I love the weight saving of nearly 1 kg lighter on the Benro head and it also outperforms the comparison Junior 410 Manfrotto headI can actually get my fingers around the knobs and make adjustments reasonably well. However, the head movement on the Benro is sometimes a bit stiff if you have moved either the lateral or front tilt to maximum positions. On occasions, I have found it tricky to then re-adjust the tilt quickly compared to the Manfrotto 405. Is it worth the extra weight of the Manfrotto, no, not in my opinion?Winner - Benro----------------------------------------WHERE TO TRY AND BY TRIPODS?If you are attending this years photography show at the NEC, Birmingham, 16th-19th Mar 2019, then visit their stand (D101) and you can talk to the folks there and handle the tripods/heads and combinations for yourself. If you want to buy then currently, it seems that only WEX are retailers for the GDHAD1 Head Adaptor I have referenced but you can purchase the Tripod and Geared Head on Amazon or other retailers.LINKS: TRIPODSWex Benro Combination Series 3 Carbon Twist 3 Section Tripod Amazon Benro Combination Series 3 Carbon Twist 3 Section Tripod Wex Benro GD3WH Precision Geared Head Amazon Benro GD3WH Precision Geared Head Wex Benro GDHAD1 Geared Head Adaptor Other equipment I recommend ----------------------------------------REMEMBER TO VISIT MY PHOTOGRAPHY BL",
  "wordCount": 2228,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/tripods-gitzo-vs-benro-review#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/tripods-gitzo-vs-benro-review#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}