{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/triptych-project-photography-assignment-free-lesson#blogposting",
  "headline": "Triptych Project Photography Assignment - Free Lesson",
  "alternativeHeadline": "Triptych Project Photography Assignment - Free Lesson | Alan Ranger Photography",
  "description": "Learning Objectives • Understand the concept and structure of a triptych in photography.",
  "url": "https://www.alanranger.com/blog-on-photography/triptych-project-photography-assignment-free-lesson",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Learning Objectives • Understand the concept and structure of a triptych in photography. • Develop skills in composing images that work together visually and thematically. • Experiment with different styles and perspectives to enhance storytelling in photography. Want feedback on your assignment? Join Foundation Plus and get personalised monthly critique plus full access to all assignments. Learn More & Join Download Assignment PDF Before You Shoot • Choose a narrative or theme that you want to explore in your triptych. • Scout locations that fit your chosen theme and visualize how each panel will relate to one another. • Gather props or subjects that will help convey your story across the three images. • Plan your shooting schedule to ensure you have adequate time for each panel. • Review the principles of composition and how they can be applied to triptychs. The Assignment Technical Focus • Use aperture priority mode at f/5.6 with ISO 200 fixed, allowing the camera to adjust shutter speed for optimal exposure. • Consider using a tripod to maintain consistent framing across all three images. • Experiment with depth of field by adjusting aperture to emphasize your subject in each panel. • Ensure proper lighting for each shot to maintain a cohesive tone throughout the triptych. • Think about the angles and perspectives that will create a visual flow from one image to the next. Creative Focus • Explore how color palettes can unify your triptych and create emotional resonance. • Use leading lines in your compositions to guide the viewer's eye across the three panels. • Incorporate contrasting elements in each image to highlight the narrative or theme. • Experiment with different focal lengths to add variety while maintaining coherence. • Think about the relationship between the left and right images and how they point to the center image. Assignment Tasks • Create three images that together tell a story of growth: the beginning, middle, and end stages of a plant's life cycle, using aperture priority mode at f/4 with ISO 200 fixed. • Photograph a triptych representing a day in the life of a city, capturing the morning, afternoon, and evening scenes, using aperture priority mode at f/8 with ISO 200 fixed. • Document a personal journey or experience in three parts, ensuring each image reflects a different emotional state, using shutter priority mode at 1/250s with ISO 200 fixed. • Capture three related objects that represent a theme of change, ensuring each image has a distinct perspective while maintaining coherence, using aperture priority mode at f/2.8 with ISO 200 fixed. • Photograph a dynamic event in three stages: the buildup, the climax, and the aftermath, using shutter priority mode at 1/500s with ISO 200 fixed. • Create a triptych that explores a color theme, with each panel focusing on a different shade while maintaining a cohesive subject, using aperture priority mode at f/5 with ISO 200 fixed. 💡 Stretch Tasks • Create a series of triptychs that explore the same theme but through different photographic techniques, such as long exposure versus freeze motion. • Collaborate with another photographer to each create triptychs from the same subject matter, comparing styles and interpretations. DO / DON'T DO • ✓ Do plan each shot with the relationship between images in mind. • ✓ Do experiment with different times of day for varied lighting conditions. • ✓ Do ensure that your images are displayed in a way that highlights their connection. • ✓ Do consider the viewer's perspective when composing your images. • ✓ Do take multiple shots for each panel to have options during editing. DON'T • ✗ Don't select unrelated subjects for your triptych. • ✗ Don't neglect the importance of visual flow between the images. • ✗ Don't rely solely on post-editing to create coherence; focus on composition during shooting. • ✗ Don't forget to maintain a consistent style across all three images. • ✗ Don't rush the process; take your time to plan each photograph. Reflection Questions • What narrative did you aim to convey through your triptych, and how did each image contribute to that story? • How did the use of color and composition enhance the connection between your three images? • In what ways did the triptych format challenge your usual approach to photography? • How did the relationships between the left, center, and right images influence your creative decisions? 📚 Related Reading Before you start, read these related blog posts to deepen your understanding: • → The Art Of Storytelling Photography For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus. Alan Ranger0 Pinterest0",
  "wordCount": 791,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/triptych-project-photography-assignment-free-lesson#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/triptych-project-photography-assignment-free-lesson#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}