{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/tripods-a-photographers-best-friend#blogposting",
  "headline": "Tripods – Photographers Best Friend or Creativity Stifler",
  "alternativeHeadline": "Tripods – Photographers Best Friend or Creativity Stifler | Alan Ranger Photography",
  "description": "Tripods – A Photographer’s Best Friend or Creativity Stifler.",
  "url": "https://www.alanranger.com/blog-on-photography/tripods-a-photographers-best-friend",
  "datePublished": "2024-08-29T00:00:00.000Z",
  "dateModified": "2024-08-29T00:00:00.000Z",
  "dateCreated": "2024-08-29T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Tripods – Photographers Best Friend or Creativity Stifler Tripods – A Photographer’s Best Friend or Creativity Stifler? Our three legged friend is essential when it comes to small apertures, long exposure times and shooting in low light, however a tripod can also become a real stifler when it comes to being creative and having the freedom to move around - hand-holding the camera, unless you apply some simple but effective disciplines. There is no doubt that a tripod is essential for the majority of photography where apertures between F8 & F16 slow the exposure time down to less than 1/60 of second, the \"considered\" normal limit for hand-holding the camera. Combined with the desire for many outdoor photographers to shoot at dawn and dusk, because of the subtler light, you can quickly understand how the tripod is relied on to get a sharp shot. However, I have observed a trend or maybe just a beginner's trait, when leading outdoor workshops for over 3 years, that it's all to easy to allow the tripod to decide the position, height, angle, perspective of the next shot you take. Here's the scenario that I have witnessed on just about every workshop - person sets camera up on tripod then walks to chosen spot of interest and places tripod on ground. They then work the composition from that exact position they placed the tripod down - this is no different to the countless times I observe \"snappers\" walking around a town / place of interest with camera in hand and then immediately stop at the point they spot something and take the shot from exactly that position at that height and perspective - usually just using the zoom on the lens to adjust for framing. I call this the miracle spot! Miraculously they always seem to know where to stop to be in the perfect position to take the shot. I wish I had their instinct and eye for such perfect positioning every time! By deploying a couple of simple disciplines, you will improve your image making and stop the tripod becoming the determining factor. Why Tripods are Essential Discipline 1 - Observation The 10-20mins you spend observing and thinking about the design of your shot, the subject, light and narrative should determine how best to make that photograph. That investment in observation time is not just a waiting game for the sake of it - it achieves a number of things. • slows you down to pay more attention to all the visual elements and clues that you need to use to express your interpretation of the subject/scene allows you to make a stronger connection to the subject which in turn hopefully translates to a more complete image allows you examine and consider all the elements of designing your shot from camera craft and settings to placement and perspective. Discipline 2 - Hand hold the camera first allows you work away from the tripod whilst you examine and work out the height and angle of the frame - you can bend, stoop, stretch and angle without any restriction (apart from your own flexibility) and then position the tripod in the \"perfect\" position. Of course, not every image needs tripods - after observing and hand holding you may find that you decide on a much wider aperture F2.8 to F5.6 or a fast enough shutter speed to hand-hold the shot without the restriction of then having to set the tripod up. Remember not all landscapes need to be shot at small apertures of F16, sometimes the shallow depth of field of F5.6 helps to create a separation of foreground and background that expresses the interpretation far more than having front to back focus. Mark Littlejohn (winner of landscape photographer of the year 2014) doesn't use a tripod that often , this enables him to be free to experiment and move around a scene quickly and effortlessly to capture that glimpsing light and mist in woodland scenes. So the next question is, what tripods? Well, that's a good question but not necessarily so easy to answer as everyone's needs are different. It depends on several factors: height weight budget stability flexibility View fullsize Tripod height conversion table Tripods Height - tripod legs come in a range of heights - ideally you need one that when fully extended (without using the centre column - which destabilises the weight distribution) reaches your chin - this enables you to get the tripod high enough for shots requiring it, and saves you a hunched-back issue in years to come from stooping over it because its too short. Make sure you check the height of the tripod (without centre column) before you buy. Use this quick reference table I have put together to give you an approx idea of height needed to reach about your chin level which means once you add the height of your tripod head and camera body it should approximately be at least eye level whilst standing straight. Tripods Weight - many people have told me they brought a certain make of tripod because it's light and therefore easy to carry around. Fair point because there's not much point in buying something that you are discouraged from taking with you because it weighs 2-5KG with the head on it. However buying a lightweight tripod and then dropping your 400mm zoom lens and full size DSLR on it, combined weight 8KG, is also going to end in disaster at some point as the \"load\" is unbalanced. Make sure you check the maximum load weight for the tripod and head in the manufacturers specifications and work out your maximum load weight of your camera body and heaviest lens. Tripods Budget - we all have some level of what we think we can afford and of course restriction. My experience of working with beginner's is that they generally make the same mistake I did when I started off by going by price before anything else and then realising sometime in the future that they made the wrong choice and need to re-invest in different tripod. There are many price brackets from £120 to £800+. Buying the most expensive is not required because it really depends on the type of photography you do as much as anything else. Getting a system that matches your budget and the other 3 considerations takes a little time to work out but buying the right one first time will hopefully mean you keep and enjoy it for a long time to come. Don't just think how much can i afford today - work out where your photography might lead and how much each of the 3 other considerations are a priority in your purchasing and using decision. Tripods Stability - The whole point of a tripod is to stabilise the camera when you have longer exposure times. Obviously external conditions are variable depending on where you are shooting - If like me you are out photographing in all weathers, wind, rain, snow and often on higher ground then the chances are you need something that can withstand the buffeting of the wind and elements. This is where heavier tripods have an advantage as they are less likely to shake rattle and roll or in one case I saw a couple of year back actually take off in a gust of wind. However there are tripods that are lightweight and yet still very stable (Carbon Fibre) but they come at a price - worth the investment if you think you may regularly encounter the challenges of extremer weather. If you have the opportunity, tap the legs of the tripod when fully extended and see if you can sense any vibration running along the tripod legs. If you can feel any vibration then you know the tripod is susceptible to vibration and this can lead to blurred shots in the wind Tripods Flexibility - If like me you want ultimate flexibility with the tripod to get low down to the ground or into odd positions then you need a set of tripod legs that allow ground level shooting - this means no centre column or certainly the ability to easily remove or adjust the centre column into a horizontal boom position. Likewise the tripod head can also make this easy or impossible to get what you want. Think about the range of shots you might want to take at different heights - decide if having a centre column is important for you - used for horizontal boom to position camera over the top of something or overhang over something you cant move to. My Recommendations and why... If you think you’re ready to invest you can check out my Amazon store. This store contains the tripods I recommend, plus more so you can expand on your photography kit. The Gitzo GT3532 is a lovely tripod, legs only, its lightweight, works low and high and is easy to use with twist lock grips to expand and contract. It comes at a price because is carbon fibre, stable and flexible. Suited to outdoor conditions in all weathers. For me (5' 11\") is has more than enough height when fully extended with the head and camera body on top. Weight 1.8kg without a head The MeFoto Globetrotter Carbon is my alternative tripod for when I am travelling abroad, or walking further distances or just need something much lighter. The carbon fibre version weighs just an incredible 3.7 pounds and reduces down to just 40cm when compact which makes it small enough to fit into any camera bag or luggage. It also converts quickly and easily into a monopod so perfect for travel photography. It comes with a ball head and carrying case and spikes as well as the standard rubber feet so is flexible, light and gives me the height needed when fully extended without needing to stoop - which so many travel tripods cause. MeFoto also do an aluminium version which weighs and extra pound at 4.7 pounds but is a lot cheaper at approx £170 - https://www.alanranger.com/photography-equipment Watch the YouTube Video Here: Note this is the Roadtrip not Globetrotter but similar enough to give you an idea. The Manfrotto 055 is my 3rd recommendation for those who want an entry level tripod that is flexible, stable but very affordable. Whilst is does not have the advantage of super light weight it makes up for it in terms of stability and flexibility. Its heavier than the MeFoto as weight 2.5kgs without a head attached. It also reaches a height of 140cm without the use of a centre column so suits everyone under 5' 10\" and the centre column can be repositioned for low level shots. My advice given the cost of a separate head and the overall weight would be to choose the MeFoto aluminium over this for pound to pound weight, height and budget but the Manfrotto for stability in extremer weather. The Gitzo and Manfrotto do not come with tripod heads. This is another topic in it's own right - from experience of talking to beginners and advanced most people decide (eventually) that the gear heads are worth the money. They allow for fine and accurate movement of the camera position so you can really be precise with your composition, where as ball heads and 3 way levers can leave you getting frustrated by the amount of play in the head movement. My two recommendations are: Manfrotto Junior Geared Head Manfrotto 405 Pro Geared Head Both work the same way but of course the Junior is lighter, cheaper but I find slightly more tricky to use, on account of my fat fingers trying to rotate the knobs easily. From memory of talking to others I think there is also a restriction with the junior when it comes to positioning the head in a vertical format and when using the horizontal boom position of the centre column. All in all, I’d say every photographer should have at least one tripod they can rely on to take on any shoot in any weather or situation - the MeFoto excellent design, weight and flexibility is a great all rounder but if you expect to be doing some more rugged terrain stuff then the Gitzo and Manfrotto combinations will certainly not let you down. If you have your own preferences, experiences or recommendations I and the readers would be delighted to read about them so please join the conversation and post your comment below. Thanks photography-tips, recommended-productsAlan Ranger29 August 2024tripod, recommended-products, NIK LinkedIn0 Pinterest0",
  "wordCount": 2094,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/tripods-a-photographers-best-friend#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/tripods-a-photographers-best-friend#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    },
    {
      "@type": "Thing",
      "name": "Woodland photography"
    }
  ]
}