{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/virtual-bluebell-photoshoot#blogposting",
  "headline": "Virtual Bluebell Photoshoot for the NHS | Money Raised",
  "alternativeHeadline": "Virtual Bluebell Photoshoot for the NHS | Money Raised | Alan Ranger Photography",
  "description": "24-04-20 - You can’t attend the bluebell photoshoot workshops this year so I am bringing them to you with an NHS Junior Doctor. Please watch and share.",
  "url": "https://www.alanranger.com/blog-on-photography/virtual-bluebell-photoshoot",
  "datePublished": "2020-04-25T00:00:00.000Z",
  "dateModified": "2020-04-25T00:00:00.000Z",
  "dateCreated": "2020-04-25T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "VIRTUAL BLUEBELL PHOTOSHOOT FOR THE NHS | MONEY RAISEDVirtual bluebell PhotoshootFirst of all thank you to those who have emailed me in the last few days to check I am ok and healthy because the lack of blog posts may have made you think, something is wrong. I appreciate your concern and fear not, normal service of daily or bi-daily posts will resume soon enough. I know you have missed me filling up your inboxes for the last several days but I have been working on a mini-project. When I say “mini-project” that’s how it started off and like most projects it wasn’t long before scope creep became a major factor and took me out of my comfort zone of still photography, Lightroom and Photoshop into a new product for me, Adobe Premiere Pro. Software designed to blend and produce a video from multiple media assets.A steep learning curve over 72 hrs but with the help of Con McHugh and various YouTube tutorials I have managed to cobble, and hopefully “craft”, something together that ultimately brings the bluebell woodlands to you this spring. Today *Friday 24th April) was the first day of my scheduled bluebell woodland workshops (i’m glad I got the timing right again), it’s such a pity that I can’t run these as planned and enable you to marvel at the spectacle of the amazing sight of a woodland covered in a dense carpet of these blue annual shows-offs. I went there on Tuesday (21st Apr) at sunrise to record the NHS worker/singers in the woods and took a few images early morni pity that I can’t run these as planned and enable you to marvel at the spectacle of the amazing sight of a woodland covered in a dense carpet of these blue annual shows-offs. I went there on Tuesday (21st Apr) at sunrise to record the NHS worker/singers in the woods and took a few images early morning before they arrived. I don’t mind admitting that the sight of watching them sing in the bluebell woodlands brought tears to my eyes. I hope this video does that emotion some justice.VIRTUAL BLUEBELL PHOTOSHOOT WOODLANDS 2020 WITH AN NHS JUNIOR DOCTORThis video has been produced bring the bluebell woodlands you as I know many of you can’t go to them, let alone photograph and enjoy them. We hope that instead of you being able to visit you can make a donation to SWFT Charity - South Warwickshire NHS > SWFT Charity funds enhancements beyond the NHS standard for Warwick, Leamington Spa, Stratford and Ellen Badger Hospital as well as out of hospital community services across the whole of Warwickshire. With your help we can make our services the best that they can be for patients, families and carers when they need it most. Any support that you are able to give to our charity will make such a difference and adds valuable support for developments, departments and wards across South Warwickshire and beyond. * PLEASE DONATE IF YOU CAN. HTTPS://WWW.JUSTGIVING.COM/FUNDRAISING/BLUEBELLVIRTUALWALK * PLEASE SHARE ON ALL YOUR SOCIAL MEDIA ACCOUNTS TO HELP RAISE AS MUCH MONEY AS POSSIBLE FOR OUR NHS HEROES. covid-19-support , photography-workshops , what's-behind-the-image , news Alan Ranger 25 April 2020bluebells , news LinkedIn0 Pinterest0",
  "wordCount": 539,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/virtual-bluebell-photoshoot#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/virtual-bluebell-photoshoot#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Woodland photography"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}