{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/visual-weight-and-flow-practice-assignment#blogposting",
  "headline": "Visual Weight and Flow Photography Practice Assignment",
  "alternativeHeadline": "Visual Weight and Flow Photography Practice Assignment | Alan Ranger Photography",
  "description": "Learning Objectives • Identify and apply the principles of visual weight in compositions.",
  "url": "https://www.alanranger.com/blog-on-photography/visual-weight-and-flow-practice-assignment",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Learning Objectives • Identify and apply the principles of visual weight in compositions. • Utilize negative space to stabilize and balance images. • Experiment with different placements of subjects to enhance flow and tension. Want feedback on your assignment? Join Foundation Plus and get personalised monthly critique plus full access to all assignments. Learn More & Join Download Assignment PDF Before You Shoot • Read the article on compositional balance to understand visual weight and flow. • Choose a location with varied subjects, such as a park or urban setting. • Prepare your camera by setting the ISO to 200. • Decide on the type of images you want to create (e.g., portraits, landscapes). • Gather any props or additional elements you might want to include in your shots. The Assignment Technical Focus • Use aperture priority mode to control depth of field while maintaining a fixed ISO of 200. • Pay attention to the edges of the frame to avoid distractions. • Experiment with different focal lengths to see how they affect visual weight. • Utilize leading lines in your compositions to enhance flow. • Consider the horizon line and its placement in the frame for balance. Creative Focus • Explore contrasting colors to create visual tension and focus. • Utilize light and shadow to enhance the three-dimensional feel of your subjects. • Incorporate movement within the frame to guide the viewer's eye. • Experiment with off-center compositions to create dynamic tension. • Use reflections or patterns to create visual interest and lead the viewer's eye. Assignment Tasks • Photograph a scene where you intentionally use negative space to create balance, using aperture priority mode at f/4 with ISO 200 fixed. • Capture a portrait where the subject is placed off-center, making use of leading lines to guide the viewer's eye, using aperture priority mode at f/2.8 with ISO 200 fixed. • Create an image where contrasting elements (e.g., light and dark, large and small) are used to establish visual weight, using aperture priority mode at f/5.6 with ISO 200 fixed. • Shoot a landscape where the horizon is placed either on the top or bottom third of the frame to explore balance, using aperture priority mode at f/8 with ISO 200 fixed. • Take a series of three images of the same subject from different angles to observe how flow changes, using aperture priority mode at f/3.5 with ISO 200 fixed. • Photograph an urban scene that incorporates architectural elements with varying heights to explore visual weight, using aperture priority mode at f/6.3 with ISO 200 fixed. 💡 Stretch Tasks • Create a diptych or triptych that showcases contrasting visual weights between images while maintaining a cohesive flow. • Experiment with long exposure techniques to capture movement in a busy scene, using shutter priority mode at 1/15s with ISO 200 fixed. DO / DON'T DO • ✓ Do analyze your compositions for visual weight before taking the shot. • ✓ Do use negative space intentionally to create balance. • ✓ Do adjust your viewpoint to enhance the flow of your images. • ✓ Do consider the colors and tones in your composition for visual impact. • ✓ Do continuously review and adjust your framing to maintain balance. DON'T • ✗ Don't overcrowd your frame with too many subjects; aim for simplicity. • ✗ Don't forget to scan the edges of your frame for distractions. • ✗ Don't rely solely on symmetry; explore asymmetrical balance. • ✗ Don't ignore the importance of light and how it affects visual weight. • ✗ Don't shoot without considering how the viewer’s eye will flow through your image. Reflection Questions • How did the use of negative space in your images impact their overall balance? • What changes did you notice in visual weight when adjusting the subject's position? • How did the colors and tones in your composition affect the viewer's perception? • In what ways did you find flow in your images, and how can you improve it in future shoots? 📚 Related Reading Before you start, read these related blog posts to deepen your understanding: • → Finding Your Compositional Balance • → How To Improve Your Photography Composition • → Composition In Photography • → Mastering Photography Composition Rules For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus. Alan Ranger23 November 2025Composition & Creative LinkedIn0 Pinterest0",
  "wordCount": 754,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/visual-weight-and-flow-practice-assignment#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/visual-weight-and-flow-practice-assignment#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}