{
  "@context": "https://schema.org",
  "@graph": [
    {
      "@type": "WebPage",
      "@id": "https://www.alanranger.com/blog-on-photography/what-is-white-balance-in-photography#webpage",
      "url": "https://www.alanranger.com/blog-on-photography/what-is-white-balance-in-photography",
      "name": "11 What is WHITE BALANCE in photography: A Beginners Guide",
      "description": "Updated 25 Aug 2025WHITE — , TRUEOrange indoor shots, blue-looking shade, sickly green from LEDs—these aren’t “bad cameras,” they’re white balance issues.",
      "inLanguage": "en-GB",
      "isPartOf": {
        "@id": "https://www.alanranger.com#website"
      },
      "primaryImageOfPage": {
        "@id": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1722798718583-WQL4FJX135PNK0Y8CV37/what+is+white+balance+in+photography-3.jpg"
      }
    },
    {
      "@type": "BreadcrumbList",
      "@id": "https://www.alanranger.com/blog-on-photography/what-is-white-balance-in-photography#breadcrumb",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://www.alanranger.com"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Blog",
          "item": "https://www.alanranger.com/blog-on-photography"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "11 What is WHITE BALANCE in photography: A Beginners Guide",
          "item": "https://www.alanranger.com/blog-on-photography/what-is-white-balance-in-photography"
        }
      ]
    },
    {
      "@type": "BlogPosting",
      "@id": "https://www.alanranger.com/blog-on-photography/what-is-white-balance-in-photography#blogposting",
      "headline": "11 What is WHITE BALANCE in photography: A Beginners Guide",
      "alternativeHeadline": "11 What is WHITE BALANCE in photography: A Beginners Guide | Alan Ranger Photography",
      "description": "Updated 25 Aug 2025WHITE — , TRUEOrange indoor shots, blue-looking shade, sickly green from LEDs—these aren’t “bad cameras,” they’re white balance issues.",
      "url": "https://www.alanranger.com/blog-on-photography/what-is-white-balance-in-photography",
      "mainEntityOfPage": {
        "@type": "WebPage",
        "@id": "https://www.alanranger.com/blog-on-photography/what-is-white-balance-in-photography#webpage"
      },
      "datePublished": "2025-03-20T00:00:00+00:00",
      "dateCreated": "2025-03-20T00:00:00+00:00",
      "dateModified": "2025-03-20T00:00:00+00:00",
      "inLanguage": "en-GB",
      "articleBody": "11 WHAT IS WHITE BALANCE IN PHOTOGRAPHY: A BEGINNERS GUIDEUpdated 25 Aug 2025WHITE BALANCE — KILL COLOUR CASTS, KEEP SKIN TONES TRUEOrange indoor shots, blue-looking shade, sickly green from LEDs—these aren’t “bad cameras,” they’re white balance issues. This post explains how WB interprets the colour of light (temperature in Kelvin + tint), and gives you a simple workflow to get neutrals neutral—or bias colour on purpose. * What WB is: the camera’s colour interpretation of the light source (e.g., tungsten ≈ 3000 K, daylight ≈ 5500–6500 K, shade ≈ 7000–8000 K) plus a green–magenta tint correction. * How to set it: Auto WB, presets (Daylight/Shade/Tungsten/Fluoro), Kelvin for precise control, or Custom WB using a grey card/ExpoDisc—especially for consistent skin tones. * When to fix it: Shoot RAW for full latitude and correct in post with the WB eyedropper; for JPEG or fast delivery, set WB accurately in-camera under consistent light.3 key takeaways 1. Neutral first, creative second: establish a clean reference (grey card or reliable preset), then bias warmer/cooler to taste. 2. Match the key light: in mixed lighting, balance for the light that matters to your subject; control the rest (gels, turn off, or correct locally in post). 3. RAW = freedom: WB isn’t baked in for RAW—fix quickly with the eyedropper and tint slider; for JPEG, get it right in-camera.Table of Contents Show----------------------------------------WHAT IS WHITE BALANCE IN PHOTOGR bject; control the rest (gels, turn off, or correct locally in post). 3. RAW = freedom: WB isn’t baked in for RAW—fix quickly with the eyedropper and tint slider; for JPEG, get it right in-camera.Table of Contents Show----------------------------------------WHAT IS WHITE BALANCE IN PHOTOGRAPHY?Are you tired of inaccurate colours in your images? Understanding what is white balance in photography is the key to achieving vibrant and realistic results. In this article, we will explore the concept of white balance and its importance in photography.White balance refers to the colour temperature of light, which affects the overall colour cast in an image. It helps ensure that whites appear white, regardless of the lighting conditions. By adjusting the white balance, photographers can capture accurate and pleasing colours.Different lighting conditions have different colour temperatures. Daylight white balance tends to be cool and bluish, while indoor lighting like tungsten white balance can be warm and yellowish. Understanding the white balance allows photographers to compensate for these colour balance shifts and achieve accurate colour reproduction.Whether you're a professional photographer or a hobbyist, mastering white balance examples will significantly improve the quality of your images. Join us as we dive deep into the world of white balance and unlock the secrets to achieving stunning and lifelike photographs.So, grab your camera, check your camera settings, and get ready to enhance your skills with the power of white balance!UNDERSTANDING WHITE BALANCEWhite balance (WB) is a critical component in photography that adjusts colours to match the true white under different natural lighting conditions. When the white balance is correctly set using the white balance chart or Kelvin scale photography, it ensures colours are natural and accurate to what the human eye perceives in real life.In the heart of every photograph, the light plays a leading role. The colour temperature kelvin of light sources can vary significantly, from the warm glow of a setting sun to the cool shade under an overcast sky. White balance helps in neutralising these colour casts, ensuring that objects which appear white in person are rendered white in your images.Mastering white balance kelvin also means understanding the impact of light's correlated colour temperature, measured in Kelvin (K). Lower Kelvin values like colour temperature 2700k represent warmer, yellowish colours, while higher Kelvin values indicate cooler, bluish tones. By adjusting the white balance, photographers can either correct or creatively alter the mood of their images.DIFFERENT TYPES OF WHITE BALANCE SETTINGSMost digital cameras offer a variety of preset white balances to accommodate different lighting scenarios. These include Auto White Balance (AWB), Daylight, Cloudy, Shade, Tungsten, Fluorescent, and Flash, among custom settings where photographers can manually set the colour temperature chart.Auto White Balance is often reliable in general conditions, adjusting the white balance automatically based on the incident light conditions. However, for more control or in challenging lighting, selecting a preset or custom setting can yield better results.Custom White Balance (CWB) is the pinnacle of control, allowing photographers to calibrate their camera settings to the specific lighting conditions of a scene. This is done by taking a photo of a white or gra r in challenging lighting, selecting a preset or custom setting can yield better results.Custom White Balance (CWB) is the pinnacle of control, allowing photographers to calibrate their camera settings to the specific lighting conditions of a scene. This is done by taking a photo of a white or gray reference card and setting that as the benchmark for true white. CWB can significantly enhance colour accuracy in your images, especially in scenes with multiple illuminants.THE IMPORTANCE OF CORRECT WHITE BALANCE✓ DO * Match the key light: choose a preset/Kelvin for the light illuminating your subject. * Use a neutral reference (grey card/ExpoDisc) for Custom WB when colour accuracy matters. * Shoot RAW to adjust temperature and tint later without quality loss. * Check skin tones and neutrals; fine-tune Tint (G↔M) as well as Temperature (K). * Control mixed light: switch off, gel, or local-correct with masks in post.✗ DON’T * Don’t leave AWB on for everything—it can drift or fail in mixed/coloured lighting. * Don’t rely on Temperature only; ignoring Tint often leaves green/magenta casts. * Don’t move from daylight to tungsten (or shade to sun) without updating WB. * Don’t try to globally fix mixed light with one slider—use local tools or gels. * Don’t bake critical colour as JPEG if unsure—prefer RAW or set a custom WB in-camera.Tip: establish a neutral baseline first, then warm/cool creatively for mood.Correct white balance is vital for achieving photographs that accurately reflect the scene you're capturing. Incorrect white balance can lead to images with an unnatural colour cast, making them appear too warm light source (orange or yellow) or too cool light source (blue), detracting from the visual appeal and realism.Moreover, white balance affects the colour harmony in your images. True-to-life colours contribute to a more cohesive and aesthetically pleasing photograph. Especially in genres like portraiture, product photography, or fine art, where colour accuracy is paramount, mastering white balance is essential.Understanding and utilising white balance not only improves image quality but also reduces post-processing work. Achieving the right white balance in-camera means less time correcting colours in editing software, allowing more time for creative enhancements rather than basic corrections. This is especially important when shooting in JPEG format, as JPEG files have less flexibility for colour balance adjustment compared to RAW files.COMMON WHITE BALANCE MISTAKES TO AVOIDOne of the most common mistakes is overlooking the white balance setting, leaving it on Auto White Balance in every situation. While AWB works well in many conditions, it can struggle in mixed lighting or more complex environments.Another mistake is not adjusting the white balance when moving between different lighting conditions. For example, shooting outdoors in daylight white balance and then moving indoors without changing the white balance can result in inaccurately coloured images.Failing to customise the white balance in particularly tricky lighting conditions, such as scenes dominated by a single colour or under artificial lighting like fluorescent or tungsten white balance, can also lead to poor colour rendition. It's essential to evaluate and adjust the white balance whenever the lighting scenario changes significantly.HOW TO ADJUST WHITE BALANCE IN-CAMERAAdjusting the white balance in-camera involves selecting t ghting like fluorescent or tungsten white balance, can also lead to poor colour rendition. It's essential to evaluate and adjust the white balance whenever the lighting scenario changes significantly.HOW TO ADJUST WHITE BALANCE IN-CAMERAAdjusting the white balance in-camera involves selecting the appropriate preset based on your lighting situation or setting a custom white balance. To select a preset, navigate to your camera settings for white balance and choose the option that matches your environment, such as Daylight, Cloudy, or Tungsten.For custom white balance, you'll need to photograph a neutral reference, like a white balance card, under the same lighting conditions as your subject. Then, follow your camera's instructions to set this image as the reference point for white balance. This method allows for precise colour balance correction tailored to your specific shooting conditions.HOW TO SET WHITE BALANCE (PRESETS, KELVIN & CUSTOM) 1. Prep: shoot RAW (max latitude) and pick a neutral picture profile. If colour-critical, keep a grey card handy. 2. Choose your method (from quick → precise): * Auto WB (AWB): fine for changing daylight; can drift in mixed/coloured light. * Presets: fast and consistent. * Daylight: 5200–5600 K * Cloudy: 6000–6500 K * Shade: 7000–8000 K * Tungsten/Incandescent: 2800–3200 K * Fluorescent: 3800–4500 K (often needs +magenta tint) * Flash: 5500–6000 K * Kelvin (K): enable Temp/K on the camera, dial until neutrals look neutral in live view; then nudge Tint (G↔M) if needed. Good starting points are above. * Custom WB (grey card / ExpoDisc): 1. Place the card in your key light (same light as your subject). 2. Fill the frame with the card and capture a reference. 3. Run Custom WB in the menu and assign it to a slot. 4. Use that WB for all shots under the same lighting. 3. Handle mixed light: balance for the key light, then tame the rest (turn off, gel flash to match ambient, or correct locally in post with masks). 4. Verify quickly: check skin tones and a known neutral (shirt, card, wall). If it looks green/magenta, adjust Tint, not just Temperature. 5. In post (RAW): use the WB eyedropper on a neutral, fine-tune Temp/Tint; for scenes lit by different sources, apply local WB per area.Tip: shoot a quick grey-card frame whenever the light changes. It’s a perfect anchor for consistent white balance across a set.WHITE BALANCE IN POST-PROCESSINGPost-processing software like Adobe Lightroom and Photoshop offers powerful tools for adjusting white balance after the fact. These tools can be invaluable, especially if the white balance wasn't correctly set in-camera or if you're working with RAW files, which retain much more information for adjustment compared to JPE files.The white balance selector tool, often represented by an eyedropper, allows you to click on a neutral reference grey or white area in your image to automatically adjust the white balance. For more fine-tuned adjustments, colour temperature kelvin and tint sliders enable you to manually correct or creatively alter the white balance.Post-processing is also an opportunity to explore creative white balance adjustments. While it's important to achieve natural-looking colours, altering the white balance can help convey a specific mood or atmosphere, enhancing the storytelling aspect of your photography. However, be cautious not to overdo the adjustments, an opportunity to explore creative white balance adjustments. While it's important to achieve natural-looking colours, altering the white balance can help convey a specific mood or atmosphere, enhancing the storytelling aspect of your photography. However, be cautious not to overdo the adjustments, as extreme changes can result in an unnatural or unappealing colour spectrum.CONCLUSION: WHAT IS WHITE BALANCEMastering camera white balance is a fundamental aspect of photography that can dramatically improve the quality of your images. Whether you're adjusting settings in-camera or fine-tuning colours in post-processing, understanding what colour temperature is and how it relates to white balance is crucial for achieving realistic and visually appealing photographs.By familiarising yourself with different white balance settings, recognising common mistakes, and utilising the right tools and techniques, you'll be well on your way to capturing stunning images that accurately reflect the beauty of the world around you.So, embrace the power of white balance and let it transform your photography into a true reflection of reality infused with your artistic vision. With a solid understanding of white balance explained** and the creative possibilities it offers, you'll be able to create images that captivate and inspire.FIX COLOUR CASTS FAST: WHITE BALANCE FIELD GUIDEDownload the 1-page White Balance Field Checklist for Kelvin, tint, presets & custom WB.Download White Balance Checklist (PDF) Image Reviews Clinic (Zoom, £29) 1-to-1 Zoom Help Prefer a text link? Download the checklist here ----------------------------------------FAQS ON WHITE BALANCE IN PHOTOGRAPHYQ1: What is white balance in photography?A1: White balance (WB) is a camera setting that adjusts the colours in your photos to make them appear as natural and accurate as possible. It compensates for the colour temperature of the light source, ensuring that white objects appear white in the final image and that colours remain true to life.Q2: Why is white balance important?A2: White balance is crucial because different lighting conditions (like daylight, tungsten, or fluorescent light) can cast different colour tints (warm or cool) in photographs. Proper white balance helps maintain colour consistency and can greatly enhance the aesthetic quality of images.Q3: How does colour temperature relate to white balance?A3: Colour temperature, measured in Kelvin (K), describes the hue of light emitted by a source. Lower Kelvin values (like 2500K) are associated with warmer, more yellow lights, while higher values (like 8000K) represent cooler, bluer lights. White balance settings help correct these temperature dis",
      "wordCount": 2189,
      "timeRequired": "PT11M",
      "readingTime": "PT11M",
      "genre": "Photography Guide",
      "articleSection": "Technical Foundations",
      "keywords": [
        "camera settings for photography"
      ],
      "learningResourceType": "Guide",
      "educationalLevel": "Beginner",
      "proficiencyLevel": "Beginner",
      "typicalAgeRange": "18-99",
      "educationalUse": "Learning",
      "estimatedCost": {
        "@type": "MonetaryAmount",
        "currency": "GBP",
        "value": "0"
      },
      "audience": {
        "@type": "EducationalAudience",
        "educationalRole": "Photographer",
        "audienceType": "Student"
      },
      "educationalAlignment": {
        "@type": "AlignmentObject",
        "alignmentType": "educationalFramework",
        "educationalFramework": "Photography Skills",
        "targetName": "Beginner"
      },
      "about": [
        {
          "@type": "Thing",
          "name": "Adobe Lightroom"
        }
      ],
      "mentions": [
        {
          "@type": "Thing",
          "name": "Lightroom"
        }
      ],
      "hasPart": [],
      "image": {
        "@type": "ImageObject",
        "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1722798718583-WQL4FJX135PNK0Y8CV37/what+is+white+balance+in+photography-3.jpg",
        "width": 1500,
        "height": 1000,
        "caption": "11 What is WHITE BALANCE in photography: A Beginners Guide"
      },
      "thumbnailUrl": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1722798718583-WQL4FJX135PNK0Y8CV37/what+is+white+balance+in+photography-3.jpg",
      "primaryImageOfPage": {
        "@id": "https://www.alanranger.com/blog-on-photography/what-is-white-balance-in-photography#webpage"
      },
      "speakable": {
        "@type": "SpeakableSpecification",
        "xpath": [
          "/html/head/title",
          "//h1"
        ],
        "cssSelector": [
          "h1",
          ".intro"
        ]
      },
      "discussionUrl": "https://www.alanranger.com/blog-on-photography/what-is-white-balance-in-photography#comments",
      "author": {
        "@type": "Person",
        "@id": "https://www.alanranger.com/#alanranger",
        "name": "Alan Ranger",
        "url": "https://www.alanranger.com/about-alan-ranger",
        "jobTitle": "Photographer & Photography Educator",
        "sameAs": [
          "https://www.alanranger.com",
          "https://www.linkedin.com/in/alanrangerphotography"
        ]
      },
      "publisher": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography",
        "url": "https://www.alanranger.com",
        "logo": {
          "@type": "ImageObject",
          "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/b859ad2b-1442-4595-b9a4-410c32299bf8/ALAN+RANGER+photography+LOGO+BLACK.+switched+small.png?format=1500w",
          "width": 300,
          "height": 100
        }
      },
      "isPartOf": {
        "@type": "WebSite",
        "@id": "https://www.alanranger.com/#website"
      },
      "copyrightHolder": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography"
      },
      "copyrightYear": 2025,
      "sameAs": [
        "https://www.alanranger.com/blog-on-photography"
      ],
      "relatedLink": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "subjectOf": {
        "@type": "Blog",
        "@id": "https://www.alanranger.com/blog-on-photography#blog"
      },
      "isRelatedTo": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "funding": {
        "@type": "MonetaryGrant",
        "funder": {
          "@type": "Organization",
          "name": "Alan Ranger Photography"
        }
      },
      "interactionStatistic": {
        "@type": "InteractionCounter",
        "interactionType": "https://schema.org/CommentAction",
        "userInteractionCount": 0
      },
      "commentCount": 0
    }
  ]
}