{
  "@context": "https://schema.org",
  "@graph": [
    {
      "@type": "WebPage",
      "@id": "https://www.alanranger.com/blog-on-photography/what-is-focal-length-in-photography#webpage",
      "url": "https://www.alanranger.com/blog-on-photography/what-is-focal-length-in-photography",
      "name": "15 What is FOCAL LENGTH in photography: A Beginners Guide",
      "description": "Updated 26 Aug 2025FOCAL — , & LOOKThe problem: 24 mm vs 85 mm “feel” wildly different.",
      "inLanguage": "en-GB",
      "isPartOf": {
        "@id": "https://www.alanranger.com#website"
      },
      "primaryImageOfPage": {
        "@id": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1723043869177-6Z5KZF0SZHUR75Z8GTMR/What+is+focal+length+in+photography-2-2.jpg"
      }
    },
    {
      "@type": "BreadcrumbList",
      "@id": "https://www.alanranger.com/blog-on-photography/what-is-focal-length-in-photography#breadcrumb",
      "itemListElement": [
        {
          "@type": "ListItem",
          "position": 1,
          "name": "Home",
          "item": "https://www.alanranger.com"
        },
        {
          "@type": "ListItem",
          "position": 2,
          "name": "Blog",
          "item": "https://www.alanranger.com/blog-on-photography"
        },
        {
          "@type": "ListItem",
          "position": 3,
          "name": "15 What is FOCAL LENGTH in photography: A Beginners Guide",
          "item": "https://www.alanranger.com/blog-on-photography/what-is-focal-length-in-photography"
        }
      ]
    },
    {
      "@type": "BlogPosting",
      "@id": "https://www.alanranger.com/blog-on-photography/what-is-focal-length-in-photography#blogposting",
      "headline": "15 What is FOCAL LENGTH in photography: A Beginners Guide",
      "alternativeHeadline": "15 What is FOCAL LENGTH in photography: A Beginners Guide | Alan Ranger Photography",
      "description": "Updated 26 Aug 2025FOCAL — , & LOOKThe problem: 24 mm vs 85 mm “feel” wildly different.",
      "url": "https://www.alanranger.com/blog-on-photography/what-is-focal-length-in-photography",
      "mainEntityOfPage": {
        "@type": "WebPage",
        "@id": "https://www.alanranger.com/blog-on-photography/what-is-focal-length-in-photography#webpage"
      },
      "datePublished": "2025-04-29T00:00:00+00:00",
      "dateCreated": "2025-04-29T00:00:00+00:00",
      "dateModified": "2025-04-29T00:00:00+00:00",
      "inLanguage": "en-GB",
      "articleBody": "15 WHAT IS FOCAL LENGTH IN PHOTOGRAPHY: A BEGINNERS GUIDEUpdated 26 Aug 2025FOCAL LENGTH — CONTROL PERSPECTIVE, FRAMING & BACKGROUND LOOKThe problem: 24 mm vs 85 mm “feel” wildly different. Mixing up focal length, perspective, and crop factor leads to warped faces, weak compositions, and background chaos. Zooming your feet vs zooming the lens isn’t the same—and that’s where most shots go wrong.This post solves it: You’ll learn what focal length really is, how it changes angle of view, influences the background size/blur for the same framing, and how sensor size (crop factor) affects your lens choices—so you pick the right focal length on purpose.3 key takeaways 1. Angle of view: shorter focal lengths include more scene; longer focal lengths narrow the view and magnify the background for the same framing. 2. Perspective = camera position: move your feet to change shape relationships; changing focal length without moving only crops/widens the view. 3. Crop factor: to compare framing, use focal length × crop (APS-C≈1.5×, MFT≈2×); DoF equivalence for the same framing needs a higher f-number on smaller sensors.Table of Contents Show----------------------------------------INTRODUCTION TO WHAT IS FOCAL LENGTH IN PHOTOGRAPHYUnderstanding what focal length is in photography significantly influences the visual outcome of an image. The focal length is the distance between the lens and the point where light converges, which determines perspective, compositi -----------INTRODUCTION TO WHAT IS FOCAL LENGTH IN PHOTOGRAPHYUnderstanding what focal length is in photography significantly influences the visual outcome of an image. The focal length is the distance between the lens and the point where light converges, which determines perspective, composition, and overall aesthetic. Understanding the focal length explained is crucial for photographers of all levels. The lens focal length measures the distance between the lens and the point where light converges. This interplay between optics and physics shapes the angle of view of photography. This guide explores the focal length's intricacies, impact on genres, and creative possibilities. Gain a profound understanding to elevate your photographic prowess.WHAT IS FOCAL LENGTH AND HOW DOES IT AFFECT YOUR PHOTOS?The focal length definition, measured in millimetres, defines a camera lens's optical characteristics and angle of view. A shorter focal length, like a wide-angle lens, captures a broader field of view, ideal for landscapes, interiors, or group shots. A longer focal length, like a telephoto lens, narrows the angle of view, useful for isolating subjects or freezing action. The focal length formula also affects depth of field, with shorter lengths providing greater sharpness and longer lengths producing background blur. Understanding the focal length equation helps photographers choose lenses and compose images that align with their artistic vision.DIFFERENT TYPES OF LENSES AND THEIR FOCAL LENGTHSFOCAL LENGTH & LENS TYPES — ANGLE OF VIEW, USES & TIPSLens type Typical focal length (FF) Approx. diagonal AoV Look / perspective Best for (examples) Handy tips Fisheye 8–15 mm ~180° Extreme bend/curvature; huge coverage. Creative interiors, skies, tight spaces. Keep horizons central to limit bend; watch your feet/ tripod legs. Ultra-wide 14–20 mm 114–94° Exaggerates scale; pulls foreground close. Architecture, interiors, dramatic landscapes. Level the camera to avoid keystoning or correct in post; mind edge distortion. Wide-angle 24–35 mm 84–63° Broad view; context with moderate depth. Landscape, environmental portraits, street. Use strong foregrounds/leading lines; watch edge stretch at 24 mm. Normal / Standard 40–58 mm ~50–40° Natural perspective; unobtrusive look. Everyday, travel, documentary, 50 mm portraits. Great learning lens; zoom with your feet to set perspective first. Short telephoto 70–105 mm 34–20° Flattering faces; gentle background magnification. Portraits, detail studies, compressing scenes. Mind shutter speed for shake (~1/(focal length × crop)); use IBIS/OS. Telephoto 135–300 mm 18–8° Strong “compression”; isolates subjects. Events, stage, distant landscapes, pets. Use monopod/tripod; background blur increases with distance + longer FL. Super-tele 400–600 mm+ ~6–4° Very tight FoV; heavy background magnification. Wildlife, birds, field sports, moon. Track craft: high shutter, good support, pre-focus where action happens. Macro (1:1) 90–105 mm (also 60 / 150–200) As per FL True life-size close-up; razor-thin DoF. Insects, textures, product details. Stop down; use flash/diffusion; focus rail helps for stacking. Zooms (examples) 16–35, 24–70, 70–200 Varies Flexibility across multiple looks. Travel, weddings, run-and-gun coverage. Use ends for distinct styles (24 for story, 200 for isolation); learn your sweet spots.Notes: Angles shown are for full-frame (35 mm). For APS-C, multiply focal length by ~1.5× (Canon 1.6×). es) 16–35, 24–70, 70–200 Varies Flexibility across multiple looks. Travel, weddings, run-and-gun coverage. Use ends for distinct styles (24 for story, 200 for isolation); learn your sweet spots.Notes: Angles shown are for full-frame (35 mm). For APS-C, multiply focal length by ~1.5× (Canon 1.6×). For Micro 4/3, ~2×. Perspective depends on camera position; focal length mainly changes angle of view.Telephoto Lens - 70-600mmZoom lens 24-70mmWide-Angle 16-35mmTelephoto Lens - 70-200mmMacro Lens 100mDesigned for versatility - Walkabout Lens 24-105mm----------------------------------------BUYING ADVICE - WHAT IS FOCAL LENGTH IN PHOTOGRAPHYI will cover this topic in more detail in an upcoming - “Hiring camera lenses or buy new or secondhand ”. Please wait for this before rushing out thinking you need to buy x, y or z lenses to cover your interests. If you do need a lens urgently I recommend hiring for a period rather than buying. Lenslab has a vast array of choices to suit all camera brands, types and needs and provides excellent customer service.UNDERSTANDING THE CONCEPT OF PERSPECTIVE IN PHOTOGRAPHYPerspective in photography is linked to focal length. Wide-angle lenses exaggerate foreground objects, creating depth and immersion. Telephoto lenses compress distance, flattening the perspective. Understanding perspective is crucial for controlling the visual narrative and evoking emotional responses.FOCAL LENGTH AND ITS IMPACT ON COMPOSITIONQUICK TIPS — FOCAL LENGTH & COMPOSITION * Set perspective first: move your feet to the best camera position, then pick a focal length to frame it. * Control background size: longer focal lengths magnify the background for the same subject size; wide lenses make it feel smaller. * Use foreground with wides: get close to a strong near object to add depth and exaggerate leading lines. * Use teles to simplify: step back and zoom in to remove clutter, stack layers, and isolate subjects. * Mind edge stretch: keep faces and verticals away from frame edges at 24–28 mm; keep the camera level to reduce keystoning. * Balance negative space: wide = breathing room and context; tele = tighter, subject-led balance. * Keep it sharp: hand-held shutter ≈ 1/(focal length × crop); stabilisation or support helps at 100 mm+. * Perspective ≠ focal length: only changing position alters perspective; zooming in/out just crops or widens the view.Wide-angle (14–35 mm) * Include environment & strong foregrounds * Exaggerate depth & converging lines * Great for landscapes, interiors, streetTelephoto (85–300 mm+) * Compress layers; larger-looking backgrounds * Clean up edges; remove distractions * Great for portraits, details, wildlifeComposition is the artful arrangement of visual elements within the frame, and focal length plays a pivotal role in shaping the compositional possibilities of an image. By understanding the relationship between focal length and composition, photographers can unlock new creative avenues and elevate their storytelling abilities. 1. Framing and subject placement: The choice of focal length directly influences the framing and subject placement within the composition. Wide-angle lenses allow for the inclusion of more environmental context, making them ideal for capturing expansive scenes or emphasising foreground elements. Conversely, telephoto lenses enable the isolation of subject gth directly influences the framing and subject placement within the composition. Wide-angle lenses allow for the inclusion of more environmental context, making them ideal for capturing expansive scenes or emphasising foreground elements. Conversely, telephoto lenses enable the isolation of subjects, facilitating the creation of intimate portraits or extracting intricate details from a larger scene. 2. Depth perception and layering: Focal length plays a crucial role in shaping the perception of depth and layering within a composition. Wide-angle lenses exaggerate the distance between foreground and background elements, creating a sense of depth and dimensionality. Telephoto lenses, on the other hand, compress the perceived distance, flattening the perspective and allowing for the seamless integration of multiple layers within the frame. 3. Leading lines and visual flow: The angle of view captured by different focal lengths can significantly impact the presence and effectiveness of leading lines within a composition . Wide-angle lenses can enhance the prominence of converging lines, guiding the viewer's eye through the frame, while telephoto lenses can isolate and emphasise specific lines or patterns, creating a more focused visual narrative. 4. Negative space and balance: The choice of focal length influences the balance and negative space within a composition. Wide-angle lenses can create a sense of expansiveness , allowing for the incorporation of negative space as a compositional element. Telephoto lenses, conversely, can compress the scene, minimising negative space and creating a more intimate, subject-focused composition.By understanding the compositional implications of focal length, photographers can make informed decisions that align with their creative vision, crafting visually compelling images that captivate and engage the viewer.CHOOSING THE RIGHT FOCAL LENGTH FOR DIFFERENT PHOTOGRAPHY GENRESQUICK TIPS — CHOOSE THE RIGHT FOCAL LENGTH BY GENRE * Landscape — 24–35 mm for context; 70–200 mm to isolate forms and compress layers. Wide (<24 mm) only when a strong foreground anchors the frame. * Portraits — 50–85 mm for half/three-quarter; 85–135 mm for headshots and background blur. Keep subjects away from edges at wider FLs. * Street / Documentary — 28–35 mm for environmental context; 40–50 mm for a natural look without distortion. Prime keeps you light and fast. * Sports / Action — 70–200 mm sideline all-rounder; 300–400 mm+ for field sports. Pair with fast shutter and support (monopod/IBIS). * Macro — 90–105 mm (or 60 mm close-working) for 1:1 detail. Stop down, add light (flash/diffuser), and consider focus rail/stacking. * Wildlife / Birds — 400–600 mm+ for reach; use higher shutters and pre-focus on perches/flight paths to improve hit-rate. * Travel / Events — 24–70 mm covers scenes + people; add 70–200 mm for stage or candid compression. * Architecture / Interiors — 16–24 mm to fit space; keep camera level or use a tilt-shift to manage verticals.Notes: Focal length sets angle of view; perspective comes from camera position. On APS-C multiply by ~1.5× (Canon 1.6×), on Micro 4/3 by ~2× to get full-frame equivalents. There’s no hard rule—pick the focal length that best supports the picture idea.Each photographic genre presents its own unique challenges and creative demands, and the choice of focal length plays a cr ion. On APS-C multiply by ~1.5× (Canon 1.6×), on Micro 4/3 by ~2× to get full-frame equivalents. There’s no hard rule—pick the focal length that best supports the picture idea.Each photographic genre presents its own unique challenges and creative demands, and the choice of focal length plays a crucial role in achieving the desired visual outcome. By understanding the strengths and limitations of different focal lengths, photographers can make informed decisions that align with their artistic goals. 1. Landscape photography: For breathtaking landscape shots, wide-angle lenses are often the assumed choice. Their expansive field of view allows for the capture of vast scenes, emphasising the grandeur of natural environments. Focal lengths ranging from 14mm to 24mm are commonly used, enabling photographers to encompass sweeping vistas and create a sense of immersion. However, as a landscape shooter I rarely shoot with less than 24mm focal length and frequently use a 70-200mm focal length to isolate and frame my subject in the landscape environment. Therefore, no rule relates to focal lengths in the landscape; it is just the right focal length to do the job and create the aesthetics desired. 2. Portrait photography: When it comes to portraiture, focal lengths between 50mm and 135mm are widely favoured. These lenses provide a natural perspective, minimizing distortion and ensuring flattering representations of facial features. Longer focal lengths, such as 85mm or 135mm, create a pleasing background blur, allowing for subject isolation and enhanced depth perception. 3. Street photography: The dynamic and spontaneous nature of street photography often calls for versatile focal lengths. Prime lens in the 35mm to 50mm range offer a natural perspective, while wider focal lengths, like 24mm or 28mm, can capture environmental context and create a sense of immersion in urban settings. 4. Sports and action photography: In the fast-paced world of sports and action photography, telephoto lenses reign supreme. Focal lengths ranging from 70mm to 400mm or beyond allow photographers to capture subjects from a safe distance, freeze motion, and isolate the action from the surrounding environment. 5. Macro photography: For exploring the intricate details of the natural world, macro lenses are indispensable. These specialised lenses, typically ranging from 60mm to 110mm, enable photographers to capture life-size or greater magnifications, revealing the intricate textures and patterns that often go unnoticed by the naked eye. 6. Wildlife photography: Super-telephoto lenses are the go-to choice when photographing elusive and often distant subjects in their natural habitats. Focal lengths of 400mm, 500mm, or even 600mm and beyond allow photographers to capture intimate moments without disturbing or disrupting the subjects' natural behaviour.By understanding the unique demands of each photographic genre, photographers can make informed decisions about lens selection, maximising the creative potential of their equipment and capturing images that resonate with their artistic vision.PRACTICAL TIPS FOR USING DIFFERENT FOCAL LENGTHSMASTER FOCAL LENGTH CHOICES IN THE FIELDDownload the 1-page field checklist with perspective tips, angle of view, and on-location drills.Download Focal Length Checklist (PDF) [https://www.alanranger.com/s/Focal_Length_Field_Checklist.pdf?utm_source=utm_source%3Dblog&utm_medium=utm_medium%3Dcta&utm_campaign=utm_cam",
      "wordCount": 2220,
      "timeRequired": "PT11M",
      "readingTime": "PT11M",
      "genre": "Photography Guide",
      "articleSection": "Technical Foundations",
      "keywords": [
        "camera settings for photography",
        "sharp photos",
        "sharpness”",
        "“focus”",
        "“camera shake”",
        "“tripod”",
        "“shutter speed"
      ],
      "learningResourceType": "Guide",
      "educationalLevel": "Beginner",
      "proficiencyLevel": "Beginner",
      "typicalAgeRange": "18-99",
      "educationalUse": "Learning",
      "estimatedCost": {
        "@type": "MonetaryAmount",
        "currency": "GBP",
        "value": "0"
      },
      "audience": {
        "@type": "EducationalAudience",
        "educationalRole": "Photographer",
        "audienceType": "Student"
      },
      "educationalAlignment": {
        "@type": "AlignmentObject",
        "alignmentType": "educationalFramework",
        "educationalFramework": "Photography Skills",
        "targetName": "Beginner"
      },
      "about": [
        {
          "@type": "Thing",
          "name": "Shutter speed"
        },
        {
          "@type": "Thing",
          "name": "Photographic composition"
        },
        {
          "@type": "Thing",
          "name": "Landscape photography"
        }
      ],
      "mentions": [],
      "hasPart": [],
      "image": {
        "@type": "ImageObject",
        "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1723043869177-6Z5KZF0SZHUR75Z8GTMR/What+is+focal+length+in+photography-2-2.jpg",
        "width": 1500,
        "height": 1000,
        "caption": "15 What is FOCAL LENGTH in photography: A Beginners Guide"
      },
      "thumbnailUrl": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/1723043869177-6Z5KZF0SZHUR75Z8GTMR/What+is+focal+length+in+photography-2-2.jpg",
      "primaryImageOfPage": {
        "@id": "https://www.alanranger.com/blog-on-photography/what-is-focal-length-in-photography#webpage"
      },
      "speakable": {
        "@type": "SpeakableSpecification",
        "xpath": [
          "/html/head/title",
          "//h1"
        ],
        "cssSelector": [
          "h1",
          ".intro"
        ]
      },
      "discussionUrl": "https://www.alanranger.com/blog-on-photography/what-is-focal-length-in-photography#comments",
      "author": {
        "@type": "Person",
        "@id": "https://www.alanranger.com/#alanranger",
        "name": "Alan Ranger",
        "url": "https://www.alanranger.com/about-alan-ranger",
        "jobTitle": "Photographer & Photography Educator",
        "sameAs": [
          "https://www.alanranger.com",
          "https://www.linkedin.com/in/alanrangerphotography"
        ]
      },
      "publisher": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography",
        "url": "https://www.alanranger.com",
        "logo": {
          "@type": "ImageObject",
          "url": "https://images.squarespace-cdn.com/content/v1/5013f4b2c4aaa4752ac69b17/b859ad2b-1442-4595-b9a4-410c32299bf8/ALAN+RANGER+photography+LOGO+BLACK.+switched+small.png?format=1500w",
          "width": 300,
          "height": 100
        }
      },
      "isPartOf": {
        "@type": "WebSite",
        "@id": "https://www.alanranger.com/#website"
      },
      "copyrightHolder": {
        "@type": "Organization",
        "@id": "https://www.alanranger.com#organization",
        "name": "Alan Ranger Photography"
      },
      "copyrightYear": 2025,
      "sameAs": [
        "https://www.alanranger.com/blog-on-photography"
      ],
      "relatedLink": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "subjectOf": {
        "@type": "Blog",
        "@id": "https://www.alanranger.com/blog-on-photography#blog"
      },
      "isRelatedTo": [
        {
          "@type": "WebPage",
          "url": "https://www.alanranger.com/blog-on-photography"
        }
      ],
      "funding": {
        "@type": "MonetaryGrant",
        "funder": {
          "@type": "Organization",
          "name": "Alan Ranger Photography"
        }
      },
      "interactionStatistic": {
        "@type": "InteractionCounter",
        "interactionType": "https://schema.org/CommentAction",
        "userInteractionCount": 0
      },
      "commentCount": 0
    }
  ]
}