{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/what-is-still-life-photography#blogposting",
  "headline": "What is STILL LIFE PHOTOGRAPHY: A Guide For Beginners",
  "alternativeHeadline": "What is STILL LIFE PHOTOGRAPHY: A Guide For Beginners | Alan Ranger Photography",
  "description": "This guide shows simple set-ups with window light or one light, how to stage objects and backgrounds, and the exposure choices that make textures pop.",
  "url": "https://www.alanranger.com/blog-on-photography/what-is-still-life-photography",
  "datePublished": "2026-01-02T00:00:00.000Z",
  "dateModified": "2026-01-02T00:00:00.000Z",
  "dateCreated": "2026-01-02T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "This guide shows simple set-ups with window light or one light, how to stage objects and backgrounds, and the exposure choices that make textures pop without glare. 3 key takeaways • Light control: Use soft window light or a softbox at ~45°; add a white bounce to lift shadows and a black flag to deepen contrast. Diffuse shiny subjects; avoid mixed white balance. • Composition & styling: Rule of odds, colour harmony, negative space and leading lines. Vary heights, layer textures, watch edge clean-up, and remove distractions to tell a clear story. • Sharpness & exposure: Tripod, base ISO, f/8–f/11, single-point AF or manual focus with magnification. Use a remote/timer, check the histogram to avoid clipping, and bracket when reflective. Table of Contents Show Introduction - What is Still Life Photography? Still life photography captivates with its ability to transform everyday objects into extraordinary works of art. This genre allows photographers to exercise complete control over composition, lighting, and mood, making it a powerful medium for artistic expression and visual storytelling. Through careful arrangement and creative still life photography techniques, still life images can convey deep emotions, cultural significance, and complex narratives. In this comprehensive guide, we'll explore the essential elements of still life photography. Readers will discover the art of lighting to create atmosphere and depth, learn techniques for styling and arranging compelling scenes, and gain insights into post-processing methods to enhance their images. Whether you're a beginner looking to grasp the definition of still-life photography or an experienced photographer aiming to refine your skills, this article offers valuable knowledge to elevate your creative practice and produce captivating still-life photo compositions. Simple soft light + clean styling = pro-looking still life at home. The Art of Lighting in Still Life Photography Lighting plays a crucial role in studio still life photography, shaping the mood, atmosphere, and visual impact of the image. Photographers have the opportunity to exercise complete control over the illumination of their subjects, creating captivating compositions that draw the viewer's eye to specific elements within the frame. Natural light techniques Natural light is often the preferred choice for simple still life photography, especially for beginners. It offers a colour temperature that appears natural to the human eye and can be easily managed through diffusion and bouncing techniques. To harness natural light effectively, photographers should position their subjects near a window, allowing the soft, directional light to illuminate the scene. This approach can create a Vermeer-style window light effect, reminiscent of classic still life photography black and white paintings. To control natural light, photographers can use simple tools such as white fabric to cover the window, diffusing harsh sunlight and creating a softer, more even illumination. Reflectors or bounce cards can be employed to fill in shadows and add depth to the still image. For those seeking a moodier atmosphere, black cards or flags can be used to block light and deepen shadows, creating a chiaroscuro effect reminiscent of Renaissance still shots. Artificial lighting setups When natural light is unavailable or insufficient, artificial lighting becomes essential. Studio setup flashes, continuous LED lights, or even household lamps can be used to create compelling photography still life images. Artificial lighting offers greater control over the direction, intensity, and colour of light, allowing photographers to achieve specific effects regardless of the time of day or weather conditions. A basic artificial lighting setup might include: • A main light source (key light) positioned to the side and slightly above the subject A fill light or reflector to soften shadows A rim light to create highlights and separate the subject from the background For more advanced setups, photographers can experiment with gridded soft boxes, honeycomb grids, and barn doors to shape and direct light precisely. These tools help to control spill and create dramatic fall-offs, isolating the subject and enhancing the overall mood of the still images. Creating mood with light The way light is manipulated in modern still life photography has a direct impact on the mood and tone of the final image. Soft, diffused light can create a bright and airy atmosphere, perfect for summery or fresh compositions like fruit still life photography. Conversely, hard light with deep shadows can evoke a sense of drama and mystery. Backlighting is an effective technique for creating interest and depth in still life images. By positioning the light source behind the subject, photographers can generate attractive highlights and create a bright background without shadows. This approach works particularly well for translucent subjects like glassware or certain types of fruit. Photographers can underexpose their images slightly to achieve a moody, atmospheric look, bringing out contrast and depth. This technique, combined with careful light control using colour gels, modelling light, and atmospheric effects, can transform everyday objects into extraordinary works of art, capturing the essence of still life photography's rich artistic heritage. Quick Tips — Still Life • Keep it simple: choose one hero object and 1–3 supporting props that serve the story. • Light at 45°–90°: soft side/back light; add a white bounce for fill and a black flag to deepen edge contrast. • Matte backgrounds: neutral paper/linen/board to avoid glare and colour casts. • Tripod + base ISO: shoot at f/8–f/11; use a 2-sec timer/remote to keep detail crisp. • Edge discipline: avoid mergers and tight edges; leave breathing room and use negative space. • Control reflections: diffuse shiny items, angle the subject/light, or add a CPL for speculars. • Consistent colour: set Kelvin/custom white balance and keep it the same across the set. • Inspect at 100%: dust, fingerprints, crooked labels—fix on set to save time later. Styling and Arranging Still Life ScenesChoosing complementary objects The art of tabletop photography begins with selecting objects that have a relationship or theme. Photographers often choose recognisable household items or goods, combining them in ways that establish unity or create interesting comparisons. This approach contributes to visual storytelling and enhances the overall composition. When selecting objects, it's crucial to consider a variety of textures. For instance, pairing smooth glass vases with bumpy citrus fruits creates an intriguing contrast, adding depth of field and interest to the image. Creating balance and harmony To achieve a balanced composition, photographers should arrange objects of varying heights. This technique helps guide the viewer's eye through the photo, allowing for emphasis on different elements and creating a more engaging overall composition. One effective approach is to use a mixture of small and large objects or create different levels of platforms the rest of the items upon. Additionally, symmetry plays a vital role in still-life compositions. Photographers can incorporate symmetrical balance by distributing equal visual weight on both sides of a central axis, or opt for asymmetrical balance by using different elements to create equilibrium. Using colour theory Colour harmony is essential for creating visually appealing still-life photos. Understanding basic colour theory principles can help photographers evoke specific emotions and create contrasting effects. Complementary colours, opposite each other on the colour wheel (e.g., red and green), can create strong contrast and visual interest. Analogous colours adjacent to the colour wheel (e.g., red, orange, and yellow) create a sense of harmony and unity. Triadic colours, evenly spaced around the colour wheel (e.g., red, blue, and yellow), can produce a vibrant and dynamic effect. Photographers can enhance the overall impact of their still-life compositions by carefully selecting and arranging objects based on these colour-balance relationships. View fullsize Grab the 1-page Still Life Checklist Download the printable A4 guide with setup, lighting, styling, do/don’t, quick drills and editing tips. Download Still Life Checklist (PDF) 1-to-1 Zoom Help Book the Composition Clinic (£29) Prefer a text link? Download the Still Life Checklist (PDF) Post-Processing Still Life Images Post-production plays a crucial role in elevating still life photographs from good to captivating. It allows photographers to infuse creativity and fine-tuned control into their images. Mastery over tools like Photoshop editing and Lightroom helps breathe life into still life compositions, enhancing their inherent qualities without overshadowing the subject's natural allure. Basic adjustments The editing journey often begins with essential adjustments. Photographers typically start by tweaking exposure settings, which is vital for achieving the desired mood. Contrast adjustment is tactfully increased to accentuate the subject, while white balance is set to align the image's temperature with the artistic vision. These fundamental edits lay the groundwork for more advanced techniques. Advanced editing techniques As photographers become more experienced, they can explore advanced options to further enhance their still life images. Focus stacking in Photoshop ensures every detail is razor-sharp, a critical aspect of still life photography. Colour grading, though subtle, can significantly impact the overall feel of the image. Some photographers apply textures in Photoshop to add depth or imbue character into the photograph. Creating a cohesive style Developing a consistent editing style is key to creating a cohesive body of work. This involves finding the right balance in post-processing, favouring natural enhancements that complement the scene rather than overpowering it. Micro-adjustments to various facets of the image, such as refining sharpness and fine-tuning textures, contribute to the professional quality of still life photographs. By mastering these post-processing techniques, photographers can transform their still life images, ensuring that every nuance contributes to the overall perfection of the composition. Editing Tips — Still Life • Lock WB first: set a neutral white balance on one image, then sync to the whole series. • Global tone: set white/black points, then add mid-tone contrast with a gentle S-curve. • Local shaping: dodge highlights and burn shadow edges to add depth and guide the eye. • Texture control: add clarity/texture to the hero; soften busy props in the background. • Colour hygiene: use HSL to tame casts (reds/yellows in wood/food) and keep palette consistent. • Cleanup pass: heal dust/crumbs; straighten labels; fix tiny alignment issues. • Sharpen smart: apply capture sharpening lightly; export sharpening for web/print separately. • Consistent output: sRGB, matching crops/aspect ratios, and sensible filenames for the set. Examples of Still Life Photography At this point, I will redirect you to two of my clients, better than me on this subject execution, whom I mentored over a long period to produce a body of work on still lifes- they were projects to achieve the RPS Associates qualification and a perfect showcase of the topic being executed well Jacki Rosin ARPS - Still Life Flowers Alistair Willis ARPS - Still Life - Three Generations Conclusion Still life photography offers a unique canvas for artistic expression, allowing photographers to exercise complete control over their compositions. From mastering lighting techniques to arranging objects with care and applying thoughtful post-processing, this genre has a profound impact on visual storytelling. The skills developed in still life photography have applications across various photographic disciplines, enhancing a photographer's overall ability to create compelling images. To sum up, still life photography is more than just capturing inanimate objects; it's about breathing life into the seemingly ordinary. By honing their skills in lighting, composition, and editing, photographers can transform everyday items into extraordinary works of art. This genre not only sharpens technical abilities but also encourages creativity and attention to detail, making it a valuable pursuit for photographers at all levels. FAQs - What is still Life Photography? What exactly is still life photography?Still life photography is a specialised genre within fine art photography that concentrates on photographing inanimate subjects, which can be either natural or man-made. This form of photography aims to produce artistic images and has its roots in the early days of photography when capturing moving subjects was challenging. What does still photography refer to?Still photography is a term used to describe a standard photograph that is not part of a video or film. What are the two primary categories of still life photography?Still life photography can be divided into two main types: found and created. Found still life involves photographing a random assortment of objects as they are found, without rearranging them for the photo. Created still life, on the other hand, involves deliberately arranging objects to achieve a desired composition. What qualifies as a still life photograph?A still life photograph typically features inanimate subjects, often everyday items that can be either natural (such as food, flowers, or dead animals) or human-made (like drinking glasses, books, or jewellery). These are depicted in a way that focuses on their aesthetic and compositional qualities. 📚 Continue Learning Next lesson: → What is White Balance in Photography → The Art of Storytelling Photography → What is Contrast in Photography Personal support: → 1-to-1 Zoom Personalised Support online photography courseAlan Ranger2 January 2026Alan Ranger Photographyphotography genre LinkedIn0 Pinterest0",
  "wordCount": 2097,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/what-is-still-life-photography#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/what-is-still-life-photography#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Royal Photographic Society"
    },
    {
      "@type": "Thing",
      "name": "Associate of the Royal Photographic Society (ARPS)"
    },
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "RPS"
    },
    {
      "@type": "Thing",
      "name": "ARPS"
    },
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}