{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/what-is-focal-length-in-photography#blogposting",
  "headline": "15 What is FOCAL LENGTH in photography: A Beginners Guide",
  "alternativeHeadline": "15 What is FOCAL LENGTH in photography: A Beginners Guide | Alan Ranger Photography",
  "description": "This post solves it: You’ll learn what focal length really is, how it changes angle of view, influences the background size/blur for the same framing, and.",
  "url": "https://www.alanranger.com/blog-on-photography/what-is-focal-length-in-photography",
  "datePublished": "2026-01-02T00:00:00.000Z",
  "dateModified": "2026-01-02T00:00:00.000Z",
  "dateCreated": "2026-01-02T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "This post solves it: You’ll learn what focal length really is, how it changes angle of view, influences the background size/blur for the same framing, and how sensor size (crop factor) affects your lens choices—so you pick the right focal length on purpose. 3 key takeaways • Angle of view: shorter focal lengths include more scene; longer focal lengths narrow the view and magnify the background for the same framing. • Perspective = camera position: move your feet to change shape relationships; changing focal length without moving only crops/widens the view. • Crop factor: to compare framing, use focal length × crop (APS-C≈1.5×, MFT≈2×); DoF equivalence for the same framing needs a higher f-number on smaller sensors. Table of Contents Show Introduction to What is focal length in photography Understanding what focal length is in photography significantly influences the visual outcome of an image. The focal length is the distance between the lens and the point where light converges, which determines perspective, composition, and overall aesthetic. Understanding the focal length explained is crucial for photographers of all levels. The lens focal length measures the distance between the lens and the point where light converges. This interplay between optics and physics shapes the angle of view of photography. This guide explores the focal length's intricacies, impact on genres, and creative possibilities. Gain a profound understanding to elevate your photographic prowess. What is focal length and how does it affect your photos? The focal length definition, measured in millimetres, defines a camera lens's optical characteristics and angle of view. A shorter focal length, like a wide-angle lens, captures a broader field of view, ideal for landscapes, interiors, or group shots. A longer focal length, like a telephoto lens, narrows the angle of view, useful for isolating subjects or freezing action. The focal length formula also affects depth of field, with shorter lengths providing greater sharpness and longer lengths producing background blur. Understanding the focal length equation helps photographers choose lenses and compose images that align with their artistic vision. Different types of lenses and their focal lengths Focal Length & Lens Types — Angle of View, Uses & Tips Lens type Typical focal length (FF) Approx. diagonal AoV Look / perspective Best for (examples) Handy tips Fisheye 8–15 mm ~180° Extreme bend/curvature; huge coverage. Creative interiors, skies, tight spaces. Keep horizons central to limit bend; watch your feet/ tripod legs. Ultra-wide 14–20 mm 114–94° Exaggerates scale; pulls foreground close. Architecture, interiors, dramatic landscapes. Level the camera to avoid keystoning or correct in post; mind edge distortion. Wide-angle 24–35 mm 84–63° Broad view; context with moderate depth. Landscape, environmental portraits, street. Use strong foregrounds/leading lines; watch edge stretch at 24 mm. Normal / Standard 40–58 mm ~50–40° Natural perspective; unobtrusive look. Everyday, travel, documentary, 50 mm portraits. Great learning lens; zoom with your feet to set perspective first. Short telephoto 70–105 mm 34–20° Flattering faces; gentle background magnification. Portraits, detail studies, compressing scenes. Mind shutter speed for shake (~1/(focal length × crop)); use IBIS/OS. Telephoto 135–300 mm 18–8° Strong “compression”; isolates subjects. Events, stage, distant landscapes, pets. Use monopod/tripod; background blur increases with distance + longer FL. Super-tele 400–600 mm+ ~6–4° Very tight FoV; heavy background magnification. Wildlife, birds, field sports, moon. Track craft: high shutter, good support, pre-focus where action happens. Macro (1:1) 90–105 mm (also 60 / 150–200) As per FL True life-size close-up; razor-thin DoF. Insects, textures, product details. Stop down; use flash/diffusion; focus rail helps for stacking. Zooms (examples) 16–35, 24–70, 70–200 Varies Flexibility across multiple looks. Travel, weddings, run-and-gun coverage. Use ends for distinct styles (24 for story, 200 for isolation); learn your sweet spots. Notes: Angles shown are for full-frame (35 mm). For APS-C, multiply focal length by ~1.5× (Canon 1.6×). For Micro 4/3, ~2×. Perspective depends on camera position; focal length mainly changes angle of view. Telephoto Lens - 70-600mm Zoom lens 24-70mm Wide-Angle 16-35mm Telephoto Lens - 70-200mm Macro Lens 100m Designed for versatility - Walkabout Lens 24-105mm Buying Advice - What is focal length in photography I will cover this topic in more detail in an upcoming - “Hiring camera lenses or buy new or secondhand”. Please wait for this before rushing out thinking you need to buy x, y or z lenses to cover your interests. If you do need a lens urgently I recommend hiring for a period rather than buying. Lenslab has a vast array of choices to suit all camera brands, types and needs and provides excellent customer service. Understanding the concept of perspective in photography Perspective in photography is linked to focal length. Wide-angle lenses exaggerate foreground objects, creating depth and immersion. Telephoto lenses compress distance, flattening the perspective. Understanding perspective is crucial for controlling the visual narrative and evoking emotional responses. Focal length and its impact on composition Quick Tips — Focal Length & Composition • Set perspective first: move your feet to the best camera position, then pick a focal length to frame it. • Control background size: longer focal lengths magnify the background for the same subject size; wide lenses make it feel smaller. • Use foreground with wides: get close to a strong near object to add depth and exaggerate leading lines. • Use teles to simplify: step back and zoom in to remove clutter, stack layers, and isolate subjects. • Mind edge stretch: keep faces and verticals away from frame edges at 24–28 mm; keep the camera level to reduce keystoning. • Balance negative space: wide = breathing room and context; tele = tighter, subject-led balance. • Keep it sharp: hand-held shutter ≈ 1/(focal length × crop); stabilisation or support helps at 100 mm+. • Perspective ≠ focal length: only changing position alters perspective; zooming in/out just crops or widens the view. Wide-angle (14–35 mm) • Include environment & strong foregrounds • Exaggerate depth & converging lines • Great for landscapes, interiors, street Telephoto (85–300 mm+) • Compress layers; larger-looking backgrounds • Clean up edges; remove distractions • Great for portraits, details, wildlife Composition is the artful arrangement of visual elements within the frame, and focal length plays a pivotal role in shaping the compositional possibilities of an image. By understanding the relationship between focal length and composition, photographers can unlock new creative avenues and elevate their storytelling abilities. • Framing and subject placement: The choice of focal length directly influences the framing and subject placement within the composition. Wide-angle lenses allow for the inclusion of more environmental context, making them ideal for capturing expansive scenes or emphasising foreground elements. Conversely, telephoto lenses enable the isolation of subjects, facilitating the creation of intimate portraits or extracting intricate details from a larger scene. Depth perception and layering: Focal length plays a crucial role in shaping the perception of depth and layering within a composition. Wide-angle lenses exaggerate the distance between foreground and background elements, creating a sense of depth and dimensionality. Telephoto lenses, on the other hand, compress the perceived distance, flattening the perspective and allowing for the seamless integration of multiple layers within the frame. Leading lines and visual flow: The angle of view captured by different focal lengths can significantly impact the presence and effectiveness of leading lines within a composition. Wide-angle lenses can enhance the prominence of converging lines, guiding the viewer's eye through the frame, while telephoto lenses can isolate and emphasise specific lines or patterns, creating a more focused visual narrative. Negative space and balance: The choice of focal length influences the balance and negative space within a composition. Wide-angle lenses can create a sense of expansiveness, allowing for the incorporation of negative space as a compositional element. Telephoto lenses, conversely, can compress the scene, minimising negative space and creating a more intimate, subject-focused composition. By understanding the compositional implications of focal length, photographers can make informed decisions that align with their creative vision, crafting visually compelling images that captivate and engage the viewer. Choosing the right focal length for different photography genres Quick Tips — Choose the Right Focal Length by Genre • Landscape — 24–35 mm for context; 70–200 mm to isolate forms and compress layers. Wide (<24 mm) only when a strong foreground anchors the frame. • Portraits — 50–85 mm for half/three-quarter; 85–135 mm for headshots and background blur. Keep subjects away from edges at wider FLs. • Street / Documentary — 28–35 mm for environmental context; 40–50 mm for a natural look without distortion. Prime keeps you light and fast. • Sports / Action — 70–200 mm sideline all-rounder; 300–400 mm+ for field sports. Pair with fast shutter and support (monopod/IBIS). • Macro — 90–105 mm (or 60 mm close-working) for 1:1 detail. Stop down, add light (flash/diffuser), and consider focus rail/stacking. • Wildlife / Birds — 400–600 mm+ for reach; use higher shutters and pre-focus on perches/flight paths to improve hit-rate. • Travel / Events — 24–70 mm covers scenes + people; add 70–200 mm for stage or candid compression. • Architecture / Interiors — 16–24 mm to fit space; keep camera level or use a tilt-shift to manage verticals. Notes: Focal length sets angle of view; perspective comes from camera position. On APS-C multiply by ~1.5× (Canon 1.6×), on Micro 4/3 by ~2× to get full-frame equivalents. There’s no hard rule—pick the focal length that best supports the picture idea. Each photographic genre presents its own unique challenges and creative demands, and the choice of focal length plays a crucial role in achieving the desired visual outcome. By understanding the strengths and limitations of different focal lengths, photographers can make informed decisions that align with their artistic goals. Landscape photography: For breathtaking landscape shots, wide-angle lenses are often the assumed choice. Their expansive field of view allows for the capture of vast scenes, emphasising the grandeur of natural environments. Focal lengths ranging from 14mm to 24mm are commonly used, enabling photographers to encompass sweeping vistas and create a sense of immersion. However, as a landscape shooter I rarely shoot with less than 24mm focal length and frequently use a 70-200mm focal length to isolate and frame my subject in the landscape environment. Therefore, no rule relates to focal lengths in the landscape; it is just the right focal length to do the job and create the aesthetics desired. Portrait photography: When it comes to portraiture, focal lengths between 50mm and 135mm are widely favoured. These lenses provide a natural perspective, minimizing distortion and ensuring flattering representations of facial features. Longer focal lengths, such as 85mm or 135mm, create a pleasing background blur, allowing for subject isolation and enhanced depth perception. Street photography: The dynamic and spontaneous nature of street photography often calls for versatile focal lengths. Prime lens in the 35mm to 50mm range offer a natural perspective, while wider focal lengths, like 24mm or 28mm, can capture environmental context and create a sense of immersion in urban settings. Sports and action photography: In the fast-paced world of sports and action photography, telephoto lenses reign supreme. Focal lengths ranging from 70mm to 400mm or beyond allow photographers to capture subjects from a safe distance, freeze motion, and isolate the action from the surrounding environment. Macro photography: For exploring the intricate details of the natural world, macro lenses are indispensable. These specialised lenses, typically ranging from 60mm to 110mm, enable photographers to capture life-size or greater magnifications, revealing the intricate textures and patterns that often go unnoticed by the naked eye. Wildlife photography: Super-telephoto lenses are the go-to choice when photographing elusive and often distant subjects in their natural habitats. Focal lengths of 400mm, 500mm, or even 600mm and beyond allow photographers to capture intimate moments without disturbing or disrupting the subjects' natural behaviour. By understanding the unique demands of each photographic genre, photographers can make informed decisions about lens selection, maximising the creative potential of their equipment and capturing images that resonate with their artistic vision. Practical tips for using different focal lengths Master Focal Length Choices in the Field Download the 1-page field checklist with perspective tips, angle of view, and on-location drills. Download Focal Length Checklist (PDF) 1-to-1 Zoom Help Prefer a text link? Download the checklist here While mastering the theoretical aspects of focal length is crucial, translating that knowledge into practical application is equally important. Throughout my photographic journey, I have accumulated a wealth of practical tips and techniques that can help you harness the full potential of different focal lengths. Embrace the lens distortion: When working with wide-angle lenses, embrace the unique distortion they create. This distortion can be used creatively to exaggerate perspective, emphasise foreground elements, or create dynamic compositions with converging lines. Stabilize your shots: Longer focal lengths amplify camera shake, making it essential to use proper stabilisation techniques. Invest in a sturdy tripod, employ image stabilisation features if available, or increase your shutter speed to minimise blur caused by camera movement. Experiment with depth of field: Different focal lengths offer varying degrees of depth of field control. Explore the creative possibilities by experimenting with aperture settings and subject-to-background distances to achieve desired levels of background blur or sharpness. Utilise focal length for subject isolation: Telephoto lenses are powerful tools for subject isolation. By compressing the scene and creating a shallow depth of field, you can effectively separate your subject from the background, drawing the viewer's attention to the intended focal point. Leverage focal length for environmental context: Conversely, wide-angle lenses excel at capturing environmental context. Utilise their expansive field of view to create a sense of immersion, conveying the grandeur of a scene or emphasising the relationship between your subject and its surroundings. By incorporating these practical tips into your workflow, you'll unlock new creative possibilities and enhance your ability to craft compelling images that resonate with your artistic vision. Conclusion: Mastering focal length for stunning photography Mastering focal length is a journey that goes beyond technical proficiency. It is a path towards artistic expression and visual storytelling. Throughout this guide, we have explored the impact of focal length on composition, perspective, and creative possibilities. Understanding the relationship between focal length, angle of view, and depth of field allows photographers to make informed decisions about lens selection and composition. This leads to visually compelling images that captivate and engage viewers. Mastering focal length is an ongoing exploration, a constant pursuit of artistic growth and self-expression. Embrace the unique characteristics of each focal length as you embark on this journey. Let them guide you towards new creative horizons. Experiment with different perspectives, push the boundaries of traditional techniques, and allow your artistic vision to flourish. Remember, photography's true power lies in evoking emotions, telling stories, and capturing the essence of the world. By harnessing the full potential of focal length, you can elevate your craft and leave a lasting impact on those who experience your work. Join our workshops to delve deeper into the art of focal length and unlock your creative potential. Book your spot today and take your photographic prowess to new heights. FAQs - Common misconceptions about focal length Despite its fundamental importance in photography, the focal length is often surrounded by misconceptions and misunderstandings. Addressing these common myths is crucial to ensure a comprehensive understanding of this pivotal concept. Myth: Focal length determines image quality: Many photographers mistakenly believe that focal length directly impacts image quality. However, the truth is that image quality is primarily determined by factors such as sensor size, lens construction, and f-number settings. Focal length merely affects the angle of view and perspective, not the inherent quality of the image. Myth: Longer focal lengths always produce better background blur: While telephoto lenses are renowned for their ability to create stunning background blur (also known as \"bokeh\"), the degree of background separation is influenced by a combination of factors, including aperture, subject-to-background distance, and sensor size. A long focal length alone does not guarantee superior background blur. Myth: Wide-angle lenses are only for landscapes: While wide-angle lenses are indeed popular in landscape photography, their versatility extends far beyond that genre. They can be effectively used in various scenarios, such as architectural photography, environmental portraits, and even creative close-up shots, where exaggerated perspective and lens distortion can be leveraged for artistic expression. Myth: Crop factor doesn't matter with fixed focal length lenses: When using crop sensor cameras, the crop factor (also known as the \"focal length multiplier\") does indeed affect the effective focal length of a lens. This means that a 50mm lens on a crop sensor camera will not provide the same field of view as a 50mm lens on a full-frame camera. Myth: Focal length determines depth of field: While focal length plays a role in depth of field, it is not the sole determining factor. Aperture, subject-to-camera distance, and sensor size also significantly impact the depth of field. A longer focal length alone does not guarantee a shallower depth of field. By dispelling these common misconceptions, photographers can develop a more accurate understanding of focal length and its relationship with other photographic principles, ultimately empowering them to make informed decisions and achieve their creative vision. 📚 Continue Learning Next lesson: → FULL FRAME vs Cropped Sensor → What is Aperture in Photography → What is Depth of Field Personal support: → 1-to-1 Zoom Help photography-tips, online photography courseAlan Ranger2 January 2026Alan Ranger Photographycamera settings for photography, sharp photos, sharpness”, “focus”, “camera shake”, “tripod”, “shutter speed LinkedIn0 Pinterest0",
  "wordCount": 2890,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/what-is-focal-length-in-photography#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/what-is-focal-length-in-photography#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}