{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/whats-new-in-lightroom-classic-13#blogposting",
  "headline": "What's new in Lightroom Classic 13 (2024) - First Glance",
  "alternativeHeadline": "What's new in Lightroom Classic 13 (2024) - First Glance | Alan Ranger Photography",
  "description": "What’s New In Lightroom Classic In the ever-evolving world of photography, photographers need to stay up-to-date with the latest tools and features.",
  "url": "https://www.alanranger.com/blog-on-photography/whats-new-in-lightroom-classic-13",
  "datePublished": "2023-10-12T00:00:00.000Z",
  "dateModified": "2023-10-12T00:00:00.000Z",
  "dateCreated": "2023-10-12T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "What's new in Lightroom Classic 13 (2024) - First Glance What’s New In Lightroom Classic In the ever-evolving world of photography, photographers need to stay up-to-date with the latest tools and features available to them. Adobe Lightroom, a popular software among professionals and enthusiasts alike, has recently released its latest version, Lightroom Classic 13. In this comprehensive guide, we'll explore the exciting new features and enhancements that this update brings, empowering photographers to take their craft to new heights. So, without further ado, let's dive into what's new in Lightroom! What’s New In Lightroom Classic -HDR Display and Editing: Unleash the Power of Dynamic Range One of the standout features of Lightroom Classic 13 is its support for HDR display and editing. HDR, or High Dynamic Range, allows photographers to capture and display a wider range of tones, resulting in more vibrant and lifelike images. With Lightroom's HDR capabilities, you can now work in an HDR colour space and view your images on HDR-supported displays, ensuring accurate and stunning visual representation. Import your RAW files or merge HDR images to activate HDR mode in Lightroom. You'll immediately notice the expanded range and enhanced details in your photos. Moreover, you can export your edited images in HDR-compatible formats, although HDR HEIF images are currently unsupported. This feature is particularly beneficial for photographers working with newer cameras that capture images in HDR-compatible formats, as it allows for precise editing and faithful representation on HDR displays. What’s New In Lightroom Classic - AI-Based Depth Blur: Unleash Your Creativity Lightroom Classic 13 introduces an exciting AI-based depth blur feature that allows photographers to create realistic depth-of-field effects. With this tool, you can generate an artificial depth map for your image and apply blur based on that map. The result? Stunning images with a professional-looking bokeh effect. The AI-based depth blur feature in Lightroom Classic 13 offers a range of options and controls to achieve the desired effect. You can visualize the depth map and adjust the area of focus using a slider. Additionally, you can refine the depth map by brushing in or out areas of focus. This feature is not limited to images captured with depth information; it can also be applied to photos from devices like iPhones that embed depth maps. With AI-powered depth blur, the possibilities for creative expression are endless. What’s New In Lightroom Classic - Point Colour: Fine-Tune Your Colors with Precision Photographers who seek precise control over their colours will appreciate the addition of the Point Colour feature in Lightroom Classic 13. This new tab in the Color Mixer panel allows you to edit individual colours with unparalleled accuracy. Unlike the traditional colour mixer, which offers a fixed set of colours, Point Colour enables you to select specific colours directly from your image for targeted adjustments. Using the eyedropper colour picker, you can sample colours from your image and create a range of controls for precise editing. The large palette visually represents the selected colour, and you can adjust its destination colour for remapping. Sliders are available to fine-tune the selected colour's hue, saturation, and luminance. Additionally, a range slider allows you to define how much the selected colour range is affected. With Point Colour, you can achieve professional-grade colour adjustments without leaving the Lightroom environment. What’s New In Lightroom Classic - Enhanced Performance: A Seamless Editing Experience In addition to these major feature updates, Lightroom Classic 13 also brings several performance improvements to enhance your editing workflow. Adobe has worked tirelessly to address bugs, optimize metadata operations, and improve the stability and speed of various tasks. Let's take a closer look at some of these performance enhancements: • Faster image conversion to DNG: Converting your images to the Digital Negative (DNG) format is now quicker and more efficient, allowing you to streamline your workflow. Improved metadata operations: Reading, writing, and managing metadata in Lightroom Classic 13 is now faster and smoother, ensuring a seamless experience when working with large catalogues. Enhanced XMP writing and reading: Lightroom Classic 13 offers improved performance when reading and writing XMP metadata, enabling faster synchronization and management of your image information. Stability and performance improvements: Folder move and delete operations, as well as image loading in the Develop loupe view, have been optimized for increased stability and responsiveness. These performance enhancements contribute to an overall improved editing experience, allowing you to focus on your creative process without being hindered by technical limitations. What’s New In Lightroom Classic - Expanded Camera and Lens Support: Stay Up-to-Date Lightroom Classic 13 continues to expand its support for the latest cameras and lenses, ensuring that photographers have access to the most up-to-date profiles. Adobe regularly updates the list of supported camera models and lens profiles, enabling you to take full advantage of Lightroom's capabilities. By keeping your software updated, you can ensure compatibility with your gear and achieve optimal results in your post-processing workflow. To stay informed about the latest additions to the supported profiles, you can visit Adobe's official website. What’s New In Lightroom Classic - Additional Enhancements: Fine-Tuning Your Workflow In addition to the major updates mentioned above, Lightroom Classic 13 introduces several minor enhancements that further refine your editing workflow. These improvements aim to streamline common tasks and provide a more efficient user experience. Let's explore some of these additional enhancements: Presets and Preset groups filtering: Lightroom Classic 13 now offers an enhanced filtering system in the Presets panel, allowing you to quickly find the desired presets or preset groups based on their names. Edit history preview: In the Develop loupe view, you can now preview the edit history by hovering over any history step, providing a convenient way to review and compare your edits. Improved import options: Lightroom Classic 13 offers a range of options for importing photos, including cameras, card readers, folders, Photoshop Elements, and tethered cameras. You can specify import preferences and customize the filename template to suit your needs. Refined colour range control: The Refine Color Range panel provides precise control over the range of selected colours, allowing you to fine-tune your colour corrections easily. These additional enhancements contribute to a smoother and more efficient editing workflow, saving you time and effort as you bring your creative vision to life. Conclusion: Unleash Your Creative Potential with Lightroom Classic 13 - What’s New In Lightroom Classic With the release of Lightroom Classic 13, Adobe continues to empower photographers with innovative features and enhancements. From HDR display and editing to AI-based depth blur and precise colour control, Lightroom Classic 13 offers a wealth of tools to help you unleash your creative potential. Combined with the performance improvements and expanded camera and lens support, this update ensures that you stay at the forefront of the photography world, delivering stunning images that captivate and inspire. So, upgrade to Lightroom Classic 13 and embark on a journey of limitless possibilities in the world of digital photography. Remember, the key to mastering Lightroom is practice and continuous learning. As you explore the new features and tools, don't hesitate to experiment and push the boundaries of your creativity. With dedication and perseverance, you'll unlock new levels of artistry and transform your photography into a captivating visual story. Start your Lightroom Classic 13 journey today and embark on an exciting adventure of creativity and growth! If you want an experienced tutor who has used Lightroom for over 15 years, then get in touch about my Lightroom beginners course or delve deeper with personalised 1-2-1 tuition to suit your level and requirements. \"Photography is the story I fail to put into words. Lightroom Classic 13 empowers me to tell that story with stunning visuals.\" - Anonymous. Credit to Jeff Hirsch Photography for producing a detailed, but no waffle explanation of all the new enhancements of What’s New In Lightroom Classic. I’ve watched several, but this was the best one for an overview. He didn’t cover the new file formats of Jpeg XL, and I think many are currently looking at the new format and weighing up the gains of smaller file sizes versus any loss of quality - so the jury is still out on whether this is a better format. lightroom, photography-basics, photography-courses, photography-tips, recommended-productsAlan Ranger12 October 2023Alan Ranger Photographylightroom, editing-photos, news LinkedIn0 Pinterest0",
  "wordCount": 1377,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/whats-new-in-lightroom-classic-13#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/whats-new-in-lightroom-classic-13#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Adobe Lightroom"
    }
  ],
  "mentions": [
    {
      "@type": "Thing",
      "name": "Lightroom"
    }
  ]
}