{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/which-lens-should-i-buy-next#blogposting",
  "headline": "Buying a lens.... Which lens should I buy next? | Guide",
  "alternativeHeadline": "Buying a lens.... Which lens should I buy next? | Guide | Alan Ranger Photography",
  "description": "Full frame lenses are based on 35mm sensor size so the focal length, shown in mm is what you actually record on the sensor/image.",
  "url": "https://www.alanranger.com/blog-on-photography/which-lens-should-i-buy-next",
  "datePublished": "2021-02-16T00:00:00.000Z",
  "dateModified": "2021-02-16T00:00:00.000Z",
  "dateCreated": "2021-02-16T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "before you purchase. Full frame lenses are based on 35mm sensor size so the focal length, shown in mm is what you actually record on the sensor/image. Crop sensor frames are generally 1.5 crop factor so the focal length , shown in mm is not what you are actually getting - see the following tables: View fullsize Camera Sensor Sizes Full frame verses 1.5 crop and 4/3rds sensor size Focal lengths on different sized sensors As you can see to obtain, for example, an extreme wide angle of 20mm on a full frame camera you need a crop sensor lens focal length of 13mm and micro 4/3rds sensor focal length of 10mm to give you the same field of view. Note therefore that at wide angle focal lengths the crop sensor is quite a big disadvantage as you may need to purchase something like a Sigma 10-20mm to get the equivalent of a full frame sensor focal length of 16-24mm. At the other end of the focal range, the cropped sensor focal length has the advantage (theoretically) of extra zoom - this is debatable as to whether this is an advantage when it comes to pixel quality and sharpness but it certainly will give you the field of view of 1.5 times more focal zoom. Eg. a Crop sensor lens at 125mm will give the same angle of view as the full frame at 200mm. Full frame lenses will cost considerably more than crop sensor lens - they optically far superior to crop sensor lenses, come in generally less smaller focal ranges, are made with higher quality materials, generally weather sealed and because of build quality can weigh a lot more. Which lens should I buy? - Which focal lengths do I need? It obviously depends on what subjects you are likely to photograph more often than others. It's very easy to kid yourself into thinking you need a case full of lenses for all eventualities and if budget is not a constraint, or the weight and size of camera bag you have to hump around then yes, sure buy them all. However, from personal experience and talking to others you will find that over time you probably only use a couple of lenses on a regular basis. Personally, I would advise in purchasing just what you need but buying the best you can afford, thinking long term, and for those rare occasions you need a specialist or specific lens then hire it. There are many places online now that offer affordable lens hire packages. Lens for Hire Hire a camera Lens Pimp Calumet If you use Lightroom then you may not know this but you can view all your focal lengths used across your whole library over time or selectively filter years, apertures or whatever other pointy-horned, forked-tail geeky analysis you want. Just go to the top level of the catalogue or drive your photo's are stored on. Make sure you select \"show photos in subfolders\" is checked in the library menu top navigation. Switch to Grid View and then across the top you will see a tab to select Metadata. You will then see 4 tabs - you can select any value you want to filter by across all four tabs.Example: Lens : Focal Length : Aperture As you can see, it's now possible to see a count of how many photos I have taken at any given focal length and aperture - and more besides if I want to get really geeky! My goto lenses - Which lens should I buy I use a Sony Full Frame Camera (A900 and A99) so i am somewhat fortunate, i would argue wise, that I have the option of Carl Zeiss zoom lenses. Carl Zeiss are recognised throughout the industry as one of the leading optics producers. They have an exclusive deal with Sony to only produce \"zoom\" lenses for Sony so whilst you can buy Carl Zeiss for a Nikon or Canon and so on they will only be prime lenses. (prime means fixed focal length no zoom range) So my two lenses of choice and actually pretty much for 90% of my photography are: 24-70mm and 70-200mm both F2.8 throughout the focal ranges. I also have the lens extender x2 which is useful on the 70-200mm when I occasionally need more reach, however it will undoubtedly dilute the optical quality when fully extended to 400mm. These two lenses work for me as they give me wide angle when I need it and more often for me the ability to isolate and frame with more consideration and precision using the 70-200mm. The downside of these two lenses is weight and cost. They are not light given the F2.8 throughout the range and they both cost c£1500 each. Beginner's Lenses - Which lens should I buy Given my business is about tutoring mainly beginners in photography I am naturally asked by that group of people what's the next lens after realising the kit lens that comes with camera's these days (18-55mm) really is poor quality and disappointingly soft. Most beginner's i know are not ready to part with £3k for two new lenses and want something in the interim to improve on the kit lenses but also not break the bank. My general advice is until you know which specific genres you really want to specialise in then an all-rounder lens suits most people needs. Most people meaning a bit of everything from sight seeing, portraits, landscapes, architecture, wildlife to sports. I'm am sure you can already see the weakness in a lens that can cope with that amount of variation. Firstly it would need to cover a focal range from around 18mm to 300mm and an aperture from F4 as a minimum. A lens cannot be optically at it's best when it has to cover such a vast focal range so you will notice that the ALL-IN-ONE lenses that boast huge focal ranges tend to also have poor reviews in optical sharpness and other lens distortion attributes. I would suggest something that was a compromise between the two - cost and quality. The focal ranges of 24mm to 105mm or there abouts are generally ok. Whilst it won't get you to that rare bird perched on a stick 100 meters away it will give you a wide range of focal lengths and angle of views to accommodate most of your scenarios. They will cost c£450-£500. If you really need more zoom than the 24mm-105mm provides then there are ranges from most manufactures from c18mm to 200/250mm for about the same price but be aware as I said earlier you will be sacrificing some optical quality and will notice more lens distortion. If you want to do some research yourself then I would like to point out that it's easy to find people saying how wonderful any lens is just as it's easy to find many saying how rubbish it it. If you want to try and get some \"neutral\" facts then the sites I recommend are the following. Not least of which because they actually show you where the sweet spots are and where and how much each lens is affected by defraction and distortion. DP Review DXO Mark SLR Gear Specialist Lenses - Which lens should I buy If you're in the marketplace to spend more and expand your lens choices then other than a couple of good zooms the following might be what you are looking for: Wide Angle Useful for architecture and landscapes • 10-20mm for a crop sensor - Sigma do a F4 version for all manufacturers at c£300 16-35mm for full frame sensor - most manufacturers offer an equivalent focal range either at F4 or F2.8 c£700-£1500 Macro Lens Useful for really detailed close-ups of anything - capture amazing microscopic details Macro lens are a fixed focal length (prime lens) and vary in choices from around 80mm to 110mm. The longer focal lengths are beneficial as means you don't have to be so close to the subject and can avoid casting your own shadow over the subject or spooking it if it's alive! Please note lens that are zooms with a macro switch/mode on them are not actually macro. Typically a F2.8 macro lens at around 100mm will cost c£500-£700 Zoom Lens Useful for sports and wildlife. This is where it starts to get really expensive. A long focal ranger combined with a fast (wide aperture) is going to drain the bank. A 300mm fixed focal length at F4 will be c£1200 A zoom lens at 200mm-400mm at F2.8 will be c£4500 A 600mm fixed focal length at F4 will be c£7000 Portrait Lens The 50mm F1.8 or F1.4 has become known as the portrait lens - mainly for marketing purposes in my opinion. Anyone who has shot portraits will know that to fill the frame on a 50mm lens means being a meter away from the subject and that can be very intimidating. It's a great lens in the fact that it's an F1.4 or F1.8 and retails at c£100-£200, but in reality having owned one for many years I can honestly say I don't use it and shoot all my portraits on a range between 70-200mm. However, if you want to part with £200 for a fast lens that can be used in many situations and is not going to break the bank then it's a nice lens to own. Tilt Shift Useful for architecture and landscapes - tilt and shift movements can be made independently of each other. This means perspective and depth of field can be controlled separately, vastly enhancing lens flexibility and ability to focus from in front of the lens to infinity. They also allow you correct any vertical distortion - seen as building leaning backwards or converging lines vertically. Take a look at this introduction article on TS Photography Tilt Shift Lenses are fixed focal lengths and vary in maximum aperture sizes so naturally those are the factors that affect the price the most. Typically a TS lens at 24mm will cost c£700-£1500 I hope this helps anyone not sure about what lens they need/want and gives a bit more insight into the many considerations there are when buying lenses. Lens Calibration - Ensure sharp results and accurate focusing Finally whilst most lenses these days are extremely accurate when it comes to focusing where the focus point is. However you shouldn't assume that the autofocusing is pin-point accurate and it is not untypical to see a lens miss focus on the wrong subject because lens is back focusing or forward focusing. All cameras and lenses are manufactured within certain tolerances. This means that a camera or lens is considered in spec if it falls within a certain range of accuracy. Every manufacturer is different. Sometimes a lens that is front or back focusing +/-3 is considered within normal operating quality. What Is Front/?Front focusing is when the focus falls in front of your intended subject and back focusing is when the focus falls behind your intended subject. Barring user error, a lens could be tested at -2 and back focusing slightly or tested at +1 and front focusing slightly. Both are considered within the range of normal tolerance. Cameras compound the issue. Sometimes, a lens can be back focusing slightly and that is not a problem. But if it is mounted on a camera that is also back focusing slightly then you are now shooting outside the range of spec. Micro adjustmentsThe good thing about making micro adjustments on your camera is that it increases the accuracy of your focusing. Most cameras have micro adjustment options, including Canon, Nikon, Sony, Olympus, and Pentax. If your lens is back or front focusing, you can go into the menu of your camera and make it aware of this lens’ issue, however slight the issue may be. How to see if your camera has the ability to micro adjust the autofocus for each lens For Nikon, it’s under the wrench or setup menu. It’s labeled as AF fine-tune and has a diagram showing you where you are moving the focus point. You want to only change the saved value, and make sure that the fine-tune is turned on. It will remember the changes each time you put that lens on, so you should only have to adjust it once. For Canon cameras, it’s very similar. You make the changes in the Function then Auto Focus settings, and the rest is the same as when done with to a Nikon body. Remember, though, if you have multiple cameras, you are making the adjustment in the camera, not the lens, so you need to calibrate each lens on each camera. For Sony cameras - Press MENU. Select Setup. Select AF Micro Adj. Select AF Adjustment Setting. Select On. Select Amount. Turn the control wheel to adjust the value. Press the center button of the control wheel when finished. How to correct the alignment You can buy a kit, such as https://michaeltapesdesign.com/lensalign.html and do it yourself or you can bring your camera and lenses to do me and I will do it for you for £25 Alan Ranger Photography Services news, photography-tips, recommended-productsAlan Ranger16 February 2021Alan Ranger Photographylenses, gear, recommended-products, NIK LinkedIn0 Pinterest0",
  "wordCount": 2220,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/which-lens-should-i-buy-next#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/which-lens-should-i-buy-next#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}