{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/white-balance-and-colour-photography#blogposting",
  "headline": "White Balance and Colour Photography Practice Assignment",
  "alternativeHeadline": "White Balance and Colour Photography Practice Assignment | Alan Ranger Photography",
  "description": "White Balance and Colour. This assignment focuses on understanding and applying white balance settings in photography to achieve accurate colour representation.",
  "url": "https://www.alanranger.com/blog-on-photography/white-balance-and-colour-photography",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "WHITE BALANCE AND COLOUR PHOTOGRAPHY PRACTICE ASSIGNMENThttps://www.alanranger.com/free-online-photography-courseWHITE BALANCE AND COLOURThis assignment focuses on understanding and applying white balance settings in photography to achieve accurate color representation. Students will learn how to manipulate white balance in various lighting conditions to enhance their photography skills.LEARNING OBJECTIVES * Understand the different white balance settings and their applications. * Learn how to shoot with a grey card for custom white balance. * Experiment with creative white balance adjustments to influence mood and tone.WANT FEEDBACK ON YOUR ASSIGNMENT?Join Foundation Plus and get personalised monthly critique plus full access to all assignments.Learn More & Join Download Assignment PDF BEFORE YOU SHOOT * Familiarize yourself with your camera's white balance settings. * Obtain a grey card or a neutral reference card for custom white balance. * Select a consistent lighting environment for your shoots to minimize color casts. * Ensure your camera is set to shoot in RAW format for maximum editing flexibility. * Charge your camera battery and have sufficient memory card space for the session.THE ASSIGNMENTTECHNICAL FOCUS * Use apertur lect a consistent lighting environment for your shoots to minimize color casts. * Ensure your camera is set to shoot in RAW format for maximum editing flexibility. * Charge your camera battery and have sufficient memory card space for the session.THE ASSIGNMENTTECHNICAL FOCUS * Use aperture priority mode to control depth of field while letting the camera adjust shutter speed. * Set your ISO to a fixed value of 200 to maintain consistent image quality. * Explore using the Kelvin scale for precise control over color temperature. * Understand the implications of mixed lighting and how to adjust white balance accordingly. * Use the white balance eyedropper tool in post-processing for RAW images to correct color casts.CREATIVE FOCUS * Experiment with warming up or cooling down the white balance to create different moods. * Use white balance creatively to make skin tones appear more natural under mixed lighting. * Introduce color casts intentionally for artistic effects in your compositions. * Balance the key light source with white balance adjustments to enhance your subject. * Consider the emotional impact of color and adjust white balance to align with your artistic vision.ASSIGNMENT TASKS 1. Shoot a series of portraits in different lighting conditions (tungsten, daylight, shade) using auto white balance and compare results. 2. Use aperture priority mode at f/4 with ISO 200 fixed, letting the camera set shutter speed; shoot a scene with a grey card to establish custom white balance. 3. Capture an outdoor scene during golden hour; adjust white balance settings to emphasize warmer tones and document the results. 4. Photograph a still life object under fluorescent lighting with the camera set to its fluorescent white balance preset and evaluate the color accuracy. 5. Experiment with custom white balance using a grey card; shoot the same scene multiple times and adjust the Kelvin temperature for creative exploration. 6. Use shutter priority mode at 1/250s with ISO 200 fixed, letting the camera set aperture; photograph a moving subject in mixed lighting, adjusting white balance to capture natural colors.💡 Stretch Tasks * Create a series of images that showcase extreme adjustments to white balance (e.g., very warm and very cool) and discuss the visual impact of each. * Conduct a comparative analysis of JPEG vs. RAW files focusing on white balance correction capabilities in post-processing.DO / DON'TDO * ✓ Do use a grey card to set a custom white balance for accurate color representation. * ✓ Do experiment with different white balance presets to see their effects on your images. * ✓ Do keep your camera set to RAW for more flexibility in post-processing. * ✓ Do take notes on the lighting conditions and white balance settings used for each shot. * ✓ Do review your images on a calibrated monitor to assess color accuracy.DON'T * ✗ Don't rely solely on auto white balance in challenging lighting situations without checking results. * ✗ Don't forget to adjust your camera settings if the lighting conditions change. * ✗ Don't shoot in JPEG if you want to correct white balance extensively in post-processing. * ✗ Don't ignore the impact of color casts from mixed lighting when setting white balance. * ✗ Don't skip using a grey card when possible; it provides a reliable reference.REFLECTION QUESTIONS * How did different lighting conditions affect your ability to achieve accurate colors? * In wh",
  "wordCount": 733,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/white-balance-and-colour-photography#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/white-balance-and-colour-photography#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    }
  ]
}