{
  "@context": "https://schema.org",
  "@type": "BlogPosting",
  "@id": "https://www.alanranger.com/blog-on-photography/wildlife-photography-practice-assignment-free-lesson#blogposting",
  "headline": "Wildlife Photography Practice Assignment - Free Lesson",
  "alternativeHeadline": "Wildlife Photography Practice Assignment - Free Lesson | Alan Ranger Photography",
  "description": "Learning Objectives • Understand the importance of patience and observation in wildlife photography.",
  "url": "https://www.alanranger.com/blog-on-photography/wildlife-photography-practice-assignment-free-lesson",
  "datePublished": "2025-11-23T00:00:00.000Z",
  "dateModified": "2025-11-23T00:00:00.000Z",
  "dateCreated": "2025-11-23T00:00:00.000Z",
  "inLanguage": "en-GB",
  "articleBody": "Learning Objectives • Understand the importance of patience and observation in wildlife photography. • Learn to use aperture priority or shutter priority modes effectively. • Develop skills in composing wildlife images to convey the subject's behavior and habitat. Want feedback on your assignment? Join Foundation Plus and get personalised monthly critique plus full access to all assignments. Learn More & Join Download Assignment PDF Before You Shoot • Research the local wildlife species you intend to photograph and their behaviors. • Scout the location in advance to identify potential shooting spots and times. • Pack necessary gear, ensuring you have a telephoto lens suitable for wildlife. • Check the weather forecast to plan for optimal shooting conditions. • Prepare to spend extended periods in the field to increase chances of capturing desired moments. The Assignment Technical Focus • Use aperture priority mode to control depth of field when photographing animals in their habitats. • Utilize shutter priority mode to freeze motion during dynamic wildlife behavior. • Set ISO to a fixed value (ISO 200) to maintain consistent exposure settings. • Focus on the animal's eyes to enhance engagement in the photograph. • Utilize continuous shooting mode to capture multiple frames of fast-moving wildlife. Creative Focus • Experiment with different angles and perspectives to add interest to your wildlife shots. • Incorporate the environment into your compositions to tell a story about the animal's habitat. • Use leading lines to draw the viewer’s eye towards the wildlife subject. • Capture candid moments that reveal the behavior and interactions of wildlife. • Consider the use of negative space to emphasize the subject in your images. Assignment Tasks • Use aperture priority mode at f/5.6 with ISO 200 fixed, letting the camera set shutter speed to capture a bird in flight. • Set your camera to shutter priority mode at 1/1000s with ISO 200 fixed, allowing the camera to set aperture to photograph a running deer. • Capture a close-up shot of a resting animal using aperture priority mode at f/4 with ISO 200 fixed to create a blurred background. • Photograph a group of animals interacting using shutter priority mode at 1/250s with ISO 200 fixed to freeze the action. • Use aperture priority mode at f/8 with ISO 200 fixed to photograph a landscape with wildlife, ensuring both the subject and background are in focus. • Set shutter priority mode at 1/500s with ISO 200 fixed to capture a bird landing on a branch, letting the camera adjust the aperture. 💡 Stretch Tasks • Experiment with long exposure techniques using a tripod to capture wildlife moving through a scene at dusk, while maintaining ISO 200. • Create a series of images that document the behavior of a specific animal over a period, focusing on different times of day and settings. DO / DON'T DO • ✓ Do be patient and wait for the right moment to capture wildlife. • ✓ Do use a tripod to stabilize your shots, especially in low-light conditions. • ✓ Do respect wildlife and maintain a safe distance to avoid disturbing them. • ✓ Do familiarize yourself with local wildlife laws and regulations regarding photography. • ✓ Do keep your gear ready and accessible for spontaneous opportunities. DON'T • ✗ Don't approach wildlife too closely, as it may stress or scare them away. • ✗ Don't use flash photography, as it can startle animals and disrupt their natural behavior. • ✗ Don't forget to check your camera settings before shooting. • ✗ Don't ignore the background in your compositions; it can make or break your shot. • ✗ Don't rush your shots; take your time to observe and compose. Reflection Questions • What challenges did you face while trying to photograph wildlife, and how did you overcome them? • How did using priority modes change the way you approached shooting wildlife? • What did you learn about animal behavior that helped you capture better images? • How can you improve your patience and observational skills for future wildlife photography sessions? For Foundation Plus members: Submit 3 images from this assignment for personalised feedback in your next Zoom session. You should upload to the shared Dropbox folder - link provided by Alan when you joined Foundation Plus. Alan Ranger0 Pinterest0",
  "wordCount": 712,
  "image": {
    "@id": "https://www.alanranger.com/blog-on-photography/wildlife-photography-practice-assignment-free-lesson#primaryimage"
  },
  "author": {
    "@id": "https://www.alanranger.com/#person"
  },
  "publisher": {
    "@id": "https://www.alanranger.com/#org"
  },
  "isPartOf": {
    "@id": "https://www.alanranger.com/#website"
  },
  "mainEntityOfPage": {
    "@id": "https://www.alanranger.com/blog-on-photography/wildlife-photography-practice-assignment-free-lesson#webpage"
  },
  "about": [
    {
      "@type": "Thing",
      "name": "Exposure (photography)"
    },
    {
      "@type": "Thing",
      "name": "Aperture (photography)"
    },
    {
      "@type": "Thing",
      "name": "Shutter speed"
    },
    {
      "@type": "Thing",
      "name": "Photographic composition"
    },
    {
      "@type": "Thing",
      "name": "Landscape photography"
    }
  ]
}